[[[[[[[[[[[[[{"vinitha12345": " These biscuits are better in taste.the sound that crunchy that makes to us feel and eatcompared to the other biscuits in this contain healthy snacks to childrens .this are healthy snacks.in these classican american cream and onion oil are added this makes biscuits maska and crunchy.these are light food as we will take it as daily.no problem with this.when you seee this biscuits undoubtedly your mouth wateringlu as yummy definately.!", "ganeshgawade1111": " Hello friends, Britannia 50-50 Biscuits is my fevorite biscuit.The sweet and salty britannia biscuits have ruel indian tea time  snaks for a long time, however this biscuits cannot be a meal replacement as they are very rich and simple carbohyadrates and sugar.this britannia biscuits flavor is the long time continues best flavor, this biscuits product packing is also very good, Biscuits quality and quantity also good, In my my father and me everyday eaten this biscuits at evening time.I love Britannia 50-50 Biscuits.Thanks.", "talhabilal29": " Energetic food with taste not for only children as well as suitable for all ages population because Maska Chaska is a delightful biscuit dipped in butter and peppered with the choicest of herbs. Needless to say, this mouth watering biscuit soon became an instant hit and a regular in most households. Its for only 10 rupees. Britannia 50-50 Sweet &amp; Salty is a fun mix of two completely opposite flavors, a biscuit that is deliciously sweet and scrumptiously salty.", "aceracer": " Hi| friends in market various types of tasty biscuits are available but mostly  I prefer Britania 50-50  biscuit for its some kind of different taste ie-50 sweet 50salty.I have never  any bad experience with this product. These biscuits contains balanced amount of sugar, flour, baking oil, and other required ingredients.This biscuit is nicely coverd  and polished biscuit. I have been eating this biscuit since my childhood days &amp; my family also take it with tea .Every age of people can taste this nice crunchy biscuit . I even love the 50 50 biscuit ads in tv as they are  very funny and interesting .I recommed u guys to try this biscuit and thanks for reading my comments.", "mussarathrafiulla": " Britannia 50 - 50 biscuit r one of the best biscuit .i have been eating this biscuit since my childhood .They r very tasty biscuit with very crunch one with sweet and salty taste .There r one of the most of famous and we can get it easy .Many people like its bisciut , my whole family likes it , And as it is from britannia 50 - 50 biscuit , it has mantainted it best quality and the price is also resonable rate .i even love the 50 50 biscuit ads in tv as the r very funny and interesting .i recommed u guys to try this biscuit and thanks for reading my comments", "strikervikas": " As we know britannia is great company in india and we also know there's perfect competion in market for biscuit and many things. which means if someone decrease the price you will out of competition.and britannia 50, 50 facing the competition and secured thier pistion. 50-50 have both sweet and salty flavour in same packet thats why most of people like them.if you haven't eat this biscuit you have to buy one and take break from life. its good just like other britannia biscuit espacly brinnia good day", "aksurya_77": " I have been eating these delights since last 25 years or more but the crunch has never gone down and so is my love for these. The flavor is as preserved as it was and the uniqueness is maintained though the brand expanded.Britannia is a highly reputed company in India for years and  the products are known for their quality and they have managed to maintain the quality of these biscuits very well.Though the packaging has been changed over times but they always come in a neat packing, squared in shape, the flavour is salt and sweet.they can be enjoyed in the evening time with tea or coffee. It is apt for trip, picnic, long drive etc. It is very crunchy and yummy.I have so far loved these &amp; hope to continue provided they keep the taste &amp; quality maintained.Highly Recommend!", "ashif1828": " Hi friends, as we know that Britannia 50-50 is delecious Biscuits, if we see the ingredians of it then we come to know that 12.68 Gram. 4 Calories per Gram then 12 Gram Fat=12 into  4 is equal to 48 Calories whole packet include 310 calorie is equal to one meal. We can see are lot of options even in snacks, Which you can munch on to satisfy that untime hunger rants without gaining that extra kilos.Britannia is not a just a biscuits but its healthy and Nutrients biscuits and use as snacks.I have the same love for this biscuits and the flavor and taste of Britannia biscuit.", "Mayur2425": " Hey Guys,This Is Mayur Wable. Britannia 50-50 Biscuits.! A Sweet And Salty Biscuits, It Gives a Very best Crunch.For It's An Very Special Buscuits. As I am 90's Kid I have Very Special Connection With it. My Whole family used to eat it till date.It's Give Very nice flavour Of Sugar at same time It's Salty as well. and That make it Awosame product. it's an Dialy Dose For me as well.Talking About Quality Of This Product, Its Comes with Nice rapping and Best design logo itself.Well, I just say I like This Very much.!Thank you.", "rajashree_thakur": " I don't like to have biscuits but Britannia 50-50 is the best biscuits.I like the taste of biscuit , it is sweet and saltyAnd I just love the combination : )Sometimes I use to eat this biscuit whole day and skip my lunch/dinner : PTry this !You will love the tasteIt is different from all other biscuit as because the main flavour both are hereThe sweet and salty.And you will never get this taste in other biscuits.Product quality is good , after all it is Britannia product so obviously .", "sanGram950": " Hello friends, Britannia 50-50 Biscuits have dual flavors which combines sweet and salty.This dual flavored appeal soon made it a household name.I am enjoying the Britannia 50-50 biscuits ever since I was growing up. It is sweet, salty and crunchy. They can be enjoyed in the evening time with tea or coffee.The product quality is very good. the biscuits are very light and good for health . Its very good for children also.The product packing is also simple . The biscuits are wrapped in a plastic wrapper . easy to carry anywhere.Overall, the biscuit is very tasty, healthy with great flavor or sweet and salt.", "Rahul28sing": " Hi Guys,Britannia 50-50 Biscuits is one of the excellent product which is manufactured by Britannia Company. These biscuits are most loved among all the products manufactured by Britannia. I have never figured any health related issues related with the consumption of this product.These biscuits contains balanced amount of sugar, flour, baking oil, and other required ingredients. So, I think that any person can enjoy the taste of these biscuits. I loved this product in childhood and always used to have these biscuits with milk in my childhood.Senior citizens can also intake these biscuits as I think that these biscuits are not going to give them any health issues.So, buy and enjoy the taste of Britannia 50-50 Biscuits.Thank you", "as724574": " Britannia 50 - 50 biscuit are one of the best and very good biscuit .I have been eating this biscuit since my childhood .They r very tasty biscuit with very crunch one with sweet and salty taste .There are one of the most of famous and we can get it easy, my whole family likes it, And as it is from britannia 50 - 50 biscuit.Britannia 50 - 50 Biscuits is good quality and very low price avilaible in market .product packaging is very best .", "spicyruby99": " Britannia 50 - 50 biscuit very nice in tasty biscuit.if you eat 1 you feel like eating more and more.Its sweet and salty, it was launched  in 1993.In this maska chaska comes its also veru nice.when we were small we use to empty packets of 50-50, when we see films at home we use to enjoy this biscuits. My family likes this biscuits alot.you can make toppings on top of the biscuits and eat .you can grade cheese tomato slice onion chaat salt chilly pd .first take biscuit on top of biscuit add tamoto slice then onion slice, cucumber  slice , chaat , chilly pd , salt and eat if you want squeeze lemon on it and Enjot it.THANKS FOR READING MY REVIEW", "vikashrnjn290": " I purchased this biscuit for my flavor satisfaction and I felt happy to eat it. It is a nice biscuit and if eaten with a cup of tea then it is very good to taste. I always use this biscuit in snacks and I also let my friends eat this biscuit.It can be purchased from different shops and also tea stalls. I preferred to take this biscuit at my snacks and tea time. It is also available at different rates that is it is easily available at Rs.5/-, Rs.10/- and many higher rates also.I also suggest people to taste this biscuit if not tasted yet.In my opinion this is suitable to every age group people.I loved it's quality as it is made nicely with holes all around and also it's packaging is nicely done as the plastics used in the packaging is nice and I use it twice or thrice a day.", "AKHIL1994": " Well I am a 1994 boy, I was eating Britannia 50-50 from my childhood its self . what I have to say it is one of the nice biscuit available in Indian market . The feature that makes it best in market is nothing but its taste, it have a sweet and salt taste with some kind of special taste   with it . one thing I can add from my experience is that these biscuits are so addictive, once I just open  the cover and tasted one biscuit I will re take the biscuits until the cover becomes empty.it have a very nice taste, when ever I see the packet of this biscuit in any shop mostly the taste of this biscuit will came to my mind and I will buy this biscuit if I am  some kind of free.The biscuit is very soft and little bit polished and it will give a good look too.I like this biscuit", "gusmirafi": " Britannia 50-50 biscuit  is very awesome and tasty biscuit  it was made  in 1993 company brand is very good it is salty and sweet I love to eat 50-50 biscuit we can see film in tv and theater and eat the biscuits we can apply jam on biscuits and crushed the put in cake it will very tasty and yummy  we can dip in tea and milk and eat it is very  tasty and yummy when I get up early can eat milk biscuit then make chat first put biscuits cheese tomato cucumber blackpepper pd put biscuit nd we can eat with sauce we apply on it jam and eat it taste yummy delicious we can put jam on it it is become very delicious  and tasty I brought  many biscuit from supermarket  it brand company biscuit company  is very and awesome we can keep birthday party biscuit people will eat.", "krrish4444": " Britannia 50-50 Biscuit is a One of My favorite companyIn my School everyday I bought this biscuits for snacks periodAnd my Friends always ask me this Biscuit and share it with them.The Flavor of This Biscuit is unbelievable once you eat this you will get addict.The Product Quality is Satisfied  and Packaging Also Very nice.Iam always huge fan of this Britannia 50-50 Biscuit.!And This Biscuit  only 100% Tasty and Crunchy.!", "rht1456": " These biscuits are very tasty to eat offering in two different flavours, sweet and salty. They are ideal for snacks during breakfast.the quality is great and excellent.The company is well known for their biscuits and serving the people since many years and faced no remark in the customer satisfaction.The packing of the product is clean and neat without any damage  .the sweet and salt flavour is a treat to eat for snacks lovers."}], {"kumarimadhu542": " Britannia 50 -50 experience in every bite of these light and crisp bite which are baked to perfection and each snackuit is seasoned with fresh organo, onions and garlics which is ideal for hot gossips during kitty parties.A fusion perfected over years of chinese culinary tradition.Thease are melt in mouth, thin and crisp delight with the hint of chili .Britania is a branded company and I eat their product since my childhood.They are the most sold brand in India .All the children love the taste and, especially, britannia 50-50 biscuit", "Nelson14": " 50-50 is my favorite snack in the evening with tea or just the biscuits are just tastes like gooood. I like this product because it is also cheaper but also of its taste too like 50% salty and 50% sweet as the name of the biscuits suggests. The other brand that is consider as an alternate for 50-50 is nothing, but I can say that Osmania biscuits are just awesome too. I guess everyone can have it from kids to senior citizens.", "arora26": " Hi, I am gonna give my review on this biscuit. I have been eating this 50-50 biscuit from my childhood. daily in morning I used to eat this biscuit with milk and I am loving it. But it changes now a lot. its taste changes as compare to previous years. we can say it quality. I know the reason is cost. it is a cheap biscuit, put some less biscuit in packet but make sure the quality of biscuit is best.  this 50-50 biscuit is so good for eat. well first of all I will talk about taste of this biscuit, this biscuit is now not so crispy like 2-3 years ago. And now a days this biscuit contain so salt and less sweet, but a years ago both salt and sweetness is so good. I want to say that put salt solution or ingredient is less then it will much better. and more about taste, some ingredient is missing now a days. I dont know what is missing but something is missing as years before.now a days I mostly used to eat butter bite because it is same as before but 50-50 is not same like it was years ago.so fix this problem. I mean make it same as years ago.Now let me talk about packaging, put plastic tray or something inside the packet because most of the times when I open the packet the biscuit is into pieces which I dont like. I love to dip this biscuit in my milk of glass. so put plastic tray in packet. mostly times shopkeeper threw the packet of biscuit from one place to other place, it is the reason for break this biscuit into pieces. when having tray inside packet them it wouldn't be broken into pieces.this is all I can say.thanks", "vedbageshwar": " My favorite bscucts is the Britannia 50 – 50.Britannia 50 - 50 Biscuits is considered as common mans biscuit. First of all Thanks for Britannia to make the Britannia 50 - 50 Biscuits. I have eaten almost all brands of biscuits. First of all this bisucts come in a very popular brand Britannia which itself very good brand. Britannia also has a lot of variety in sweet and namkeen biscuits.Now I will come to 50-50 which is most popular among many brands. Its taste sweet and namkeen both. You can take this as breakfast too. Whatever travel I keep 2-3 packets Britannia 50 - 50 Biscuits in my bag. Also we can eat in evening snacks.So I will recommend you to have this biscuit in your daily routine.", "cs0602": " Hello Friends,I am very fond of biscuits and I have eaten almost all brand of biscuits. First of all this bisucts come in a very popular brand Britannia which itself very good brand. Britannia also have a lot of variety in sweet and namkeen biscuits.Now I will come to 50-50 which is mots popular among many brands. It's taste sweet and namkeen both. You can take this as breakfast too. In morning time, in noon time and as a evening breakfast also.You can put these as good snacks in Party also. There is no brand except Britannia who give you such a good taste. Even in Parle you will not get that taste.So I will recommend you to have this biscuit in your daily routine.", "snegdha1": " This product is really very good because I ate many times. It is not only good in taste but also good for the guests in many occasions. Even, now also I took this product in morning as well as in evening time during tea time. It is a crunchy and tasty and all members of any age can eat this product. This is the product which is good for light food anywhere. Packaging of this product is also good for the protection and for preservation. This product is good to eat with the tea which is my opinion.", "arindamojha9": " Britannia 50-50 is a sweet and salty cookie.it is a delightful biscuit dipped in butter and peppered with the cheicest of herbs.I love eat this britannia 50-50 biscuits.At britannia, we belive that there is whacky side to everyone -sometimes hidden, at other times overt.with products  which can well be call differentiated, with the world of sweet biscuits.it tast amezing when you mix two completely opposite  flavors together.britannia 50-50 is a deliciously sweet and scrumptiously salty biscuits.120 gm paket of britannia Rs 25/-", "manu_joy": " Hi guys, here I am going to share my reviews about britannia 50-50 biscuts. I just wann tell you ppl one thing abt this biscuits is that since from myy childhood I been eating these biscuits but still I have the same love for this biscuits and the flavor and taste of britannia biscuit is still same as it was. so I just flat on these biscuits and quality of biscuits are simply superb. I hope this will help you . thank you guys", "bafnasiddharth": " We can see there are lot of options even in snacks, which you can munch on to satisfy that untime hunger rants without gaining that extra kilos.Britannia is not a just a biscuits but its healthy and Nutrients biscuits and use as snacks.These are melt in mouth, thin and crisp delights and increase the flavor when I eat with chesse Paste with origeno.So guess even in diet plan you can perfer to buy britannia 50-50 Biscits.Now Enjoy the crispy and delighted biscuits in your daily snacks times.", "kunal243001": " At Britannia, we believe that there is a whacky side to everyone - sometimes hidden, at other times overt. And this is what we celebrate with our brands 5050, Maska Chaska, Time Pass &amp; Top. With products which can well be called differentiated, in the world of sweet biscuits, these brands have carved out a special place in the minds of consumers across the country.Maska Chaska is a delightful biscuit dipped in butter and peppered with the choicest of herbs. Needless to say, this mouth-watering biscuit soon became an instant hit and a regular in most households.  very tast .", "mravijitda": " Britannia 50 - 50 Biscuits is considered as common mans biscuit.It comes from the most famous biscuit brand britannia which has got trust from millions of people. I am a regular customer of britannia.I am a biscuit lover. I always use parle g, parle mari light and many more with my tea or coffee. Britannia 50-50 is also one of my favourite brands.I love salted biscuits instead to sweet cookies. So I generally brought 50-50.", "jeetuchauhan9990": " Britannia 50 - 50 Biscuits are very testy Biscuits.This product of Britannia is used by every aged people in india. This Biscuits are used in breakfast in india.This is sweet and silky cookies.Maska chaska is mouth watering delightful Biscuits product of Britannia 50 - 50.Packs of Britannia 50 - 50 Biscuits are available in 50 g.120g.This product is famous in children than other product.One main good think is chance of teeth problem because of Biscuits are less than other product", "wadhetushar": " Britannia 50 - 50 Biscuits are very testy  Biscuits.This product of  Britannia is used by every aged people in india. This Biscuits are used in breakfast in india.This is sweet and silky cookies.Maska chaska is mouth watering delightful Biscuits product of  Britannia 50 - 50.Packs of Britannia 50 - 50 Biscuits are available in 50 g.120g.This product is famous in children than other product.One main good think is chance of teeth problem because of Biscuits are less than other product", "srinu720": " Britannia is a branded company and I eat their products since my childhood.they are the most sold brands in india.all the children love the taste and especially, britannia 50-50- biscuits are very tasty, they come in a neat packing, squared in shape, the flavour is salt and sweet.they can be enjoyed in the evening time with tea or coffee.it is apt for trips, picnics, long drives etc., it is very crunchy and yummy.the biscuits are very light and good for digestive system.overall, i loved these biscuits and recommend it.", "geenasuclavas": " Many people from late 1990's  have been indulging in these whacky 50-50 biscuits. Until then biscuits implies sweet tasting cookies. But 50-50 have completely changed the view of people on biscuits adding a new salty taste and yet that tastes delicious. These days 50-50 has some herbal leaves added for flavor which in turn doesn't effect health badly, instead good for tongue and stomach. We wish to see more healthy and new flavors in 5050 in the coming days.", "shuba506": " Hi freinds, as we know that britania 50 50 is delecious biscits, if we see the ingreadians of it then we come to know that 12.68 gram.4 calories per gram then 12 gram fat=12into4 is equal to48 calories.whole packet include 310 calorie is equal to one meal.if u want to take in college hour then its good but u will take with ur meal then ur calory intake increase, there is no sodium and cholestrol so its good for ur heart another thing I it having protien 14 gram so it is advisable to take after your workout .and it is good for children because it having calcium and iron.", "fateh143": " Britannia is a branded company and I eat their products since my childhood.they are the most sold brands in india.all the children love the taste and especially, britannia 50-50- biscuits are very tasty, they come in a neat packing, squared in shape, the flavour is salt and sweet.they can be enjoyed in the evening time with tea or coffee.it is apt for trips, picnics, long drives etc., it is very crunchy and yummy.the biscuits are very light and good for digestive system.overall, i loved these biscuits and recommend it. The product is a sugary starchy product with no macro nutrient balance or natural micronutrient diversity. This is not a wholesome product unless it is consumed in small quantities as a small part of an otherwise diverse and wholesome diet.", "mohit7777": " Britannia 50 - 50 Biscuits is considered as common mans biscuit.It comes from the most famous biscuit brand britannia which has got trust from millions of people. I am a regular customer of britannia.I am a biscuit lover. I always use parle g, parle mari light and many more with my tea or coffee. Britannia 50-50 is also one of my favourite brands.I love salted biscuits instead to sweet cookies. So I generally brought 50-50.", "mobilecafeararia": " The company was established in 1892, with an investment of ?265.[4] Initially, biscuits were manufactured in a small house in central Kolkata. Later, the enterprise was acquired by the Chugh brothers mainly Bhavya chugh, a renowned attorney, and operated under V.K Brothers.\" In 1918, C.H. Holmes, an English businessman in Kolkata, was taken on as a partner and The Britannia Biscuit Company Limited(BBCo) was launched. The Mumbai factory was set up in 1924 and Peek Freans UK, acquired a controlling interest in BBCo. Biscuits were in high demand during World War II, which gave a boost to the company’s sales. The company name finally was changed to the current \"Britannia Industries Limited\" in 1979. In 1982 the American company Nabisco Brands, Inc. acquired the parent of Peek Freans and became a major foreign shareholder. The contribution of this position was of Bhavya Chugh and his family.", "bpsharmabsf": " Hello guys as we all knows that the 50 50 biscuit is really very tasty and everyone liken this this is really so tasty while eating with tea with dip in it . even the biscuit is namkeen in taste and this is not the latest biscuit it is come from many years .i think this is the only biscuit which is tasted by everyone . this biscuit is really so yummy as you all know that this biscuit is come from many types but from my heart and the fact this is flavour is so tasty and this is the time to talk about the brand that is britannia I think the first thing that come in your mind is that this is so famous and the trust full brand yes this is absolutely correct amd britaia is very good brand even it has so many product may people belive n that brand . thats all I want to say or suggest to you ."}], {"ak281994": " THE tea time biscuit by britannia has a good fan base for its quality and taste that it provides.I particularly like the design the biscuit is provided with a square base with a lot of holes, looks different .The packaging is also quite pleasing.The britannia 50-50 has a not so sweet or too plain taste, it's delicately balanced for the consumer.50-50 comes with 2 flavours:Normal 50-50Maska chaskaboth are good and unique in their flavour.The closest competitor to 50-50 is Parle's krackjack.This is suggested to those consumers whose are not interested in a creamy or sweet biscuit available in the market, they can try 50-50 and enjoy it.", "avinashdhuria6": " Britainia is a famous biscuit made company .the company  made many types of flaverBritannia 50 - 50 BiscuitsAt Britannia, we believe that there is a whacky side to everyone - sometimes hidden, at other times overt. And this is what we celebrate with our brands 5050, Maska Chaska, Time Pass &amp; Top. With products which can well be called differentiated, in the world of sweet biscuits, these brands have carved out a special place in the minds of consumers across the countryCalories in a food come from carbohydrates, protein and fat. The above product however has more calories from fat, which is not desirable and thus is considered “high in fat”.So think again before you go binging on it, as every gram of fat matters!", "rohitraaz02": " Hi friends,I am amit and I wanna to tell about the features of this biscuit, the brittannia is so sweet and so tasty biscuit, Only this is the biscuit is I prefered to eat it, . The brittannia is the so sweet and so salty biscuit, I am eating or usning it since when I was 12years of old.And this is whats we celebrate with our brand 50 - 50, Maska, Chaska and Time pass biscuit. so thansk to all of you thats you read this biscuit AND read the biscuits review all one give a posiyive reviews.", "ANuJ007": " This Biscuits Are Very Sweet AnD Salty Too. I Used To eat These At evening With Tea &amp; I Really Enjoyed It, BecAuse Of It's Salty Taste I can eat more and more 50% 50 Biscuits . quality is Tremendous, Krack Jack Biscuits are also little bit Same As 50% 50 But Taste Of 50 % 50 Is Much Good . I like it most, Price is so less, Now we can buy it for Rs 5 .I like These Very Much Namkeen biscuits Having the taste of both Sweet And Salty . These Biscuits Are In The Market Since Long And Has Captured Market Very well, Britannia Has launched this biscuit in competition With Krack Jack, It Wins 50%50 Done Really Well. They Capture Market Very Fast. The Biscuit is Squared in shape And it is very very crunchy, A PerFect Snack For TeaTime The only problem in this biscuit is When Dipped in Tea, Its Get Swallon &amp; Dropped very Fast, A Part From It, I Love It's CruNchy&amp; ButtEry TasTe &amp; I EnJoyed It A LoT With My Tea .", "digitalmanu9": " Bitannai 50-50, believe that there is a whacky side to everyone - sometimes hidden, at other times overt. And this is what we celebrate with our brands 5050, Maska Chaska, Time Pass &amp; Top. With products which can well be called differentiated, in the world of sweet biscuits, these brands have carved out a special place in the minds of consumers across the country.What happens when you mix two completely opposite flavors together? You get the lip-smacking and iconic Britannia 5050 Sweet &amp; Salty biscuit – a biscuit that is deliciously sweet and scrumptiously salty. Launched in 1993, 5050's dual flavored appeal soon made it a household name, while its whacky and unforgettable ads, including the iconic and much loved \"Na re nana 5050\" ad campaign only added to its growing popularity amongst the youth.", "kishoresai381": " Britannia is a wellknow company.the product of this company so good and tasty.this 5 5 biscuits gives a very good taste to mouth.they r so  smooth.if we keep these biscuits in mouth they r so wonderfulin taste.the biscuits quality is also so well prepared.its a good snack in the evening time with chaii.these biscuits are so timepass and top.this brand has a special place in the mind for consumers across the country.these r so delicious its so whacky and unforgettable", "rannur1992": " Its a friend of my hungry stomach when I don t have anything to eat with me,since 6 years I am having 50-50 which is available in different flavours in the market but my favourite is the normal sweet and salty 50-50 as it gets dipped in tea #OH MY ITS TASTES REALLY AWE SUM#its cheap, affordable and pocket friendly snack, as because biscuits plays a very important role in many life a rich and a poor both can buyI recommend you can try the 50-50 MASKA CHASKA  as it contains a buttery flavour with some spices. best biscuit", "kmandal341": " Sweet and salted Britannia 50 50 biscuits have ruled Indian tea-time snacks for a long time. However these biscuits cannot be a meal replacement as they are very rich in simple carbohydrates and sugars. There is 44.53 gm of carbohydrates in just 65 gm serving of the biscuit of which 13 gm is sugar. For this reason, we do not consider this product to be a safe snack for people who suffer from lifestyle diseases like obesity, hypertension, diabetes, cholesterol imbalances and non-alcoholic fatty liver disease.The foodnetindia rating for this product:-foodnetindia safety rating: 4 -(On a scale of 1 to 10 from very unsafe to very safe)This product is eaten in large quantities and regularly as a snack by adults and children alike. Very often, it is eaten as a meal replacement by people on the move. A high simple carb, and high sugar, high salt product like this is not safe when consumed in this fashion and may cause lifestyle diseases in adults. Even children must sparingly eat such starchy and sugary products.The amount of salt in this product is high at 195 mg in 36 gm of the product. Also one of the product ingredients is edible vegetable oil, and it is not specified by the manufacturer which oil is used.foodnetindia wholesomeness rating: 3 -(On a scale of 1 to 10 from very unbalanced nutrition profile to excellent nutrition profile)The product is a sugary starchy product with no macro nutrient balance or natural micronutrient diversity. This is not a wholesome product unless it is consumed in small quantities as a small part of an otherwise diverse and wholesome diet.Ingredients in Britannia 50 50 biscuits which are a concern:Edible vegetable oilInvert SyrupEdible Common saltSugarRaising agent IN 503(ii)(ammonium bicarbonate)Added Flavours(Artificial flavouring substances Butter, Vanilla, Milk)Edible Vegetable OilThis food product does not specify which edible vegetable oil has been used. We believe that it is not responsible behaviour for a brand to avoid clearly stating what ingredients have been used.Certain vegetable oils contain very large amounts of biologically active fats called Omega-6 polyunsaturated fatty acids, which could be harmful in excess. Excess polyunsaturated fats may react with oxygen and oxidised Omega-6 fats can damage body functions and perhaps even vital structures like DNA. In addition, consumers need clear information about the type of vegetable oil used, so that they can take action to maintain a healthy balance between Omega-3 and Omega-6 fatty acid consumption.In addition, some people may be allergic to specific oils. Food allergies can sometimes be life threatening.Invert SyrupInverted or invert sugar syrup is a mixture of glucose and fructose. It is used in several products such as honey, jam, golden syrup, etc. It is similar to high fructose corn syrup.High Fructose Corn Syrup is increasingly being seen as a reason for the high incidence of metabolic diseases. It has negative metabolic effects at much smaller doses than sucrose.Edible Common SaltIn 36 gm of Britannia 50 50 biscuits there is 195 mg of Salt which is very high. High sodium diets have been known to be the cause of high blood pressure, heart disease, etc. The recommended daily intake of salt is between 1-3 grams.SugarBritannia 50 50 contains 13 gm sugar per 65 gm of the product. This food product does not specify which sugar has been used. This is important because different sugars have different metabolic effects. For example, Sucrose(Cane Sugar) is very different from Fructose(Fruit Sugar). Some foods use high fructose corn syrup which may be harmful in much lower quantities than sucrose.  We believe that it is not responsible behaviour for a brand to not clearly state what ingredients have been used.Raising agentIN 503(ii)(ammonium bicarbonate)It is produced from ammonium sulphate and calcium carbonate, natural minerals. It is used as a acidity regulator, alkali, and rising agent. Side effects may be gas formation in the stomach after ingestion.Added Flavours(Artificial flavouring substances Butter, Vanilla, Milk)This food product does not specify which flavours or flavouring substances have been used. The flavours should be specified as some of them have serious side effects and may not be suitable for infants, pregnant women or people who are allergic. We believe that it is not responsible behaviour for a brand to avoid clearly stating what ingredients have been used.Ingredients present in Britannia 50 50 biscuits which are not a concern", "Raymond755": " Britannia is a good quality biscuits at affordable price. It is very light and crispy.I love the taste of the butter. We can enjoy it anytime. It can be a great snack in the picnic and children also love it. It has been my long time favorite. I often eat this biscuits with tea Delicious. I wouldn't be bored eating this biscuit everyday. We can have a wonderful time munching this biscuit with our guests and be involved in lovely conversation.", "singhmukul33": " I like this biscuit pretty much because it gives me a good taste of sweet and salty. the combination of the flavour sweet and salty is good one because we can take this biscuit with tea because it has the taste of salt so we can enjoy the taste of tea. I brought this product because it taste good when I take it with the a cup of tea and it taste me good. I actually compare this brand with the monnaco and with some other salty biscuits and I found it much more better then these biscuit. the people who like both sweet and salty taste should buy this product.", "sandeepdwivedi62": " Britania has done a good work in this field .britania 50 50 is worth of money.its spicy , salty , and crunchy.and tasty.or u can say much more in just 5 or 10 RS.I USED TO BUY THIS  whenever I like to eat some salty and cruchy biscuit .The build qualty of buscuit is good. So I think who like to try some salty biscuit then I think u must have to give a try to britania 50 50 .its a great choice to early morning.", "Gmuthukarthik": " Britannia 50_50 biscuits is good quality biscuits, britannia is most famous biscuits in the world, personally I like this biscuit very much because of the reason this kind of biscuits is so crisby and cranchy and also taste is very awasome, all kind age group peoples are like this biscuit, in this biscuit best to tea time like morning or evening, britannia 50_50 biscuit have so many varieties, it also healthy biscuit in the world, this kind biscuits are not too much expensive to compare other biscuit companies but this taste are too good, and you can see the price, nutrition, sugar level in biscuit cover, baking also very good", "yogesh668": " Hello friends -Britannia 50-50 is a type of crakers from one of the famous  brand of food &amp; biscuits products, Britannia.It has salty &amp; sweet taste . 70 sweet+ 30% salty.This biscuits are very light esdily we can break it. And also sometimes we will get offer of 20% extra by that we will have more advantage. There marketing is trustable and packaging which they make is very good, which is in orange and light yellow color.Ideal snack with tea.Liked by people of all age group.Product quality is very good, much better than biscuits from local brand .Product packaging is also good.Hygienically packed.Price  Rs 10 for 80 gms pouch, so very cheap and easily affordable.It is crispy and delicious and contains glucose, so  a good source of energy.The maska Chaka of Britannia is an excellent product which tastes likes a baked biscuit and has minty flavourMany children like ideal snack with milk-love you Britannia", "postbox29993": " Very good, lightly flavoured biscuit and most suitable for any time eat, and it is best to eat with tea  .  it is very light biscuit does not add too much calories . the biscuit is not too fatty, so it could be enjoyed any time . the packing of the biscuit packet is good but it could also be enhance. the biscuit is good and the shape of the biscuit is also good but I didnt' know the importance of the holes on the biscuit and like the biscuit very much.", "rhia1march": " Hello. Friends. Here today I am going to tell you something about the Britannia 50 - 50 Biscuits. As all we know that this brand is very old brand and ya I will also share with you that from my childhood I am eating  Britannia 50 - 50 Biscuits. In every mood I just like to eat it. How much of hungry I am I get satisfaction after eating this biscuits they are very nice and good in taste too. Its quality is also nice it is 100% pure  you can trust this brand by keeping your eye's close as it is very good. Its packaging is also done nicely so the customer could take it without any problem and t also attracts the customer to take the biscuits.", "mahajan006": " I regularly purchase this biscuit only because of my taste for it .since last many of months I am using it everyday and always feel hunger for it .i also use parle but not find suitable for eat every time  as it is only sweet in taste .Britannia 50 50 is good combination of sweet and salty taste so it gives best feeling in mouth. I always carry it while traveling it avoid boring of bus and other travels.everybody and of any age can use this biscuit regularly especially  morning of mid time snack", "FaizNM": " Britannia 50-50 Biscuits are very good in taste.Only complaint is that its size is like wafer. Should increase its size as its competitor Parle has good taste and size much big that  50-50.The reason to buy this product is obviously its brand name. Because people looks for brand name first before buying anything.Alternate brand to this is no doubt Parle because it is an Older company and better in taste.This brand is suitable for everyone from Children to Old ones.I think everybody should use and try this brand it offers good quality though.Available in other flavours as well like Maska Chaska which tastes even better.", "piyushgupta112218": " I regularly purchase this biscuit only because of my taste for it .since last many of months I am using it everyday and always feel hunger for it .i also use parle but not find suitable for eat every time as it is only sweet in taste .Britannia 50 50 is good combination of sweet and salty taste .this is so yummy and my favorite buiscuit.It’s like world flavours sealed in a packet waiting for you to gratify….how good is that? Britannia has not only revolutionised the snack world but also kept in mind the changing trends of snacking habits along with flavours which are common all around the globe. An ideal snack for tea time gossip among teenagers who are wait watchers too….and the brand also concentrates on housewives, where this snack can be served at there kitty parties or at housewives adda….just to make the conversation more flavoursome….", "bhishamkumarbk786": " Britannia 50-50  is good brand it is very taste I have buy every month number packs and eating  with  big smile. Britrannia  have real taste with engry I choose Maska Chaska, 120g Pack this product  is  zero transfat and taste of biscuits is very best. Britannia 50-50 is good combination of sweet and salty taste so it gives best feeling in mouth. it is time pass the packing of biscuit is good but not understand holes purpose in biscuits.", "arpanhandique29": " Biscuits play a very important role in any one's day to day food habit. They are most preferred at mornings and evenings with a cup of tea, coffee or milk. Britannia 50-50 Biscuits are indeed mouthwatering with their unique Sweet and Salty flavours. 50-50 is available in normal Sweet and salty as well as with a little more twist such as the Maska Chaska.We will find many other lovely biscuits such as the Britannia Good Day, Little hearts, Monaco but this is my favourite.And also yes Britannia is one of the oldest Brand available that still maintains its quality for the customers."}], {"yadav3494": " I like to eat of biscuits like Britania 50-50. This biscuit has butter and littele bit sated kind of taste. I think this  is a amaging kind of the biscuits. This is a kind of biscuits which is available in various range like 5rs, 10rs and up to 40rs. I like to eat this biscuit with the tea.This is a kind of biscuit that all kinds of people like to eat. Britania is a company who always maintain their quality of the products.", "saianil034": " Britannia is the Brand which is found in every Indian house.we are Eating Britannia's Biscuits from our Childhood.Britannia's biscuits are the most Selling biscuits in India.I like the biscuits of britannia like Marie Gold, Good Day, Jim Jam.Treat, 50-50 and the Most Favourite Bourbon Biscuits are all the which love to eat.Britannia's 50-50 Biscuit Sweet N Salty taste is very Unique and that's why it is very famous and I love it.It is Best to eat 50-50 Biscuits with Tea and don't replace your meal with this Biscuit just eat it for a Taste not to fill your tummy.The Biscuits are very lite and good for digestive system.50-50 is favourite among all the classes of people no matter you are child or adult.There is Some Advice for you guyss about 50-50 Ingredients and Nutrients as all we know that over eating of any food is hazardous to health so Eat this biscuit just for a taste don't over eat Because Britannia 50-50 has High Salt and High Sugar.", "neeravsharma0510": " Very very tasty tasty 50-50 one of the most and the best biscuit of every once childhood and till today it maintains its taste and the quality too.better the taste better the delightful taste.britania makes the best advertisement for these product which is famous from long lasting days and it will be forever the sweet and salty both togrther makes the taste more delightful and delicious.we can keep it for every moment and enjoy the taste of it", "anushka9689": " Most trusted, valuable and popular brand.Britannia 50-50 is healthier and tastier. Biscuit is Squared shape and mixture of sweet and salty its very very crunchy. perfect tasted with tea anytime, anywhere.The rate is very minimum at any local grocery store.Long term use of diets high in sugar are linked to increased risk for diabetes, obesity and contributes to cravings.I just love this. People must try this.", "kartikv31": " Britannian is one of the most trusted brand , when we talk about biscuits. Britannia 50- 50 biscuit is thoda salty thoda sweet , crispy biscuit. Anytime if you take it with tea, you get superb taste. It makes tea complete. It comes in rectangular shape, with some small small holes . my whole family loves it, even my grandparents, just because it is not too sweet, neither so salty, so it is also good on health. Its packeging is yellowish. Now they have reduced the number of biscuits, but the price is still the same. Five rupees, for small packet.", "mandal740": " Sweet and salt Britannia 50- 50 have been most favorite snack for a long time. Though they are not replacement of lunch and dinner. They have rich content of butter, sugar along with vegetable oil and salt. Not only children but also elders like to eat this tasty biscuits in lots of amounts at tea time. So I Feel It as best Tea snack or snack that can be used at any time. Diabetics, hyper tension should not take in the snacks.", "pra29": " I have been eating this biscuit since my childhood and back during 2000-2004 when there was not so many biscuits option available in the market at this price range this biscuit was good but time has change and known there are so many opponents like parl and sunfeast biscuit to it that this biscuit doesnot stand in the league of there biscuit . The company has only changed the cover of the the biscuit but the quality is still same old fashion with simple taste without any innovation .Britannia should learn from parle whose product marie changed according to time in past 20 years.this biscuit can only be use if you are extreamly hungry otherwise I would not suggest you to eat this biscuit because it has no flavour total waste of money .", "riteshnsg": " Britannia 50-50 was the one of its kind biscuit when it came to market, half sweet half salty.When I was in schooling I use to have a packet of this biscuits in my bag to have it in my interval hours, But now there are many other brands which manufactures biscuits like 5050 but old is gold;-) The taste of this biscuits is awesome even now when I get a chance to buy I will buy and eat all of these.If you want two different tastes in one thing, This is for you", "atul_jharia": " Britannia 50-50 is one of the best biscuits available in  Indian  market in quite low price and the taste is just wow the cracking is nice.Other brands are not providing daily consume biscuits I mean I can't eat a  biscuit daily which is made of so much of chocolate butter and so much of unnecessary things  which makes it much heavier and also makes the price range high.I love the biscuits like crack jack and 50-50Everyone can buy this product and consume in daily basis.", "srazvi16128": " Britannia50-50 Biscutes have really good taste sweet and salty with good quality Britannia maska chaska with salty taste launched in a year 1993 with a dual flavoured with a delicoues flavours with a afforable prices with a low calories the Britannia salty and sweety taste with tea creates a good amazing taste to take it at tea time and its contains nutrintions with good qualites it can be buyed from any shop in india", "udaybhowal": " This biscuit has been since I knew about food.The taste has evolved in last decade but has not only improved but they have become more nutritious.We love to nibble on the small rectangular pieces of snack which comes at a very affordable price.The various other variants like pudina, etc adds to the delicacy of the simple little snack.It is advised to be taken as a tea-time sides.People with diabetes can also have these snacks only after taking proper consideration of the sugar content which varies in different variants.Enjoy!", "kiani269": " Very very tasty tasty 50-50 one of the most and the best biscuit of every once childhood and till today it maintains its taste and the quality too.better the taste better the delightful taste.britania makes the best advertisement for these product which is famous from long lasting days and it will be forever the sweet and salty both togrther makes the taste more delightful and delicious.we can keep it for every moment and enjoy the taste of it", "harshzende": " Britania 50-50 awesome biscuits .eating it from my childhood days.best biscuits in d market .good taste .can eat anytime.uses to take dis biscuits during school picnic times .today also I purchased this biscuits its fun.britannia company is being in the market for so much years .i love britannia biscuits and all their other products they rare good too taste and make us happy everrytime we eat them.tanx biratannia", "RANJAS": " Every morning I start my day with Britannia 50 50 I have  been eating this branded biscuit from my childhood . tasty healthy comes in diffrent price options 5 rs 10 rs goes upto 40 rs . I will recommend this best biscuits to all age group of people. everyone must try atleast onces in life I bet no one will forget its taste and yummy ness . there is no comparable brand in food industry who can beat its freshness taste and crunchy ness", "pratip2016": " I like this biscuite so much and I eat it so. if I outing for some time I bue it.its package also so attrective.and its taste me like crazy. its salty and sweety flavoured I like so much. the same flavour different company biscuite in the market but taste like britania 50 50 none of them.i buy differente company 50 50 product but I challange the taste is not same.britania 50 50 if you eat one time than your dil mange more.", "santoshsandy172": " Britannia 50-50  biscuitsare tastier biscuits at less costI have chosen these brand from others because it salty biscuitevery one can buy this biscuit brand  because it is salty biscuitI have a good experience with itits flavor satisfaction is also goodand packing is easy to tearover all I like this biscuitbiscuits design is also good to seeit is my favorite brand from my childhood onwardsit is easily breakable also", "sanketkargutkar": " This biscuit haves an amazing chatpata flavour, its always crunchy, this biscuit still haves the same taste and quantity since my childhood, i realy likes the packing of this biscuit with a matte kind of wraper, I still loves the Britannia50-50 at my tea times, having these biscuits in booring times really turned those movement enjoying and refreshing . I always haves them while reading my booring lessons .", "gaurav123686": " Most trusted, valuable and popular brand.Britannia 50-50 is healthier and tastier. Biscuit is Squared shape and mixture of sweet and salty its very very crunchy. perfect tasted with tea anytime, anywhere.The rate is very minimum at any local grocery store.Long term use of diets high in sugar are linked to increased risk for diabetes, obesity and contributes to cravings.I just love this. People must try this.", "pravinkadam45pk": " Britannia 50-50 was the one of its kind biscuit when it came to market, half sweet half salty.When I was in schooling I use to have a packet of this biscuits in my bag to have it in my interval hours, But now there are many other brands which manufactures biscuits like 5050 but old is gold;-) The taste of this biscuits is awesome even now when I get a chance to buy I will buy and eat all of these.If you want two different tastes in one thing, This is for you", "riyazagra": " Britannia 50-50 was the one of its kind biscuit when it came to market, half sweet half salty.When I was in schooling I use to have a packet of this biscuits in my bag to have it in my interval hours, But now there are many other brands which manufactures biscuits like 5050 but old is gold;-) The taste of this biscuits is awesome even now when I get a chance to buy I will buy and eat all of these.If you want two different tastes in one thing, This is for you"}], {"vamsisky4": " I love this product so much in my childhood and still now britannia 50 50 I like the taste of this biscuits the flavour was awesome and the packing also good the cost of this britannia 50 50 biscuits also reasonable for the peoples I think every one love this product from children to old age guys every one love to eat this britannia 50 50 biscuits no one beat this product until now it is the brand mark of 50 50 biscuits I like this one very much", "GeekyRicky": " Britannia is the Brand which is found in every Indian house.we are Eating Britannia's Biscuits from our Childhood.Britannia's biscuits are the most Selling biscuits in India.I like the biscuits of britannia like Marie Gold, Good Day, Jim Jam.Treat, 50-50 and the Most Favourite Bourbon Biscuits are all the which love to eat.Britannia's 50-50 Biscuit Sweet N Salty taste is very Unique and that's why it is very famous and I love it.It is Best to eat 50-50 Biscuits with Tea and don't replace your meal with this Biscuit just eat it for a Taste not to fill your tummy.The Biscuits are very lite and good for digestive system.50-50 is favourite among all the classes of people no matter you are child or adult.There is Some Advice for you guyss about 50-50 Ingredients and Nutrients as all we know that over eating of any food is hazardous to health so Eat this biscuit just for a taste don't over eat Because Britannia 50-50 has High Salt and High Sugar.The Salt quantity is high i.e. 195 mg in 36 gm and have 13 mg of Sugar available in 50-50 and also it has 44 gm of carbs inside it.Britannia 50-50 have some Edible oils which are not specified on the packet that what is the quantity of Edible oil is used in the Biscuit.Edible vegetable oil has omega 6 fatty acids which is harmful for body functions.Salt and Sugar quantity is also very high because high salt diet can cause of high blood pressure and various heart disease so beware before over eating.on the packet there is also not stated that what kind of Artificial flavor and how much quantity is used in the Biscuits.Artificial flavor have some serious side effects and not suitable to Pregnant women or allergic people.This type of Irresponsible behaviour is not expected from Branded Company I hope company will Understand and change.But I am not afraid of 50-50 Britannia biscuit because I never over eat this biscuit because I am not in hurry to go heaven.Here look some Facts about it if you over eat~&gt;Calories per Serving: 114~&gt;To loose these calories you need to walk: 2.2 kmso guys eat it just for the fun and taste it is not the whole meal so don't replace your mealIt is good in taste and you can enjoy Britannia 50-50 with tea.i hope my review will help you to understand the fact and you will change your mind towards your health.thank you", "sunildhanker8": " No doubt that the 50-50 is one of the tastyful biscuits .i realy like this so much not only now but its my favourate when I am a small kid .when I chew this  it was realy a yummy in my mouth.which is realy a nice and specialty of this britannia 50-50 biscuits.this tast is really awsome .this is not so much costly is well.which means anybody can buy and eat this.In my family all loves to eat this .if you want to eat tastful biscuits this is for you . I buy this particular brand biscuit beacause I realy like the taste of it. parle -g also good biscuits but I choose britannia  50-50 biscuits because its taste much more tasteful then other .those who never eat this britannia 50 - 50 biscuits thay should eat this and those who not want to eat a tasteful biscuits they away from it .", "aryanpurushottam": " Britannia is a decent brand in business sector from quite a while and their items are great and healthy.Britannia 50-50 is a suared in molded and salty bread rolls. They are not salty that much and not sweet likewise . To contend with Parle's Krack Jack, here comes britannia 50-50.Its taste is similat to monaco in taste and Krack Jack fit as a fiddle. It is blend of sweet and salty. It is light and we can eat it at whatever time. This combo makes bread unique.This is great with tea and it is effectively liquefy in tea and water also.The cost is reasonable to everybody and You can take it from any neighborhood store close by you.Overall it is great and healty for all age bunch individuals.", "jitendrakumawat40": " Britannia 50 - 50 Biscuits are one of my most loved biscuit. the  biscuit is Squared shape and blend of sweet and salty its exceptionally crunchy. flawless tasted with tea.This combo taste makes this bread unique.Its 60% sweet and 40% salty.Britannia 50-50 is a suared in molded and salty biscuit.and this brand has earned its name because of its high generation standard and divine sustenance things.And I say also this brand is better of other brand in namkeen biscuit's.", "Duster": " I have noticed that I always find 30-40% of the biscuits are broken when I open the biscuit packet. I think company should work on packaging of the biscuit.Moreover the there is no change in looks or flavor of the biscuit since many years. It should also be improved.Secondly they should improve on the taste as it is slightly sweetIf you try Monaco it is much better taste than 50-50. the taste is salty which is very good to have it with tea.", "sandeep0021": " Yeah I m really satisfied with this it's flavour is yummy, product quality is another grateful part of it, it's packaging is alsobgrat it's cheaper and nice.Hello friends today I would like to tell you about my experience regarding this biscuit, it is amazing to eat this biscuit, I am used to eat this one daily while I take my tea, I think everyone should try this biscuitI think we should try it continously so that you will know about how tasty thing it isit is healthy and yummy my friends and me always eat it while having partyI suggest you all u should try it and live like a human beings.", "ashwinktaware": " I like this biscuits very much as it was the best option for me other than the glucose biscuits and less oily than the other brand which was available in market. If you are planning to a tea time chats this is the best one. The rate is Rs.10 for 55 grams packet at any local grocery store.So instead of spending on those really expensive cookies get this product for friends and family talks at your home.", "vishraj13": " Hello guys,today I'll tell you my own experience with the britannia 50-50 biscuits.britannia 50-50 is completely tasteless and contain just kind of oil in it.Either you eat it with tea or coffee or directly simple, it doesn't taste good.I thought company should think about this product. and the packaging of the britannia 50-50 biscuits is up to the mark. but that's not enough for defending this product.The  size and quantity and quality of product is decreasing day by day.I thought they(company) should close this product or either need to make some changes on britannia 50-50 biscuits.thank you guys for reading it.", "akashadg97": " Britannia 50 50 is one of the oldest biscuits of the company britannia . but now also it is running very successfully just because of the handful efforts of the company and its amazing taste. 6This biscuit is very tasty and is liked by everyone, whether the person is old or he is a child bit it is liked by everyone . company britannia has a large variety  of biscuits including britannia 50 50 in it also.In my opinion this biscuit is very nice and we can say it as simple and sober but best biscuit to eat anytime . taste of this biscuit is also quite good which is admired  by all . moreover this biscuit britannia 50 50 is not so expensive also .", "imranshekh": " Hello my dear Frends, here I have some prsnk exprianceThis is very good and amazing product and I love it very much.When I used it first time I was Thinking for it. But after use it I can say that it is realy good product that you can use it. Personaly I love it. Some negative feedback I get from other but you can ignore it. Just you go for it. If you don't use it just you can try for it. After useing it you will be like this that is my thought. It is my personal exparienceon this product.Thnx guysAnd You Purchase dis product and Expriance", "samba773": " Hiii britannia 50 50 indias one of favourite best biscuits.its taste is salty and it is good.It available from lower to higher prices. It is manufactured by indias and worlds popular biscuit brand britannia.its is good for especially tea time.Its starts from ten rupees and more.its is old product and one of the favourite product till today due to its taste and availability and superior quality.good for time pass", "ravinderwadhwa": " BRITANIA 50-50 BISCUITSguyz an amazing pack of buiscuits by the very famous and healthy brand britanniathis buiscuits are really very good and crispy to have them with tea or coffee or just like a snack they are very light and also not very sweetthey have a correct balance of sweetness which when enter you mouth gives an amazing sensation of taste moreover they contain butter which even enhance their taste even morethey are very crunchy which provides them an amzing tasteI even like their structure square with small dots:pii highly recommend that you should try these buiscuits as they are very light and do not cause any harm to your body like other maida buiscuitsI hope the review was usefullthank you", "yathiraaja": " We like this branded biscuits because these are salty biscuits and lack of sugar content.No brand could not replace these biscuits place so we could not say alternative to this product.Even, if we eat one packet full we could not feel heavy in our stomach. Salt component in it may give extra delicious to it. These biscuits can be available at any super market or even in small department stores.When we feel hungry at bus stop and railway station, we would like to buy this brand of biscuits.", "VarshaS63": " Personally I like the this brand, because of that whenever there is a new product they launch I always tries it for fun.I like this brand because they make awesome biscuits which are very good in taste and they are cheap in rate also, so it is affordable to all.I saw the advertisement about this biscuit on tv and I bought is for try.I tried it and it was seriously very good.They are providing different flavors also which you can surely try.The most favorite flavor which I personally like is maska chaska.I have tried many other brands but I never saw any company to provide this variety of range in flavors in biscuit.Now day's there are many copies made by other companies but there are no any competitors which can make this type of biscuit.This is very cheap biscuit and very good in taste.Must try for everyone.Try this biscuit and then try other biscuit then you also can point out the difference between them.Strong recommendation for everyone.", "Shivam123181": " Good test yummyyy.its too good to health and good test nice packing good prize I really like this biscuit I love britannia 50-50 toooo much gud better I share this biscut with my frnd my family membars my friends and allGood test yummyyy.its too good to health and good test nice packing good prize I really like this biscuit I love britannia 50-50 toooo much gud better I share this biscut with my frnd my family membars my friends and all", "PradeepPuri": " A great product from britannia. Very crunchy and tasty, slim biscuits. Good to have like that only and can also have with tea/coffee.Cost is also reasonable. My family loves it, especially my son, if he starts having one, he finishes the complete packet himself. Nice to carry along, while travelling too.Only downside is, since they being crunchy and slim can break easily. But thats true with many other good biscuits also which are there in the market.", "jazzy0000": " Britannia is a well known  company and I eat their products since my childhood.they are the most sold brands in india. I  particularly bought this brand of product because its really light and there is no compromise in taste also. plus it can be consumed with tea or coffee, according to ones priority  and taste. they come in a neat packing, squared in shape, the flavour is salt and sweet. These one can be carry wherever you go like picnic, trips and long distance, etc.These are really crunchy ones, you can feel the crunch in each bite of it and its yummy too plus the biscuits are very light  which is really good for ones health.  I personally would reccomend this biscuit . Its real value for money .", "rahilali": " Britannia 50 - 50 Biscuits is the first biscuit which contain two taste sweet and salty and britannia is the best and decent company.I have try many brand of biscuits but I like this one only because this have a good taste and healthy biscuits so I want this brand only.Those who eating this biscuits they know why should we have to buy this brand only and those people who don't eat I will say them please try Britannia 50 - 50 Biscuits its very good for health.", "preetha8715": " I have had the pleasure of tasting some fantastic salted biscuits such as Monaco, Cheeselings and Sixers, courtesy of a well known brand called Parle.I was very eager to try out another type of salted biscuit called 50-50, courtesy of yet another well known brand called Britannia, which has created some yummy sweet biscuits over the years such as Jim Jam, Little Hearts, Milk Bikis and Bourbon(to name a few). I was so sure that this brand's salted biscuits would be as fresh and tasty, as the sweet biscuits.While sampling a specific brand of salted biscuits for the first time, I keep the following factors in mind: taste, freshness and method of preparation(whether baked or fried).For starters, I bought a 50 gram packet of 50-50. As a consumer, 50-50's taste as a biscuit was nothing to write home about(I could have sworn that this biscuit was both sweet and salty, to taste!), especially since I have been spoiled by Parle's excellent range of salted biscuits!Second, I really did not appreciate the fact that my fingers had been coated by an oily residue left by the biscuits, while handling them! Personally, I like my biscuits baked, not fried!Third, within 72 hours of emptying the biscuits into an air tight plastic container(I also made sure to close the lid tightly to prevent any air from getting into the container), the biscuits became stale! Mind you, this happened on two separate occasions! I have no idea how that was even possible as I have stored other brands of biscuits like Milk Bikis, Cheeselings, etc. in the same type of plastic containers and these biscuits(thankfully!) remained fresh, at least for a couple of weeks!I was happy that I had bought only a 50 gram packet of 50-50 biscuits, as this packet costed just Rs. 10 and did not burn much of a hole in my pocket!"}], {"delmatfel": " Britania fifty fifty is legendary tasty biscuit I am a fan from childhood.That perfect blend of sweet and salt wow this is a winner.Cheaper on the pocket and so useful in long journeys.I uses to eat this as lunch when I an on train.This is a must for me when watching cricket in tv.My girlfriend is also a big fan of this .So we enjoy eating together .", "Reviewer2016": " Crispy and very tasty biscuit. Have been using it with tea for many years. The taste is just amazing. the best is to have it with tea which make the biscuit sweeter when dipped in. A must have for every biscuit lovers. The crunchy feeling is also good. The flavor is also awesome. I keep buying it wherever I go. It is available at all retail stores.The packaging is also very good. Must buy for all.", "alphacontentwriti": " The thin, light and delicious Britannia 50-50 is a favorite biscuit for many because of its excellent taste. Appearing as thin and easy to have these biscuits are ideal for children, seniors, parents and friends.There is no specific time for having it and suit most perfect  for tea time, breakfast or afternoon snack is very good to have these delicious biscuits. Available in a very moderate price, buying Britannia 50-50 in bulk pack and keeping at home or office will help as a very nice snack that can be offered to guests or family members.", "imshahil": " It is very tasty biscuit of my childhood. This snack make my childhood awesome,this is only biscuit in my chilhood ate alots,I am very thankful to britannia to manufature a such a testy snack in my childhoodand now, I am appriceated to you guys a nice work.thank you!I hope you make such a nice snack every day in every year for those child who like it,I thik britannia is the number one biscuits manufature in the world,", "amangoenkag": " One of the oldest and best biscuits with chatpata flavor, A sweet and salty flavor biscuits that I am eating since childhood. I like its chatpata taste and a huge fan of its salty flavor.A britannia product which is itself a brand since a long and have come up with many other biscuits like brittani Little heart, Maska chaska, and apart from biscuits the company manufactures bread, rusk, cakes and other dairy products, but on top of all this seems the best in taste.", "baishakhi": " This thing is the made by the Britannia 50-50 bread moves in this way charming of the thing and best thing. Besides, thing is to be a sold in the India. Progressively the overall public like to be eat this sort of the scone in India .and the essential concern is that the a substantial segment of the adolescents and the more young people like to be this rolls. People cherishes this scone with the tea time.When I was little that time I like this association bread rolls and the such countless are to be available in the business area like the scones, spread, milk, accordingly an extensive number of other thing in the market.so all around is to be like bread thing. When I was to be go in the school that time in my tiffin I take for the lunch take a bread rolls. Truly it is the very crunch, so salty, so firm, so deplete and are to be incorporated an extensive variety of the ingredience so charming of this brilliant bread moves I treasure it.so at whatever point my father ask me which scone you won't that time I told please buy for me Britannia 50-50 bread rolls and that the same things are buy for me my father so faultless and one furthermore thing and when I was to be youthfulness that time such an extensive number of time I buy this scone and the I value it and I eat this bread rolls every day in tea timeSuch an assortment of good thing are joined into this bread rollsQuality. Right when any customer are to be a buy any thing that time buyer are to be see the principle quality and the best way of the Britannia thing.Taken a toll. Britannia 50-50 rolls are to a better than average and capable expense to all the bundle the bread rolls are having an other quality like a 5, 10, rupees of Indian cash.Diagram. Britannia thing having such an expansive number of style and it should be a blueprint Britannia 50-50 bread rolls are square and in that square are whole 9 opening on each.I venerated this scones and I will endorse to everyone as it is helpful for wellbeing in addition.", "rocknobesh": " Personally im a huge fan of 50-50 for not just one flavour but all of them.its mild sweetness combined with a little salty style makes it so yummy.although I like britannia 50-50 im not a huge fan of some other products like good day.Though 50-50 is super good but it is not advisable to some people like diabatic patients since it increases sugar levels but the same 50-50 is useful when their sugar level drops down lol.", "ravikanthh000000": " Britannia is a branded company and I ate their products since my childhood.They are the best selling brands in India.All kids love the taste and especially the 50-50- Britannia biscuits are very tasty,presented in a clean, square in shape, the taste is salt and sweet.they can be enjoyed in the evening time with tea or coffee.It is suitable for travel, picnics, long journeys, etc., is very crispy and yummy .The biscuits are very light and good for digestive system.overall,I loved these cookies very much.So I recommended this cookies for everybody.Thank you.", "csreevardhan3": " To have Britannia 50 - 50 is great generally with tea it feels awesome.One of the best biscuit to have your time pass while watching movies or cricket.Its feels just like a treat when you have britannia 50 - 50.i generally have at evening with my tea great biscuit with awesome taste.If you have not eaten britannia 50 - 50 then you have missed a great item to taste.Price is also less so every class of people can have it.", "mayur1234": " Nice Biscuits.I eat daily with tea.Not very salty than otherEvery person should try this product.When I was 10 year old, I east these biscuit first time.Before that I used to eat Parle-G.But there after my choice and taste change. I regularly eat Biritannia 50-50 Biscuits.And refer others to eat the same.Though it is salty, more tasteful.I also eat monaco, but Monaco is very salty biscuits are very salty and always require to drink plenty of water after eating.But Britannia biscuits are less salty and that is why more popular than other biscuits.Also rate are very reasonable that is why middle class person can buy.Retailer network is very strong all over India.Most of the our parents select this as gift purpose.I tasted all products of Britannia. All are good other than this brand.So, I request you taste at least once in life.you will never forgot taste of this products.", "tbiswas31": " This is very good product and I love it very much. When I used it first time I was confused for it. But after use it I can say that it is realy good product that you can use it. Personaly I love it. Some negative feedback I get from other but you can ignore it. Just you go for it. If you don't use it just you can try for it. After useing it you will be like this that is my thought. It is my personal exparience on this product.So you just go for it. You will be also love it. . . .", "sanjuaug888": " I love to eat the Britannia 50-50 maska chaska  biscuit of which so crunchy and love to eat this  biscuits  by not only children but elders also I was very much fond of chocolate biscuits but when I started this  buiscuits I have left the all buiscuits of all brand I was taken aback to taste  the other brand britannia fifty fifty is just like a brand which has no calories have iron minerals vitamin c and calcium.It is the  product which has the all type of ingredints can be taken by all ages of men  and women. now britannia has various kind of  product like which has bread buiscuits and other product which can be taken in the breakfast and other ocassion also it can be consumable without tea or milk can be taken by water also.", "mjangalwa": " Britannia is surely understood for scones and cakes. 50: 50 bread rolls are my top choice. It is my first decision with tea.Britannia 50: 50 are sweet and salty scones. Exceptionally crunchy bread rolls. At the point when its tea time it is likewise britannia 50: 50 time too.These bread rolls are exceptionally sensible in expense and adequate in amount. It is subjective and in addition quantitative moreover. When I opened the packetoof britannia 50: 50 I eat all scones since it is too.much divine rolls. Pressing is in green shading bundle. These bread rolls are fit as a fiddle.Kids love these scones I likewise eat these bread rolls from adolescence.", "skaleefa": " This is my all time favorite biscuit. Whenever I want to have something light I go for it.From my childhood 50-50 hold its taste.It is available almost everywhere in india.Comes in squar shape.Available in different quantity.I know it is so so popular that you already know about this britannia 50-50 but I cant resist myself to explain.Packaging is not that good as it was earlier.Size has also became smaller wgich is not good.If you have not taste it yet please check it out.", "akshaysonavane5": " Britannia is the most popular brand which manufactures many tasty eatables.It incliudes the Biscuit's, Snacks and  many more.The Britannia company manufactures the eatables which are safe for eating with no added synthetic materials.The Company is manufacturing the products many days ago.The Britannnia 50 -50 biscuits, as name suggests it is Salty as well as Sweet in taste.The biscuits are soo delicious coming in the thin and square in shape.It is tasting delicious with a cup of Tea and serves as the morning partner for the people.My entire family is crazy for the biscuits.The biscuits are crunchy in taste and are soo delicious.Thanks for giving such a tasty and delicious biscuits.", "srkdhiraj": " Britannia is my favorite Biscuits for morning break fast. It is very crunchy and tasty. This is lightweight biscuits of Britannia. I always purchase this Britannia Item when I am with my friend. The test of this biscuits not very sweet so we can enjoy it with tea.When we take it with hot tea its test is awesome. That is the reason why I am always purchase this biscuits. Also this is very famous product generally this Britannia product easily available at any where in India. This crunch voice of this biscuits is very sweet I like the voice create during the bites.", "royaljangid93": " Britannia 50 - 50 Biscuits is my favorite biscuits. I have eating this biscuits long times.It is an extremely decent and bread subsequent food organization.I am eat many biscuits but Britannia is very testy biscuits.It is also crunchy and yummy biscuits.Britannia brand is known one of the trusted and valuable among Indian consumer.I have with coffee and biscuits is my favorite snack for the morning breakfast. Britannia biscuits rate is reasonable.this variety is very good and best product in India.", "pranayaot": " This item is the made by the Britannia 50-50 bread rolls thus pleasant of the item and best item. What's more, this item is to be a sold in the India. Increasingly the general population like to be eat this kind of the scone in India and the primary concern is that the a large portion of the youngsters and the more youthful individuals like to be this rolls. Individuals loves this scone with the tea time.When I was little that time I like this organization bread rolls and the such a large number of item are to be accessible in the business sector like the scones, spread, milk, as such a large number of other item in the market.so by and large is to be similar to bread item. When I was to be go in the school that time in my tiffin I take for the lunch take a bread rolls. Really it is the very crunch, so salty, so firm, so drain and are to be included a wide range of the ingredience so pleasant of this heavenly bread rolls I cherish it.so at whatever point my dad ask me which scone you won't that time I told please purchase for me Britannia 50-50 bread rolls and that the same things are purchase for me my dad so flawless and one additionally thing and when I was to be adolescence that time such a large number of time I purchase this scone and the I cherish it and I eat this bread rolls each day in tea timeSuch a variety of good thing are incorporated into this bread rollsQuality. At the point when any shopper are to be a purchase any item that time purchaser are to be see the main quality and the best nature of the Britannia item.Cost. Britannia 50-50 rolls are to a decent and powerful cost to all the parcel the bread rolls are having an alternate value like a 5, 10, rupees of Indian money.Outline. Britannia item having such a large number of style and it ought to be an outline Britannia 50-50 bread rolls are square and in that square are entire 9 opening on each.I adored this scones and I will prescribe to everybody as it is useful for wellbeing moreover.", "rpokhriyal97": " Britannia 50 - 50 Biscuits is very good option to have with your tea. its good product to have with tea and milk and you can eat it simply too. this product is good its crunchy and lite salted to its tasty too. its good with tea because.its light so its not heavy in eat.its lite salty taste so if you will eat with tea than its combination of salte and sweet.only tea is not good for health so its good lite option with tea.you can buy it easily from your nearest local store.price is reasonable and its brand of Britannia so its reliable.so add this product with your tea and enjoy the tea with Britannia 50 - 50 Biscuits"}], {"diptanuchakraborty": " I always buy biscuits of Britannia brand because the products of this company are trustful and quite healthy also .I buy Britannia 50-50 biscuits because I like it the most.It is tasty also light  and specially because  it is healthy. I don't like too much sour biscuits so I love the taste of it, not too much sweet, not too much sour.Also it is cheap as compared to the quantity.There are many brands like sun-feast but I feels that if you want to taste something new and tasty then I think you should try it once.People who doesn't like cream fillings biscuits and not so plain biscuits then they should try it once . They will surely like it  also it is a vegetarian product and also available in cheap price.Thank you", "Rheosh": " Britannia is a marked Company and I eat their items since my childhood.They are the most sold brands in India.Every one of the kids love the taste and especially, Britannia 50-50-Biscuits are exceptionally tasty, they arrive in a slick packing, squared in shape, the flavor is salt and sweet.they can be appreciated at night time with tea or coffee.it is able for trips, picnics, long drives etc., it is extremely crunchy and yummy.the bread rolls are light and useful for digestive system.overall, i cherished these scones and suggest it.", "Mohith98": " Britannia 50 50.i think every one know this quite often. Since our childhood we know itI used to have more fun eating it in my childhood.they are healthy and easy to digest also contains nutrients for growth of children. Britannia had launched a good product.Also it tastes good while munching in tea or milkso finally we are getting healthy and nutrient food from britannia. Hope they give more product like this!", "armyguy": " Hi  its too healthy biscuits the company its very attractive company as I know from my child wood this biscuits its not too salty and its not too sweet the pack of the biscuits its very nice small clean packing from my child wood am having this biscuits my family members also have in evening with tea and coffee every day its to healthy for all childrens it can have in any time the company they have not changed any taste like too sweet are salty but I love to everyday in my home are in my work place too but there is no doubt about this product its very very good to eat any time for children's its safe .in my office also by evening they're providing this biscuits in morning time and in evening everyday so I all referred you its very safe to eat. The company is an amazing  they sends the quality foods.", "chaithanyachacao": " 50-50  biscuits was very nice  salt and sweet biscuit , they have some of flavor s ,  kids  also like to have this.I love this one , we are getting 5 rps pack 10rps pack  like this its  low cost and get healthy biscuits ,  refined wheat flour ,  sugar , invert syrup edible veg oils , yeast all ingredients,  as a flavour butter, vannilla and milk  its all contains added flavor s .This is good and healthy food .Sweet and salt the best time pass .And zero trans fatEat healthy , and think betterThank you britannia", "atharkhan": " This biscuit we have eating from last 4 years. It is crunchy flavour is good and not any issue in it.i m good to eat it.this is my favourate and I m always eat it. Everyone eats it at my home. It is crunchy when we eat itI really like this biscuit from my hears.it is too old biscuits and I like it very much. Its price is only 10 rs packet.good packet it is and flavour is also good as I know.it is really good biscuit and it is really sugarfree biscuits.i like it so much trust me you also like it so muchI love this biscuits for eating. It makes my day. I love it. Really good biscuit eat it once", "kamaladevikuwar8": " This product is the made by the britannia 50-50 biscuits and so nice of the product and best product.and this product is to be a sold in the India. More the people like to be eat this type of the biscuit in india .and the main thing is that the most of the children and the younger people like to be this biscuits.and the people is to be a eat this biscuits with the tea time .When i was small that time i like this company biscuits and the so many product are to be available in the market like the biscuits, butter, milk, ans so many other product in the market.so generally is to be like biscuit product.when i was to be go in the school that time in my tiffin I took for the lunch take a biscuits. Actually its is the very crunch, so salty , so crispy, so milk and are to be added all types of the  ingredient so nice of this tasty biscuits i love it.So when ever my father ask me which biscuit you wont that time i told please buy for me britannia 50-50 biscuts and that the same things are buy for me my father so lovely and one more thing and when i was to be childhood that time so many time I buy this biscuits and the i love it and i eat this biscuits every day in tea timeSo many good thing are include in this biscuits1.quality. When any consumer are to be a buy any product that time consumer are to be see the first quality and the best quality of the britannia product.2.price. Britannia 50-50 biscuits are to a very good and effective price to all the packet the biscuits are having a different price like a 5, 10, rupees of indian currency.Design. Britannia product having so many  style and it should be a design britannia 50-50 biscuts are squre and in that squre are whole 9 hole on eachThank you", "akashyadav1797": " 50-50 biscuit is a very amazing biscuit of the Britannia.Britannia is leading company in the biscuit business, Britannia is one of the most selling biscuit in the present days.Britannia 50 - 50 Biscuits is my favorite as my childhood.I likes to eat this biscuit with the tea.My family is also likes this biscuit.the flavor of the biscuit is very good and it is very good for the eat.There is no doubt about the quality of the Britannia.it is very good biscuit company.the packing of the biscuit is very good and also very attractive.it protects the biscuits from the outer damage.But the biscuit is very salty as compare to the Britannia Biscuits.So there is a need to reduce his saltiness.the cost of the biscuit is less so people easily afford to it.The overall biscuit is good and good for the health also.", "AmandeepKaur125": " Britannia is very trustworthy brand. When there is a talk about 50: 50 there is no doubt it is like by all. I am eating there biscuits from childhood.Britannia 50: 50 is now available in another flavoir also. It is sweet and salty. Very crunchy biscuits. it makes our tea tasty. When its tea time it is also britannia 50: 50 time also.It is cery reasonable in cost and sufficient in quantity. It is qualitative as well as quantitative also.From kids to elder these biscuits are favourite by everyone.I love these biscuits.", "meher9396": " Hey its excessively sound bread rolls the organization its extremely appealing organization as I probably am aware from my youngster wood this scones its not very salty and its not very sweet the pack of the rolls its exceptionally pleasant little clean pressing from my tyke wood am having this scones my relatives additionally have in night with tea and espresso consistently its to solid for all childrens it can have in at whatever time the organization they have not changed any pose a flavor like too sweet are salty yet I want to ordinary in my house are in my work put as wellin my office likewise by night they're giving this rolls in morning time and in night regular so I all alluded you its extremely safe to eat. The organization is an astonishing they sends the quality sustenances.", "Saharsh.sinha": " Not many products lasts long but if they do there must be a reason to it.I remember the very first ad of 50-50 when I was a child.Through the years I of using the quality hasn't changedIts still a delightful snack to enjoy with tea.The packing has improved over the years .I use for my journey too trust me even if you have bad tea. you would enjoy it.", "soninice1": " Since my childhood days I am a fan of Britannia 50-50 biscuits. Though other brands also came up with the same type but I have always stuck to Britannia because I find its taste better than any other biscuits.One thing that surprises me the most is that its quality remained consistent throughout the years. I almost take them along with me to my office where I have my daily evening tea by dipping these Britannia 50-50 biscuits in it. I simply loved it. Moreover, its quite healthy with zero fat.", "reviewyahoo": " Britannia is a very nice FMCG company.They have been making cookies and biscuits since long. The have ruled in the tea-time snack for a long long time.I like 50-50. Its taste is very nice. Its crispy, crunch and it has a sweet and salty flavor.It goes beast with tea. Although it can not be replaced with food, but is gives a little energy due to carbohydrates and sugar in it.Also it is easy to digest.As far as the pricing goes, its perfectly priced taking in account the quantity.So its a nice biscuit. Give it a try if you haven't yet.", "babita_miglani2003": " Britannia is the best company. I like his all brand his brand like 50-50, maska chaska are very taste. I like very much my family also like britannia product.I always use britannia 50-50. Britannia 50-50 is the best salted biscuit. I like it it is very famous and tasty brand in India when they launch new brand biscuits I tries us its rate is very cheap so it is affordable to all people very delicious I eat britannia 50-50 with tea. I like it bye friends", "rahul0302": " The crispy britannia 50-50 biscuits are awesome. This crunchy biscuit has a different taste altogether. This is the biscuit which every age group prefers in my family.You can have this biscuit with tea or coffee or just have it like that without any beverages. The pudina flavor of this biscuit is favorite of mine and my dadi. It is one of the best long time selling biscuits in the market. it's taste is not very sweet that is  why I like it.", "uvaraj_s": " Britannia is an extremely decent food organization. They have been making treats and bread rolls subsequent to long. The have ruled in the tea-time nibble for a long time. I like 50-50. Its taste is extremely pleasant. Its firm, crunch and it has a sweet and salty flavor.It runs mammoth with tea. In spite of the fact that it can not be supplanted with sustenance, but rather is gives a little vitality because of starches and sugar in it. Likewise it is anything but difficult to process. Similarly as the estimating goes, its flawlessly valued taking in record the amount. So its a pleasant scone. Try it out on the off chance that you haven't yet.", "deepaknov1984": " Britannia 50-50is my favourite biscuit.I likes it's salty taste.I used to eat this as snacks in the evening with tea.Every category of people can use this because itvis sugarfree.I also like to eat it when I am watching cricket on television.I have some gas problems when , I use snacks with tea, but when I started using this biscuit as snacks the problem went away.So I recommend this biscuit to everyone.", "mohdzahedali": " Britannia, I believe that Britannia  is a whacky side to everyone - sometimes hidden, at other times overt. And this is what I celebrate with our brands 5050, Maska Chaska, Time Pass &amp; Top. With products which can well be called differentiated, in the world of sweet biscuits, these brands have carved out a special place in the minds of consumers across the country.Maska Chaska is a delightful biscuit dipped in butter and peppered with the choicest of herbs. Needless to say, this mouth-watering biscuit soon became an instant hit and a regular in most households.I suggest u all to have it regularly with ur tea.Thanks,Zahed.", "man_inder": " Britannia is well known for biscuits and cakes.  50: 50 biscuits are my favourite. It is my first choice with tea.Britannia 50: 50 are sweet and salty biscuits. Very crunchy biscuits. When its tea time it is also britannia 50: 50 time also.These biscuits are  very reasonable in cost and sufficient in quantity. It is qualitative as well as quantitative also. Once I opened the packet of britannia 50: 50 I eat all biscuits because it is too. Much tasty biscuits. Packing is in green color packet. These biscuits are in square shape.Kids love these biscuits I also eat these biscuits from childhood.", "jtajuvan": " ##britaniya 50-50##50-50 have been around for a while now ! No wonder its one of Britannia's best product .Its tasty and also affordable at a low price.The flavouring and all are quiet good, and the salty one is just too good.It may not be such addictive biscuit and all but its worth buying.!&lt;"}], {"sehajdeep260": " Hello all im going to give honest and full feeback of britannia 50-50 biscuit .it is available around the country easily and it is my favourite biscuit because of its big brand name britannia .britannia is trusted all over india .The packing of biscuit is fine with great quantity inside .the biscuit are crispy and crunchy , nd very light. The taste is very good and me and my family always buy these biscuits as it is not costly to pocket also.so I would recommend britannia 50-50 to everyone if you are looking for better taste and not costly!", "adharsharmaa": " Its been like ages I have been munching 50-50 Biscuits. whether its a tea time or midnight tummy call 50-50 is always a best option.The combine taste of salt n sweet makes for the best snacks option. You cal also feed these biscuits to small age children and infants aswell as it is not spicy and neither very sweet or salty as well. And thousands time better option then buying bag of Air worth Rs20 and you can get almost two 50-50 for same price. not even the quantity but the quality is also better then those Air bags.I like these biscuits very much and if you have never tried it you should.", "varunbansal1989": " It's a one of the best and old Company. I saw its plant in Delhi . Very nice Quality of the biscuit and very famous brand as wellWhen we were in school .  We always say khao britannia 50-50 . Best advertisement. And I really enjoy to eat and taste is perfect.Nowadays, britannia is not giving that type of best quality as they gave in past", "arunmvt": " Britannia 50 - 50 Biscuits is considered as common mans biscuit.It comes from the most famous biscuit brand britannia which has got trust from millions of people. I am a regular customer of britannia.Almost all age groups loves this biscuit and I can highly recommend this product.the price is also reasonable and its available in almost all grocery stores.Taste of this biscuit is very good and I love britannia biscuits", "Mohanprasath89": " Britannia 50-50 biscuits are not really good now a days. Early am frequently taste this biscuits that was really awesome but at present they are trying to make it better but as usual it has went wrong. Total quality of this biscuits are really getting down.They should keep the old quality to sustain the market. Ingredient which are using now is not at an up to the mark.    After it's tremendous failure with Britannia NutiChoice Multigrain Thins and NutriChoice Multigrain Roasty, Britannia has accompanied another intriguing idea of nibble enhanced rolls called \"SNACKUITS\"…", "subhashjoshi97": " This is one of the best salted biscuits I like this very much. Almost every evening and the morning I take this biscuits with tea. its best salted crunchy biscuits. the best product of Britannia.Its so crunchy.Its best with tea.Easily available your nearest store of local shop.reasonable price.Its really a good biscuits and you must try this. It will make your tea more tasty and healthy. sugar free salted biscuits.", "muralidharr9": " Britania 50-50 biscuits is one of my fav biscuits from my childhood and I am always happy consuming these biscuits. These biscuits are crispy and tasty.The more we eat the more they tempt us eat that is y I like these biscuits very much. Now there are two more flavours in this type and they can choose which flavour u want. moreover they will be reasonable price only.  This is recommended to all biscuits lovers.", "bhambure23ashwini": " Britannia 50-50 from its name one can assume that it is something different in taste than other common taste it is half Sweet and Half salty which make it different from others.Britannia 50-50 biscuits have zero trans fat so no need to worry for health issues. Its ingredients donot have any harmful contents.only some added flavours that too natural.britannia vegetarian product.britannia available 80gm 10rs, 120 gm 20rs etc.After doing hard work we can eat it to bring good taste as it makes us more thursty.when it sticks to our teeth causes tooth cavity, so children should brush their teeth after having a meal of britannia 50-50.the price is also reasonable and its available in almost all grocery stores.Taste of this biscuit is very good and I love britannia biscuits", "shamilps": " This is a brand that does not need any introduction to Indians as it is very famous and established brand in India, I am using this brand for many years, I have used all other brands too in the market, but this is one of my favorite biscuit that I ever had. the taste of this biscuit is something unique and other main thing is that the price of this Britannia 50 - 50 is cheap while compared to other cookies and biscuits in the market.I always stock this at home, and this is my favorite while having a cup of tea, I hope this is brand which is widely accepted by other majorities too, the crispy ness of the biscuits is the main thing why people love to have it. The mixed sweet and salty taste is the unique taste of Britannia 50 - 50 biscuits, and that is the taste which is accepted by the Indians another fact is that Britiania 50 - 50 is the best choice for all age groups.There are many flavors available for Britania 50 - 50 biscuits, each and ever flavor is having a good taste, Britania have well established in the market, and so they dont need big advertisement to have a good sale, the taste what they provide is well enough to get a market coverage.So from my knowledge with Britannia 50 - 50 Biscuits, I can state that this is the best yummy and crunchy biscuit that I ever had, I am eating this tasty stuff from my childhood still now I have not faced any digestive problems too.My favorite Flavor: Maska ChaskaMy Rating: 4/ 5Thank You,Shamil P.S", "bollapavani559": " Britannia 50-50 is spice of life and this best suits for food….the more the varieties the more the options to choose on….Due very unhealthy lifestyle habits, we always think to get indulge in things which keep us fit and going….As we can see there are lot of options even in snacks, which you can munch on to satisfy that untime hunger rants without gaining that extra kilos.After it’s huge success with Britannia NutiChoice Multigrain Thins and NutriChoice Multigrain Roasty, Britannia has come with another interesting concept of snack flavoured biscuits called “SNACKUITS”….isn’t it yummy? Snackuits comes with a tagline which says – ‘snacking ka mazaa biscuit mein’…which means you get the taste of snacks in the biscuits….that too guilt free as these are baked, no Transfat and No MSG….I know…you have said wow right?….you have read it right….an guilt free snack flavoured baked biscuits.I recommended to all eat only britannia 50-50.", "ashishbhatnagar_1": " Britania 50-50 are the best biscuit because they are rich in taste and it taste very delicious when you take it with the tea. I am a fan of this biscuits from my childhood and I have never found any side or harmful effects of this biscuit.The best thing is that it come at very pocket friendly prices and any one can afford it. You can also take this biscuits with cheese cream . This is the main reason why this biscuit keep maintain its trust among the users", "AniketS94": " Britannia 50 -50 is one of the popular biscuit in India. I am eating it from so many years and never lost its utility because of its taste. The main thing Why I buy this biscuit because its really cheap. We will get at Rs.10/- which is really worth. We will get 2 packets of rs.5 each. The quantity is much which we can use it for 2 days for cofee. And also we will get energy to work in the morning.This biscuits are very light easily we can break it. And also sometimes we will get offer of 20% extra by that we will have more advantage. There marketing is trustable and packaging which they make is very good, which is in orange and light yellow color. We can keep so many days and there is no fear of going air from the packet because if we torn the packet inside there will again one more plastic package. Overall its a best biscuit to eat Specially in the morning.", "coolyashnara": " Britannia 50: 50 biscuits are Not at all good. It has got one of those normal tastes.For me if you dont wanna ruin your tea, You won't eat it.Yes it has got some of'em vitamins and protein but it is made up of flour which not so healthy for a human body.It does taste weird when we take it with tea.I think britannia should improve its quality .Although  britannia is well known brand but it is not better than BISK FARM's products.Or they should provide some new variety of biscuits on the market because this 50-50 is something they cannot shut it down after all it is making profits till now for them.But if I compare it with other biscuits it is not a good option .Thank You Everyone", "bikram12340": " Britannia is brand which is serving before my birth took place and still it is serving the whole India with glamour and attitude. Britannia 50-50 from its name one can assume that it is something different in taste than other common taste it is half Sweet and Half salty which make it different from others.Its soft texture with salty test and its sweetness with curry leaves make my love very very passionate for it.Its sweetness never not spoil my taste of tea as it is not too sweet and its \"O\" transparent fat make it more enjoyable for every one.Its tetra pack of 10 rs is also very reasonable. Its design as same as it was 10 years ago but now it becomes more testy and crunchyAt last it can be said that it is best snack for me in my teatime to make my mood crunchy and sancky.", "panchalsatpal": " Britannia 50-50 is spice of life and this best suits for food….the more the varieties the more the options to choose on….Due very unhealthy lifestyle habits, we always think to get indulge in things which keep us fit and going….As we can see there are lot of options even in snacks, which you can munch on to satisfy that untime hunger rants without gaining that extra kilos.After it’s huge success with Britannia NutiChoice Multigrain Thins and NutriChoice Multigrain Roasty, Britannia has come with another interesting concept of snack flavoured biscuits called “SNACKUITS”….isn’t it yummy? Snackuits comes with a tagline which says – ‘snacking ka mazaa biscuit mein’….which means you get the taste of snacks in the biscuits….that too guilt free as these are baked, no Transfat and No MSG….I know…you have said wow right?….you have read it right….an guilt free snack flavoured baked biscuits.I recommended to all eat only britannia 50-50.", "Sanpc3": " After the teenage I tastes the Britannia 50-50 after my krack-jack.Quite well lot of crunchy with super tastes of sugar and salt.wrapper of the biscuits is colourful. best quality with right quality biscuitsfor 5 rs pockets have 10 biscuits. full of fun with nice tastes.When I purchase in rural shops lot of biscuits damaged and powderedso I miss that fun. don't save that biscuits out of the pockets its taste was gone sowho to tastes crunchy biscuits with sweet and salt it was first choice.  Best with nothing but I made for this tea", "manvin775": " Britannia 50-50 Biscuits is the one which I remember from my child hood. I has good taste and healthy Biscuit. when I was in school I used to carry Britannia 50-50 Biscuits for Snacks. Now there many brands in market but still I choose Britannia 50-50 Biscuits.I still remember that I used to steal the biscuits from airtight container. where my mom used to hide. and I suggest my colleagues to try this Britannia 50-50 Biscuits.", "krishna_14322": " Britannia 50-50 biscuits are one of the best biscuits this is not only testy but also yammy.britannia is a branded company and I eat their products since my childhood.all the children love the taste and especially biscuits are very tasty, they can be enjoyed in the evening time with tea.Britannia 50-50 biscuits have zero trans fat so no need to worry for health issues. Its ingredients donot have any harmful contents.only some added flavours that too natural.britannia vegetarian product.britannia available 80gm 10rs, 120 gm 20rs etc.Over all I loved these biscuits and recommend it to all my friends.Awesome taste its really maska chaska.when I meet ma friends, we used to eat this britannia 50-50 biscuits.its very crunchy.", "sonumonu546": " Thi biscuits are very sweet and salty too. I used to eat these a evening with tea. Because of salty test I can eat more and more 50-50 biscuits . Quality is best. Krack jack biscuits are also little but same as 50-50 but test of 50-50 is good. I like it most .Price is so less now we can buy it for just rs 5 also. I like these very much namakin biscuits. Sweet and salty . I think britania 50-50 biscuits are so healthy for anyone . So Britannia 50-50 is best biscuits.", "omarsohail1": " Britannia 50-50 is a type of biscuit used in almost every house of india. when guest come to common people's house due to financial condition britannia biscuit is used instead of serving costly biscuits.It is the most saleable biscuit of india after parle-G.It contains less amount of sugar, so it  can be served to diabetes patient.After doing hard work we can eat it to bring good taste as it makes us more thursty.when it sticks to our teeth causes tooth cavity, so children should brush their teeth after having a meal of britannia 50-50."}], {"bhavtoshsisodiya": " I am a biscuit lover. I always use parle g, parle mari light and many more with my tea or coffee. Britannia 50-50 is also one of my favourite brands.I love salted biscuits instead to sweet cookies. So I generally brought 50-50.It is very crunchy and the perfect combination of salt, meda and other ingredients. I always serve these biscuits to my colleges and they also love it. I am following this brands since 15 years and happy to say that I am totally satisfied with the taste of this biscuit. It also comes in my pocket.", "rdaraz": " The new and freshness we might wont get in any bread.This scone is truly preferred by numerous individuals fro long time, as a result of its firm and better than average taste.Notwithstanding for little sum we ca purchase this, however wont fill the stomach. It incites us to eat an increasing amount, you can attempt this.Taste is OK, fresh, piece sweet and salt blended flavor, light weight scone. Great quality item with incredible amount as well, great pressing simply fair and basic . for the most part accessible in stores, pastry shops, bazaars even hotel little slows down.", "tarannumv": " Yes, as my title suggest.It was the biscuit the was mostly available in the market. Or I can say there was only three choice and this was one of them.As the shape is good. The color is good. The smile that is sweet. All of this things used to attract me ans I guess other children as well. The rate were affordable.The snake which was available while travelling on  every bus stop or station. The quantity is a good thing about it. The packaging is attractive. The name is awesome it catch the eye of cricket lovers. If we talk about the nutrition value for 1 pack that is of 55gm. Then it will be as follows.Calories    273Sodium  0 mgTotal Fat   14 gPotassium   0 mgSaturated   7 gTotal Carbs 32 gPolyunsaturated 1 gDietary Fiber   0 gMonounsaturated 5 gSugars  6 gTrans   0 gProtein 0 gCholesterol 2 mg Vitamin A     0%Calcium 0%Vitamin C   0%Iron    0%Now a days this biscuit have very strong competition in market by other brands providing same kind of flavors.But I personally like to buy these as I was the first of its kind in India. And I love it. Hope you get some information from this. Thanks for reading.", "pakku2deepak": " No need to say anything about the taste of biscuits as every one know these are really favorite for many people including the elders.Coming to the concept that they use for advertising is very innovative since many people want to know what they are thinking about themselves inside, so these people took the concept of the same in the advertisement the one who is eating this 50-50 will be speaking the bad out and the good in one after the another in just a seconds of time. Which really makes people to understand the taste of the biscuits with out eating it. So here I mean to say the concept and biscuit are clearly related each other.", "hemilupadhyay": " Britania 50-50 is very higenic biscuit to eat.I like the taste of this biscuit and the biscuits are very tasty. I always buy this biscuits to take this in my tiffin.There is not much calories in this biscuit. the biscuits are packed very nicely and the price of these biscuits are not much high. there various packaging available in the market. almost all the general store sell this biscuits. if you haven eat this biscuit yet then must try this, you will definitely like it.", "suneel896": " I use many biscuits as in parle g, marlo, 2020, monaco, btitannia 5050. when 6 years old. my father give me 10 Rs and say to me go and any food product purchase . I go shopkeeper and I purchase britannia  50-50. I open the packet and eat the biscuit.I like this biscuits and and the taste is so good .this biscuits is different another biscuits and good for health . this biscuits is low weight and I take this biscuits with tea and milk. when I iam going to office then my breakfast in britannia 5050 whith tea. this biscuits better 2020. I love this biscuits so much and good for health. I suggest for all children to take this biscuits with milk and good health for children. but this biscuits is not better then parle-g.", "manisheng779": " Hello friends.Britannia 50-50 Biscuit is salty and crunchy biscuit.it is a testy and healthy due to more fiber contain in it.but it is some oily type biscuit.when you eat it with tea and coffee it gives awesome experience .my same experience is great.I always prefer Britannia 50-50 biscuit with ginger tea .it is my best friend of time pass.it also contain some nutrition.Britannia 50-50 biscuit is best in there segment with price and test comparison.my recommendation is yes.you must try like me.", "balu8500": " 50-50 belongs to the family of crackers and is considered the \"very very tasty tasty\" snackbritannia is a branded company and I eat their products since my childhood.they are the most sold brands in india.All the children love the taste and especially, britannia 50-50- biscuits are very tasty, they come in a neat packing, squared in shape, the flavour is salt and sweet.they can be enjoyed in the evening time with tea or coffee.it is apt for trips, picnics, long drives etc., it is very crunchy and yummy.the biscuits are very light and good for digestive system.overall, i loved these biscuits", "Faim_Uddin": " Britania's 50-50 biscuit is coming from many years and this is most probably one of the best salty biscuit accessible in the market. This biscuits has specific fixings which makes it rich in its taste. Great quality item in affordable price. Biscuit is square molded and blend of sweet and salty its exceptionally crunchy.Bratannia 50-50 is accessible in different flavours and all flavours are too great and delectable. I every day utilize this biscuit either in morning or in night and the best part about this item is it contains low sugar amount in it. Normally I don't run with different biscuits on the grounds that I cherish this one. Simply love this product", "greenday": " I want to give some description about Britannia 50-50 that are known to me, as this biscuits are good in taste as well as has good diet values too.Long term use of diets high in sugar are linked to increased risk for diabetes, obesity and contributes to cravings, mood swings, PMS, and a host of other conditions. Also, some studies suggest that its not FAT but sugar that is the cause for higher intake calorie and excess weight gain. Now no need to go to other extreme and drop sugar completely from your diet.So, it is better to limit the consuming products like these which are high in sugar or better still avoid them.", "tumpachowdhury": " Britania 50 -50 biscuit is Sweety and salty.Taste is of the biscuit is very testy.It is a less oily biscuit.Other salty biscuits are very much oily. From childhood I am really happy to take. Britania 50-50 is very much hygienic biscuit to eat. I love the taste of this biscuit and the biscuits are very tasty. I always buy this biscuits to take this in my tea time.There is not much calories in this biscuit. main thing is bisuits are packed very nicely and the price of these biscuits are not much high. Anybody can buy any time. It can store for long time in a contenor .Small child can eat freely. so besure to take and give anybody.", "pandavjatin": " The biscuit are very good food for helth.you are eating the this very safly. Becous this product are very chip and sasto.good for helth and you buy for any wery.britannia are good company they are import the best quiality produt food and any one product .The will desrv that thi product are best quality.this product are u buying for any waer for retal shop best selling product .thi biscuit are very chip for any person are buying.", "rawatmani23": " Britannia 50-50 is my favourite biscuits. it is  the most popular and best biscuit . I use this bisuit since my chilhood.I eat this bisuit when I am free and my breakfast. it is very tasty. its taste is different .britannia 50 50 available in cheap rate in market so I like it.My family also use this biscuit and my other friend relatives also used britannia 50 50 bisucit. it is very useful and necessary for me because it we cant take a tea and coffee. it is something salty and something sweet..Its quantity is also good. in cheap rate you can get good quantity .now a days in market lots of biscuit available but I always use this biscuit. beacuse of its taste and its rate. the cost of one packet is rupees 5. which is very few and everyone can effort this prize easily.its packing is also good. it is only useful not harmful you can use this bisucuit without any hesitataion.Britaina is branded product.any age group person even if he is child, if he is young and old everyone likes its taste. so it is very popular in market. its . you can enjoy it with tea and coffee. you can eat it without tea and coffee becuase its very tasty.it is very yummy in taste.i loved this bisuit and my frd also loved this buscite. bratannia 50 50 is available in various flavour.All falvour are good and talsty. I daily used this biscuit. britannia 50 50 is old brand it is very healthy. it contains low sugar its bisucit shape look like a square. generally at a tea and coffee time people use this bisucuit genrally lots of bisuit availabe inmarket but mostly I use this biscuit. I never used other type of bisucit. I eat this bisucit genrally morning everning and night.it is one of the best and famouse because of its good quality. britannia always provide good quality and reasonable prize.relly it is very cranchy and tasty child likes this bisuit very much. you can serve this bisucit with tea and coffeee.in this bisuit low sugar find which I s very helpful. mai chahta hu aap bhi iss bisucit ko hi purchase kare . ye kafi and accha biscuit hai. so aap jaldi se aakar ye bisuit pruchase kare. I recommended this bisuiit for ho I hope you will like this buscuit, it is very popular in our society. to agar aap accha and tasty bisucuit khana chahte hai to britaannia 50 -50 buscuit buy kare", "raju_ediga": " This is another salt biscuit from britannia, its good to have this biscuit but not too much because I felt it is not made with the wheat it will be some maida or some else, it come in 5 and 10 rs please dont eat these maida type of biscuits much, also we have parle krackjack in the same type better to taste it as well, it is better than 50 50I recommend maska chaska of britannia because it is purely paisa vasool biscuit.", "aaafaq12": " Britannia is old and famous brand for biscuits.They make some really tasty, healthy biscuits. and quality of them are pretty reliable. Britannia biscuits are famous all over the globe specially in India.Britannia 50 50 is simple in taste no one can say its bad. some may not consider as best but cant hate at all. So its cheap and healthy yet tasty.Britannia I prefer because old and reliable and Quality products. I like other brand too but when I my mood strike I eat britannia 50 50. Since we so many options available as same price. So one cant eat same biscuit throughout lifetime. you may get bored within 3 to 4 days of continuous usage.And it is recommend for everyone when you bored with other biscuits.", "rabinbiswas": " Variety is spice of life and this best suits for food.the more the varieties the more the options to choose on….Due very unhealthy lifestyle habits, we always think to get indulge in things which keep us fit and going….As we can see there are lot of options even in snacks, which  munch on to satisfy that untime hunger rants without gaining that extra kilos. After it’s huge success with Britannia NutiChoice Multigrain Thins and NutriChoice Multigrain Roasty, Britannia has come with another interesting concept of snack flavoured biscuits called “SNACKUITS”….isn’t it yummy? Snackuits comes with a tagline which says – ‘snacking ka mazaa biscuit mein’….which means you get the taste of snacks in the biscuits….that too guilt free as these are baked, no Transfat and No MSG….I know…….all frainds have read it right….an guilt free snack flavoured baked biscuits.50-50 SNACKUITS – ITALIANO PIZZA:An Italian experience in every bite of these light and crisp bites which are baked to perfection and each Snackuit is seasoned with fresh oregano, onions and garlic.MY VERDICT:I can clearly taste the flavour of oregano, onion and that hint of garlic….very mildly spiced….I love the crisp texture and beautiful square shape of these Snackuits. La Dolce Vita! Snack on it….", "rahilshaikh8460734": " Hy.I am a biscuit lover. I always use parle g, parle mari light and many more with my tea or coffee. Britannia 50-50 is also one of my favourite brands.I love salted biscuits instead to sweet cookies. So I generally brought 50-50.It is very crunchy and the perfect combination of salt, meda and other ingredients. I always serve these biscuits to my colleges and they also love it. I am following this brands since 15 years and happy to say that I am totally satisfied with the taste of this biscuit. It also comes in my pocket.", "sapanagarwal0611": " Britannia 50-50 Biscuits comes in very varient like like 50grm, 100grm, 150grm, 200grm.Britannia 50-50 is very know brand and very cheap every one can afford it.Britannia 50-50 is very tasty biscuit whenever we want to go somewhere we only purchase it because it is easy to digest.Everyone can eat it whether child or Old person.Britannia 50-50 available on all confectionery shops.Britannia 50-50 come in only 5 rupee it will give you full Value of money and easily digestible.", "biswajitsr": " Britannia 50 - 50 Biscuits is my favorite biscuit for the tasty flavor. It's so light and chipsy. Since a long time I am eating this biscuit regularly. It's a famous brand and great for it's sweet flavor.Britannia 50 - 50 Biscuit is sweet with little saltiness. It's medium in size and light in weight. Although it's little sweet, it does not contain much calories which is good for health.It's always fun to see the innovative advertising of - biscuits. 50-50 biscuits has a good and colorful packaging with a wonderful name.  It's from the famous and trusted Britannia brand and good for time pass eating. I like to have Britannia 50-50 biscuit with tea but it easily melts on tea. It's also favorite biscuit of my child. It's always available at my home.", "Afroz82": " Britannia britannia marrie gold has very good taste, whether it should be tea or without tea it has very good taste.I have 8 months baby he love britannia biscuits very much, every day in the evening he needs britannia biscuit, one day I have done one experiment on him I have given other biscuit he was start crying then immediately I have given a britannia biscuit.When he tasted this biscuit then he stop crying, from that day I always prefer one and only one biscuit that is britannia biscuit."}], {"nottyrajat": " Britannia brand is mainly known for its quality and yes according to me Britannia 50 - 50 Biscuits is the best sweet and salty biscuits. I chose this particular brand of sweet and salty biscuit because of the Brand Britannia which is my first priority.Secondly when it comes to quality this biscuit is so tasty, non sticky and non oily. packaging comes as best to ensure the quality of the product comes pure and safe. price is too affordable for everyone when it is compared to other brand of biscuits.Every age group can enjoy as it tastes the best and nutritional contents also helps in balancing your diets. Best part of this biscuit is fat is too less. I am using this as my breakfast or evening snacks with tea for more than 5 years and I will suggest try this as it is the best!", "pritijain212323": " Britiannia 50-50 biscuits are very tasty biscuits?.I like it .i eat daily morning  and evening 50-50 biscuits.this biscuits? are very tasty and kurkura.tea? and coffee  ka sath khakar maja aaa gata hai monthly rashan main britinna 50- 50 biscuits Atha hai.this biscuit pacing are very nice. Its quality  is very  good.this biscuit  are very famous  in India.This  biscuit are advertisement  on television and network.very  good  products.iski price Sai hai.sasta or badia biscuit hai.so isa app bhi khay or khilya.birthday? Ho ya happy  new year  ya koi party? britinna 50-50 biscuits Lana or khana.thanks.", "shanerokz": " Britannia is a branded company and I eat their products since my childhood.they are the most sold brands in india.all the children love the taste and especially, britannia 50-50- biscuits are very tasty.It is very crunchy and yummy.the biscuits are very light and good for digestive system.overall, i loved these biscuits and recommend it.Britannia 50-50 Biscuits - Maska Chaska, 120 g Pack price just RS-25/- Only", "Nayak898337": " Normally I used to eat both types of biscuits sweet and salty but when I eat britannia 50-50 biscuits  and really like its taste.I firstly eat this biscuit when my mom brought this in my  16th birthday, and when I eat this I feel yummy taste.And from that day I daily used to eat this biscuit with tea, and make my morning happy and joyful.I like its quality and flavour, also.I also like its packaging in which type the biscuits were packed.I thank britannia to make my every day beautiful.I love this biscuit.", "Pawankalyan433": " I buy this particular product because I want to know the wether the biscuit is tasty are not and quality also and I have choosen this biscuit because it is cooked with butter and tsty salty biscuit which gives us a delight tasty and other brands biscuit is not like this because other biscuits are normally tatse and so not good I buy this brand and I prefer to all the age to eat this biscuit for healthy and delightness of taste .", "shailen3d": " When eat Britannia 50-50 biscuits  its is of  both types of biscuits sweet and saltyand I really like its taste.At  the tea time people may prefer this product those who don't like full salty or very sweetbecause this type of biscuits change the taste of  tea or coffee .I  prefer this biscuit with tea, and make my morning happy and joyful.I like its quality and packaging also.I also like its packaging in which type the biscuits were packed.I thank britannia to make  such wonderful refreshment.you may try this and will definitely like its taste", "bharatiapu": " I have brought a packet of Britannia 50 50 maska chaska.The details of the product are as follows: Product: Biscuit Brand: Britannia 50-50 maska chaska. LOT No:A0715G3 MACHINE CODE:101A PKD: 07/07/15 NET WEIGHT: 55g Please check the details mentioned and do not supply substandard products in the market.When eat Britannia 50-50 biscuits its is of both types of biscuits sweet and salty and I really like its taste..I had been trying this biscuit since my childhood and is still loving it.the taste gets filled in our mindsI firstly eat this biscuit when my mom brought this in my 16th birthday, and when I eat this I feel yummy taste.And from that day I daily used to eat this biscuit with tea, and make my morning happy and joyful.I like its quality and flavour, also.I also like its packaging in which type the biscuits were packed.I thank britannia to make my every day beautiful.I love this biscuit.", "amaljose764": " Britania's 50-50 biscuit is one of the best salty biscuit available in our market.50-50 was the rich quality biscuits available from my childhood.this biscuits has particular ingredients which make the biscuit rich in it's taste.now also 50-50 biscuits has not too much competitors from any cookie company.Britania is unique in producing this type of biscuits that no companies even follow this type of biscuits except parle's .but compared to crack jack, 50-50 biscuits are little more tasty and healthier.when I buy this biscuit I usually ate it alone the entire packet, that much I like this biscuit", "ROYALJAI": " Normally, I hate biscuits, chips and other such fad foods. You never really know what goes into its making, but you always get addicted to it, you cant eat just one. The model is deceptively attractive; although she wears an abundance of make-up, I fear she is mind-bogglingly beautiful underneath.But Britannia 50-50 Maska Chaska, is it just a biscuit? I am not talking about the normal variety, which I feel is a blind but pathetic imitation of the age-old Parle Krackjack. . I crave the 50-50. do not be fooled by its green speckled counterpart. It's a tricky one! the silver all the way. . I am referring to the green variety, which is a lot better innovation from the Britannia family. It comes in a silver and green glistening wrap. A pack contains some 20 or so biscuits. Great tasty biscuit, highly addictive, but not recommended to indulge on a daily basis.", "nikm18711": " One of my loving biscuit I really love its taste and the quality of the product every time I buy.As I starts to eat it the crackery sounds and the smoothness of the biscuits make me feel love with it.I m eating this biscuit from when I was small little kid till now the taste and the flavour of the biscuit has not changed yet it feels the same whenever I had eaten them.In a day I eat 2 pack of biscuits because I m truly loving it.I Thank the chef or the maker and the entire team of the 50-50 for making this Awsome quality of Biscuit.I LOVE U ALL. THANK YOU SO MUCH", "Deepanshu2": " I AM EATING BRITANNIA SINCE I WAS A CHILD AND TEST OF THIS BISCUIT IS NEVER CHANGES I ALWAYS USE TO EAT THIS BISCUITS WITH TEA AND COFFEE IT GIVES ME A VERY GOOD COMBINATION OF BISCUITS AND TEA . AND THE MOST IMPORTANT THINK IS THEY  ITS BUTTERY TASTE THE TASTE IS AWESOME .MOSTLY I EAT THIS BISCUITS WHILE STUDYING AND  WATCHING TV OR MOVIE IN MY COMPUTER . USUALLY I EAT THIS BISCUIT  5 TIMES IN IN A WEEK . AND PRICE OF THIS BISCUIT IS ALSO GOO YOU GET SMALL PACK IN 5 RUPEES AND BIG PACK IN ABOUT 10 RUPEES OVERALL GOOD BISCUITS . AN HAS A GREAT QUALITY OF PACKAGING .", "deepbf24": " Variety is spice of life and this best suits for food….the more the varieties the more the options to choose on….Due very unhealthy lifestyle habits, we always think to get indulge in things which keep us fit and going….As we can see there are lot of options even in snacks, which you can munch on to satisfy that untime hunger rants without gaining that extra kilos. After it’s huge success with Britannia NutiChoice Multigrain Thins and NutriChoice Multigrain Roasty, Britannia has come with another interesting concept of snack flavoured biscuits called “SNACKUITS”….isn’t it yummy? Snackuits comes with a tagline which says – ‘snacking ka mazaa biscuit mein’….which means you get the taste of snacks in the biscuits….that too guilt free as these are baked, no Transfat and No MSG….I know…you have said wow right?….you have read it right….an guilt free snack flavoured baked biscuits.Snackuits come in three International Gourmet flavours, viz, Swiss Cheese &amp; Chilly, Chinese Hot &amp; Sweet and Italiano Pizza. It’s like world flavours sealed in a packet waiting for you to gratify….how good is that? Britannia has not only revolutionised the snack world but also kept in mind the changing trends of snacking habits along with flavours which are common all around the globe. An ideal snack for tea time gossip among teenagers who are wait watchers too….and the brand also concentrates on housewives, where this snack can be served at there kitty parties or at housewives adda….just to make the conversation more flavoursome….The brand celebrates the self assured, witty, unconventional side of housewives. 50-50 believes the housewives can be fun and have an easy happy relationship with ‘life’ &amp; not a serious or contentious one as they are often stereotyped to be….Just a way to make snacking interesting for all…", "RAKESHBOSE": " Britannia 50-50 Maska Chaska is another variety flavor from Britannia.It is flavored in the American Cream and Onion style.What makes these biscuits unique is the seamless blend of mild spices and salt along with a pinch of sweet flavour in them.This combination of flavors additional to that pinch of sugariness makes the Britannia 50-50 Maska Chaska biscuit mouth wateringly delicious and tasty.My 2 year old son and my grandma very much like this biscuit.:means it is perfect for all age groups. I think it is good in Calories and good taste than other similar products.Also we can get much more quantity at this reasonable price.", "akshayreddykancha": " Dear Team, I have brought a packet of Britannia 50 50 maska chaska. The taste of the biscuit was extreemly bad. The same has been confirmed by my 4 colleagues. After consuming few pieces I did not take it. Few minutes later I got stomach ache. The details of the product are as follows: Product: Biscuit Brand: Britannia 50-50 maska chaska. LOT No:A0715G3 MACHINE CODE:101A PKD: 07/07/15 NET WEIGHT: 55g Please check the details mentioned and do not supply substandard products in the market. Now who is going compensate the pain that I am bearing. Please assist in this regard.", "biswas260": " This is a very old brand.The freshness and crispiness we may will not get from any other brand.Britannia biscuits are very tastier an healthier. Test is very decent, crispy, light weight biscuit.Good quality product with great quantity too.Biscuit is square shaped and mixture of sweet and salty its very crunchy. It gives perfect test with tea any time It gets swollen very fast.Price is also reasonable as compare to other biscuits manufactured by BRITANNIA company", "joyanaranha": " Britannia 50 -50 is one of the popular biscuit in India. I am eating it from so many years and never lost its utility because of its taste.The main thing Why I buy this biscuit because its really cheap. We will get at Rs.10/- which is really worth. We will get 2 packets of rs.5 each. The quantity is much which we can use it for 2 days for cofee. And also we will get energy to work in the mofning.This biscuits are very light esdily we can break it. And also sometimes we will get offer of 20% extra by that we will have more advantage. There marketing is trustable and packaging which they make is very good, which is in orange and light yellow color. We can keep so many days and there is no fear of going air from the packet because if we torn the packet inside there will again one more plastic package. Overall its a best biscuit to eat Specially in the morning.", "heavyreviewer": " The best biscuits I ever had.it is very crispy and is enjoyable.the best a biscuit company an give you.I had been trying this biscuit since my childhood and is still loving it.the taste gets filled in our minds.the more you eat the more you get fulfilled.A tea time snack which is also rich in energy.Supplies enough energy for a heavy exercise too.best biscuit for those who diet to reduce cholesterol.the nutrition value is high which provides us enough energy.", "araj174": " Britannia is a branded company and I eat their products since my childhood.they are the most sold brands in india.all the children love the taste and especially, britannia 50-50- biscuits are very tasty, they come in a neat packing, squared in shape.The flavour is salt and sweet.they can be enjoyed in the evening time with tea or coffee.it is apt for trips, picnics, long drives etc., it is very crunchy and yummy.the biscuits are very light and good for digestive system.overall, i loved these biscuits and recommend it.", "sonu001": " I like this week because the disc is very nice and very testy.the quality of The Killers very good and also the price range is also very less.if you want to testy  biscuit because  the brand is very good and very popular brand from briatania biscuit.quality is also good from the britania the children like this very much I like  very much because theyFifty Fifty and very testy test. I I like this kid because of a test and crunch.I dislike just got off is limited flavour", "rampalrane": " I am eating Britannia 50-50 biscuits since I was kid. I don't know why but I am just fond of it. I especially about Britannia 50 50 is its sweet as well as salty taste and the crispy biscuits. That is why I usually buy them.The main thing is that the the price is moderate and affordable to almost to everyone and yes the taste is worth you'll pay. I like the design of the biscuits having nine holes in the biscuits. The taste is very moderate I mean neither much salty nor sweet its very tasty and suitable for all. The packing is air tight and looks great. Everyone can but this product and taste it with tea or raw and I am sure you'll like it. The hardness of Biscuits is very low, its easily chewable. This is a digestive product and very easy to digest due to its low fat content but don't consume it too much. The content of biscuits in pack is enough according to price."}], {"jinalthakkar49": " This biscuit has been able to grab my attention since my childhood. A very nice blend of salty and sweet flavor makes it different than others. Sweet, salty, crunchy biscuits are perfect for hungers at odd times. As made up of maida, these are not much healthier ones, but these are the ones which have the taste which can overcome this darwback.These biscuits come from the house of Britannia and hence a trust of user is easily obtained by the product.", "Mcoolgirl": " The fresh and crispiness we may wont get in any biscuit. This biscuit is really liked by many people fro long time, because of its crispy and decent taste.Even for small amount we ca buy this, but wont fill the stomach. It provokes us to eat more and more, you can try this.Taste is very decent, crispy, bit sweet and salt mixed flavor, light weight biscuit.Good quality product with great quantity too, good packing just decent and simple .mostly available in stores, bakeries, bazaars even inn small stalls.", "umardaraz": " Britannia 50 50 is a type of crakers from one of the famous brand of food products, Britannia. It has salty &amp; sweet taste . 50% sweet+ 50% salty. Ideal snack with tea. Liked by people of all age group. Product quality is very good, much better than biscuits from local brand . Product packaging is also good. Hygenically packed.Price Rs 10 for packet, so very cheap and easily affordable. It is crispy and delicious and contains glucose, so a good source of energy. The maska Chaka of Britannia is an excellent product which tastes likes a baked biscuit and has minty flavour.Impeccable tasted with tea at whatever time, anyplace. the main issue in this scone is when dunked in tea, its gets swollen quick. aside from it ENJOY IT.", "SUBRAT_1111": " I am having this britannia 50-50 biscuit since childhood.this biscuit has in market for long time and capture the market.the biscuit mixture of salt and opposite with every of perfect biscuit.Britannia brand known one of the trusted and valuable among indian consumer.i like its salty flavor biscuit.its salty, sweet and crunchy biscuit are perfect for hunger at odd time.I always having it with tea and coffee as snacks.i like Britannia biscuit for its ingredients. they are containing low sugar and less calories. Britannia brand make place for its customer across the country.finally its price is reasonable like other biscuit.i recommend britannia 50-50 biscuit to my friends.", "preetiarora": " Britannia is very old brand.Britannia 50-50 is healthier and tastier.Britannia 50-50 sweet and salty its taste is better than other sweet and salty biscuits and its a product of Britannia very popular and old brand.biscuit is Squared shape and mixture of sweet and salty its very very crunchy. perfect tasted with tea anytime, anywhere.Britannia 50-50 biscuits are one among the best snacks.This biscuit is really liked by many people from long time, because of its crispyness and good taste.", "Aman99deep": " Britannia is a branded company and I eat their products since my childhood.All the children love the taste and especially, britannia 50 -50 biscuits are very tasty, they come in a neat packing, squared in shape, the flavour is salt and sweet.They can be enjoyed in the evening time with tea or coffee.it is apt for trips, picnics, long drives etc, it is very crunchy and yummy. The biscuits are very light and good for digestive system. overall, I loved these biscuits and recommend it to all my friends.", "osman4friends": " Britannia biscuit is very tasty and is a  gr8 brand.The fresh and crispiness we may wont get in any biscuit.Britannia 50-50 biscuits are one among the best snacks.The Biscuit mixture of salt and the opposite with every of the perfect biscuits within the biscuit for including further taste you may add. journey and Journeys for gossiping, biscuits for a picnic to eat this type of love is one of the best biscuits.As per my view at least, I see the quality to be maintained through the years and it still tastes pretty damn good. Its very crunchy and salty.Perhaps it’s among the most sold biscuit by Britania along with Tiger biscuit. It’s comes with good flavor of salt and sweet . Price is also reasonable as compared to other biscuits been manufactured by Britania.Britannia is a branded company and I eat their products since my childhood.All the children love the taste of all the bisuits.", "arun14031994": " Britannia 50 - 50 Biscuits are one of my favorite biscuits. So my childhood this biscuits I ate daily 1-3 packets. This biscuits taste was some salty and some sweet.This biscuits are while eating mouth watering is there and no stops the eating. So this biscuits are very good snack item while watching a television this was good choice to pick this biscuits.This flavor was unbelievable. The Britannia product quality is too excellent.", "gs8851333": " I remember, from my childhood the biscuit mainly the 50-50 is the best one for me. I can enjoy its taste with tea and milk the most. Now its new chaskar maska flavor is just awesome.The leaf dust in the chaska maska increase the quality of the biscuit. Now a time very few biscuits are there who provides a good quantity in a low price . as in 5 rs packet your snacks get fullfill. Thats the main plus point of the biscuit. Its serves a chota packet bada dhamaka types thought. Not much heavy but still I satisfy by taking it as my snacks.", "abarna": " This is One of the best biscuits I suggest for my friends.Having it with coffee or tea is my favorite snack for the morning and evening break.It is better to have biscuits like this than to have other snack items because they are containing low sugar and less calories.Eating biscuits like this helps improving your digestion capacity.Stay healthy.Flavor is also good.Quality is best and good packaging.", "BhavinChotaliya": " This is a very old brand.The freshness and crispiness we may will not get from any other brand.Britannia biscuits are very tastier an healthier. Test is very decent, crispy, light weight biscuit.Good quality product with great quantity too.Biscuit is square shaped and mixture of sweet and salty its very crunchy. It gives perfect test with tea any time It gets swollen very fast.Price is also reasonable as compare to other biscuits manufactured by BRITANNIA company", "Kunali": " Britannia is one of the my favorite brand from the when I was taste 1st time when I was at 9 year old its 50-50 Biscuits .This product like it all of mine family membersBritannia 50 - 50 Biscuits Taste and Type of Flavors:Britannia 50 - 50 Biscuits offer many flavoers like 5050 SWEET &amp; SALTY, 5050 MASKA CHASKA,  The both of product taste is good.they both are Sweet and Salty is its mixed flavor are to good.Experience: Actually Britannia 50 - 50 my dad favorite his like to taste with tea on the morning so we all of family member take this biscuits with tea on morning.", "devaepisode": " Britannia is an organization that sells branded gadgets. The 50 - 50 Biscuits loves me a lot. The style provides me a lot pleasure. Offers a beautiful taste.The Biscuit mixture of salt and the opposite with every of the perfect biscuits within the biscuit for including further taste you may add. journey and Journeys for gossiping, biscuits for a picnic to eat this type of love is one of the best biscuits.Tea and low, which is nice to offer an extra style of candy and salt, combine with the very best biscuits.Me and my relations are on the Biscuit a lot. My youngsters a lot choose the biscuits. Offers a very good style of this very affordable worth.", "ananddubey94": " 92 Britannia 50 - 50 biscuits one of its kind, having the taste of both sweet and namkeen. the name implies 50/50 50% - sweet&amp; 50% salt. the biscuit is in the market since long and has captured market very well. birtannia had launched this biscuit in competation with Krack-jack and it did really well. the market capture was very fast. the biscuit is Squared shape and mixture of sweet and salty its very very crunchy. perfect tasted with tea anytime, anywhere.The only problem in this biscuit is when dipped in tea, its gets swollen very very fast. apart from it ENJOY IT.", "akashpatel825": " Britannia is a branded company and I eat their products since my childhood.All the children love the taste and especially, britannia 50 -50 biscuits are very tasty, they come in a neat packing, squared in shape, the flavour is salt and sweet.they can be enjoyed in the evening time with tea or coffee.it is apt for trips, picnics, long drives etc, it is very crunchy and yummy. the biscuits are very light and good for digestive system. overall, I loved these biscuits and recommend it to all my friends.I like this biscuit. .awesome taste.its really maska chaska: -) usually, when I meet ma friends, we used to eat this Britannia 50-50 biscuit. .we can easily pass our time. Its very crunchy, spicy.Its gives very good taste.its a perfect tea time item. .best combination for tea.We can enjoying eating Britannia 50-50 for sure.I really liked a lot.", "kanzariyakrupa": " I have been eating this biscuit since my childhood. I was some of those things that I always wanted whenever I went out with my parents. even today, I am in love with this in the same amount.its taste has not changed at all. its too delicious. its sweet and have some powdered sugar coating on the top which is awesome.now the brand \"britania\" is a household name and the most trusted. and this biscuit is only manufactured by this company.this biscuit need no age limit. it can be enjoyed all age groups.", "mickeycoool": " Britannia is recognized as one of the most trusted, valuable and popular brands among Indian consumers in various reputed surveys.We realize our responsibility to continue delivering fresh, nutritious and fun products and it is our mission to be an arm-stretch away, any time of the day.So, the next time you imagine the aroma of oven-fresh cakes, the tantalizing drop of rich chocolate cream on crisp, cocoa-brown cookies, the satisfying mouthful of crunchy biscuits or a sinful bite of melted cheese on freshly toasted bread, imagine Healthy Goodness.", "Manmath7": " Britannia 50-50 biscuits are one of the best snacks I have ever had.The square shaped, sweet and salty biscuits are a delight to have with tea or coffee.Its crunchiness is the most what I love about.It's crisp, well baked and uniquely designed.Whenever there's a long trip or a drive, carry these biscuits along with you.They are the best companion at such times.These biscuits have zero trans-fat, so no need to worry for health issues.Its ingredients don't have any harmful contents.only some added flavours, that too natural.It's a vegetarian product.Now, you can find some more varieties like 50-50 Maska Chaska, 50-50 Snackuits(with different flavours), adding to its quality.Other brands have also been good but the taste of Britannia is mind-blowing.It's no doubt the best brand for biscuits.and 50-50 is one of them.It's available in multiple net quantities(50g, 100g.) and at very low prices.You can't say a no for this product.", "pranab75": " At Britannia, we consider that there is a whacky side to each person - sometimes hidden, at other times overt, and this is what we have a good time with our brands 50-50. It is really tasty along with is a wonderful company. The fresh and also crispiness organic beef won’t be in any kind of biscuit and it is quality product or service having great volume too, beneficial taking simply good in addition to uncomplicated and Price is also reasonable in comparison with various other biscuits.Britannia brands 50-50 have carved out a special place in the minds of customers across the country due to its crispy as well as good flavor. Per my view a minimum of, I see the good quality to get taken care of as time passes plus it however likes quite really excellent.We are known Britannia is usually a top quality company and I used these products for long years. These biscuits are very dear to all kinds of people."}], {"kumarnarayana": " The Britannia 50-50 biscuit is very crunchy and sweet in taste and loved by mostly people my parents used to give me when I was a child to stop my crying so after having this kind of taste.I used to become very happy since then I started using it and still using I prefer this particular in with my tea and coffee time I also have other biscuits like Parle, Marigold but sweetness is much I prefer 50 - 50 so I go fo it rate is also ok", "KB_zala": " One day, one of my colleagues gave me some biscuits to eat. I found them very tasty and crunchy. I asked her the name of the brand and product.She replied me that it was Britannia  50-50. These biscuits have unique combination of sweet and salty taste.The same day, while returning from the work, I went to a provision store and bought two big packets. When the members of my family ate them, they too liked very much. Since then, it has been become a kind of tradition of our family to have these biscuits daily. We even serve our guests with these biscuits. My children like them a lot. Happily recommend this brand to all.", "manjari_12345": " We were enjoying the basic 50-50 crackers ever since I was growing up.We always have that crackers in our house. It was sweet, salty and crunchy.My entire family loved it, These cracker were so cheap and versatile.So we can keep it in our house for any number of days.It was one of the cookies which we always have on stock.So I was pretty confident in writing about this cookies. When we take our first bite into each cracker we can easily identify the flavours.Not like some other stuff that says it is ‘this’  flavour and when we eat it we don’t find anything. These crackers are so crunchy which is perfect to pile it with some salsa and have it.You can have it with any of your favorite dip.", "naveen8055theboss": " Britannia 50-50 is hot n spicy crackers. These crackers are so crunchy which is perfect to pile it with some salsa and have it. it is the perfect accompaniment with milk or tea or coffee. When hunger pangs strike, reach for a pack of Britannia 50-50 Maska Chaska Biscuits.Perfect for all age groups. These give an tantalizing taste to your taste buds……in one bite hot with spices….and in next cooling you with sweet taste…a well balanced mixture of both the taste, A flavoursome combo which you can munch on and on. my favourite one in the three.Try it…", "Ghazala786": " Britannia 50 50 is a type of crakers from one of the famous  brand of food products, Britannia.It has salty &amp; sweet taste . 50% sweet+ 50% salty.Ideal snack with tea.Liked by people of all age group.Product quality is very good, much better than biscuits from local brand .Product packaging is also good.Hygienically packed.Price  Rs 10 for 80 gms pouch, so very cheap and easily affordable.It is crispy and delicious and contains glucose, so  a good source of energy.The maska Chaka of Britannia is an excellent product which tastes likes a baked biscuit and has minty flavour.", "leenabhatia1604": " Why I Brought Product of This Brand?Britania is one of the oldest brands of bakery products. This brand has earned its name due to its high production standard and tasty food items. I trust this brand as it is treating me from my childhood. The products of Britania are not just good in taste &amp; flavor but attractive in appearance &amp; packaging as well.The 50-50 biscuits of Britania is one of its best, no one can ever compet it. The unique blend of sweet and saltiness which Britania has come up with this biscuit is what everyone likes. This biscuit is light, crispy, tasty, good in aroma and an excellent option to have with tea.Alternatives That Came In My Mind While Buying It:For me, no brand can ever even stand in front of this biscuit. It is surely better than monaco, snacks and all the salty-sweet biscuits that are trying to compet this one.Who Should Buy This Brand? I think everyone should give it a chance and buy 50-50 biscuit of Britania brand due to: -company focuses on hygiene-Crispy biscuit-Tasty biscuit-Biscuits have attractive aroma-Light and low in cholestrol-Attractively packed-Multi layer packaging-Low prices", "knockaround": " I like to eat biscuits a lot. Usually I do it desi style. Dip into tea and munch it. This one is my favorite. This is good timepass.You can eat it with chai or without chai. You can have two packets at a time. Not more than that. Its best to share with friends.Best for ladies arranging kiity parties:) Little salty and little sweet.the taste is superstar. But, I warn you you need to drink lot of water after eating it. So, better you have it with tea.thats the best option I can suggest. 50-50.love you.", "suji1234": " I like this biscuit. .awesome taste.its really maska chaska: -) usually, when I meet ma friends,  we used to eat this  Britannia   50-50 biscuit. .We can easily pass our time. Its very crunchy, spicy.Its gives very good taste.its a perfect tea time item. .best combination for tea.We can enjoying eating Britannia 50-50 for sure.I really liked a lot.", "sachin_wadekar100": " Britannia is a good brand in market from a very long time and their products are very good and healthy.Britannia 50-50 is a suared in shaped and salty biscuits. They are not salty that much and not sweet also .To compete against Parle's Krack Jack, here comes britannia 50-50.Its taste is similat to monaco in taste and Krack Jack in shape. It is mixture of sweet and salty. It is light and we can eat it any time.This combo makes biscuit unique.This is good with tea and it is easily melt in tea and water also.The price is affordable to everyone and You can take it from any local store near by you.Overall it is good and healty for all age group people.", "Aditya_Jha": " Britannia 50-50, salty and tasty, a product that has been around for many years now. As per my view at least, I see the quality to be maintained through the years and it still tastes pretty damn good.Take it with your early morning tea or with cold drink in the evening - it's a great refresher and costs just about Rs.10 and around that(depending upon pack).Britannia is a brand that you can trust which makes the product a favorite among it's consumers and they've become loyal to it through the last many years.", "sonaanto": " I love, love, love and there are lotss that you will find in my cupboard to enjoy whenever I want .This is one of my favourite biscuits which I will quite often I have when I am bored .This biscuits is been for ages and it is still the favourite for many on the earth.A single pack of biscuits have about nearly 5g of proteins and 45g of carbohydrates.Any time you have 50 50 you have chance of getting something right.My favourite low calories biscuits which is very light and is famous among all ages", "OnlyTruthSpeaker": " Perhaps it's among the most sold biscuit by Britania along with Tiger biscuit. It's comes with good flavor of salt and sweet . Price is also reasonable as compared to other biscuits been manufactured by Britania.I have been using it for past 10+ years, enjoy having it with tea or coffee. I prefer carrying it along with me while traveling to outside or going for long journey as eating all the junk foods does creates so many issues. Good for all age of people even children do like it a lot.", "tbzala111": " Britannia is a company that sells branded items. The 50-50 Biscuit loves me so much. The taste gives me so much joy. Gives a wonderful flavor.The Biscuit mix of salt and sweet tomato sauce and the other with each of the best biscuits in the biscuit for adding extra flavor you can add. travel and Trips for gossiping, biscuits for a picnic to eat this kind of love is the best biscuits.Tea and coffee, which is good to give a further taste of sweet and salt, mix with the best biscuits.Me and my family members are at the Biscuit much. My kids much prefer the biscuits. Gives a good taste of this very reasonable price.", "shashikalawadekar": " Britannia is a good brand in market from a very long time and their products are very good and healthy and also tasty in nature.This is one of the good brand and It will melt easily in tea.Britannia 50-50 is a suared in shaped and salty biscuits. To compete against Parle's Krack Jack, here comes britannia 50-50.Taste is similar to monaco and Krack Jack in shape.This biscuits different from other biscuits and all people will like when they eat.It is light and we can eat it any time.You can say this combo makes biscuit unique.When you are hungry and If you can make tea then buy this from store and eat it with tea.This is good combination which I always do.The price is also affordable to everyone &amp; It is available in all local stores.It's quality has no issue and best.", "ap9924": " Britannia 50-50 came when other famous brand Parle-G was leading in market, but due to it taste(which is 50% sweet and 50% salty) this biscuit can able to give competition to Parle-G at that time.One of the good point about this biscuit that its very light and so good in taste i.e. mixture of sweet+ salty. This combo taste makes this biscuit unique.I also used to prefer this biscuit over other sweets biscuits due to its 50-50 nature.Now if you consider the price then I must say in this price this product is quite good.But one thing I noticed about this biscuit that its size become more thin and that why many time I get broken biscuits inside the close packet also.Here I would like to suggest that please don't decrease its quality if you want to manage the current price then you can decrease its quantity but please done decrease quality as product always known for its quality only.", "saikumar843": " 50-50 biscuits are crunchier will make me to eat again and again. Everytime I open this pack will share 2 or 3 bics with my mates the rest of all had by me.The maska chaska version of  50-50 taste like a baked snack. Britannia was the leading biscuit and cookie manufacturer among India almost all the biscuits made by Britannia taste soo good. 50-50 can be ate along with the tea. the 10rs. pack comes handy so that if I am hungry while travelling I will take this pack and have it.", "skkedia": " When it comes to biscuits, no one can beat Britannia biscuits except for ParleG. Most of the biscuits of Britannia are simply too good. I like 50-50, Good day cashew, Bourbon biscuits.50-50 biscuits as the name suggests has twin taste in it. Its 50% sweet and 50% salty.the combo taste is unique and too good. The Biscuits are light and can be had anytime with or without tea/ coffee.they are just too delicious!Price: 10/- for 100 gms. I just love them.", "VijayBharati01": " I have been eating Britania 50-50 biscuits from my childhood. And I can clearly say that the taste varied along with the progress of time.In back years it had such a unique taste because of a salty outer layer with sweet inside but for about 8/9 years, the taste is not the same as it had back then. It is now more sweet than salty.Pros:Light weightCheapCons:More sweet than saltyEven though it has lost its original taste, I still have them occasionally. The Maska Chaska is a better option for people who like Salty biscuits.", "stylishvishal2": " This biscuit is the best biscuit with the salt and sweet combination everyone loves to eat this kind of biscuits best biscuit for the trips, picnic, travelling and also for gossiping you can also add a extra flavour to this biscuit by adding tomato sauce.And any other ingridients to give a much more taste this biscuit is also a good for tea and coffee which you can simply take tea with a salt and sweet combination biscuit and refresh your mind with such an amazing taste after all this biscuit is a best biscuit with sweet and salt combination.", "drjyotiphd12389": " Britannia 50-50 are kind of combination of sweet and salty biscuits. It is also crunchy and yummy biscuits. The biscuits comes in square shape and packed with green wraper.Britannia is creamy and crunchy biscuits.I enjoy them with my daily tea, coffee and milk also.Britannia was the leading biscuits and cookie manufacturer among all the india's almost biscuits manufacturing.The taste of the biscuits is awesome.This is having totally different taste which makes it special and I just love to eat special and unique things."}], {"poo134": " This biscuits are very sweet and salty too.I used to eat these at evening with tea. Because of salty test I can eat more and more 50-50 biscuits. Quality is best.. krack jack biscuits are also little bit same as 50-50 but test of 50-50 is good. I like it most.Price is so less. Now, we can buy it for just Rs.5 also. I like these very much 'namakin biscuits.  Sweet and Salty.", "indranidasdeoghari": " Although Britania  named the Biscuits as 50-50, I like to call it packet full of taste, flavor and lots maska chaska. Its a hybrid in between Cookie and cracker. Not too salty not too sweet and crunchy enough that make you feel refresh. Its green pack also give you are eating a refreshing Biscuits.I love the taste of the biscuit. Its my best friend when I Travel, when I am having a cup of tea at office.I can eat with any drink and always wish that the packet should be large enough that never finish. I am crazy for this biscuit. I cant compare this biscuits with any other biscuit.Its just different . Try it once and thanks to Britannia for making such so crunchy, taste and never ending biscuit.But please make the  pack with some extra biscuits .", "awonibano": " Britannia 50-50 biscuits offer a combination of sweet and sour taste. These square shaped biscuits with tiny little holes in them are a complete time pass. They have been since very long and taste quite similar to Parle's Krackjack.Now-a-days, there aren't really many advertisements of these biscuits, but earlier when  it was launched, they broadcasted one of the funniest ads on TV. The biscuits are crunchy and have a great shelf life. Even if you keep them open in the air, they don't really attract moisture quickly, unlike other biscuits.50-50 has a very buttery kid of taste. It's creamy and crunchy. I enjoy them with my evening tea or coffee. The packaging is funky too, in a green and silver packet. The price is nearly the same as most of the others.", "Nidzonidhi": " I am not really fond of Biscuits . I only like chocolate biscuits that too very few of them. But when it comes to 50- 50 biscuit, it is different. Salty and crunchy. Best snacks to accompany with tea for breakfast and evening snacks. When ever I feel hungry in odd time and have nothing to eat, I go for 50-50 biscuit.Best part is it is very cheap. We get a good amount of quantity in very less price. it has this salty and crunchy taste when dipped in tea, it enhances . Good for all.", "atharv1430": " Britannia 50-50 biscuits offer a combination of sweet and sour taste.I like to call it packet full of taste, flavour and lots maska chaska. Its a hybrid in between Cookie and cracker.When ever I feel hungry in odd time it recovers my energy.If you are choosing Britannia 50-50 you will have the totally different experience. Cost is one rupee extra(Rs. 8/- per 75 gms) than normal 50-50(Rs. 7/- per 800 gms.), but it is worth spending a rupee extra for that awesome taste", "kulkunde": " Voorhees likes it.  maska chaska!!! podhum.  they're AMAZING.  ooooooh my gooooodness.  a good hybrid between a cracker and a cookie.  (manchandra)  not too sweet, not too savory, crispy yet not salty.  in a vord, voorhees.  I crave the 50-50.  do not be fooled by its green speckled counterpart.  It's a tricky one!  the silver all the way. The model is deceptively attractive; although she wears an abundance of make-up, I fear she is mind-bogglingly beautiful underneath.  voorhees is not a lesbian.  these are objective comments.  do not judge poor voorhees.  she is simply telling the truth.", "jaideepkhanduja": " Found this new entrant of 50-50 family from Britannia quite tasty and hence could not stop myself in sharing it will you all.Cost is one rupee extra (Rs. 8/- per 75 gms) than normal 50-50 (Rs. 7/- per 800 gms.), but it is worth spending a rupee extra and taste it and I can bet you just can't eat once. Yeh Dil Chahe Moreeeeeeeeeeeee.Two main ingredients that make this biscuit super tasty are - Sesame seeds(white til) and Black Pepper.Shape is same as 50-50 normal variant, taste is extra ordinarily manifold. Packing is attractive.if you eat one packet you will get:Carbohydrates -  45.75 gms per 75 gms packProtein - 6.15 gms per 75 gms packFat - 18.75 gms per 75 gms packEnergy - 372.75 kcal (killo calories) per 75 gms packGo, get it, don't think and eat it, not all in one go because after all it contains maida and oil too.But taste is masha allah, lajwaaaaaaaaaaaaaaab.", "caforservices": " Britannia 50 - 50 biscuits one of its kind, having the taste of both sweet and namkeen.The name implies 50/50 50% - sweet &amp; 50% salt. the biscuit is in the market since long and has captured market very well. Britannia had launched this biscuit in competition with Krack-jack and it did really well. the market capture was very fast. the biscuit is Squared shape and mixture of sweet and salty its very very crunchy. perfect tasted with tea anytime, anywhere.The only problem in this biscuit is when dipped in tea, its gets swollen very very fast. apart from it ENJOY IT.", "hermit": " What is in Biscuit? - Does it sound to be \"Latin\"? Bis means Twice and Coctus means Baked. Hence “Biscotti” transformed to Biscuit. You may call it cookie, sweety / salty thin flour wafer etc. Just like the cast / creed, sects existing among human beings, you will come across blonde, dark, brown, salty, sour and sweet and another zillion varieties of biscuits across the globe.At times, it carries the dollop of gooey and syrupy cream or at times it will manifest as in a raw form of baked flour without any taste or odour. It is a unique food item that will be served to you and your doggie. In short, there is a bit of biscuit in everyone’s life.  When Roman Chef Apicus invented the forefather of the modern day biscuit, he might not have even thought of the metamorphic and cataclysmic mutation that is going to happen to his brain child.Why 50-50How to choose a biscuit? Well, answer is very simple. Choose what is good for you and do not worry much about the ingredients. Obsessive compulsive calorie consciousness could be a stumbling block while exploring variety but still some general principle I follow –Diet FriendlyIt shall not kill the appetite. Some biscuits can derail your metabolic activity that might trigger the acidic imbalance and finally you will skip your meal. Side effects and long term health hazards are many. As we are all having a unique biological system, trial and error is the best method to arrive at your decision. Anything carrying nut, cream, chocolate etc. could be detrimental to me.Value for MoneyDo not pay for the packing but for the content. You can spend Rs.110/- for the Honey and Oats Biscuit from Cafe Coffee Day and own the fancy cylindrical shaped tin. Well, it is not your main course or it is not vital or essential food and hence do choose the one which will offer you best and diet friendly productWell, I got the answer in 1993. At first it was “Little Hearts” from Britannia came in pouch packs. It has got multiple utilities also like presenting a little heart to the girl next door can be the most docile way of expressing your puppy love. But again it melted so fast and the syrupy taste was not appealing for long. Well, still “Dil Sab ka actually sweet hai”Finally I got acquainted with 50-50 from the same brand. It came in a simple and humble pack and never professed to offer anything more. It melts with a gentle speed but provide a taste that last for a while. We feel like having a biscuit but it never fill your stomach. You can have four to five but still have a peaceful life without acidity or vociferous burps.Revolution in Cracker FamilyThere could be more reasons why this INR 5 pack of biscuit became my best packaged food for long. I had a couple of biscuits belonging to cracker family (50-50 is belonging to this variety of biscuits which is simple in composition, mostly flour, water and any sweetening agent. It is inexpensive and long lasting and is usually used by those who are engaged in expedition, military troop in action, sailors). All of them were good enough but in our country, the real revolution happened when a value added cracker product is introduced which appeals to mass. In a way, this product silently eradicated the stigma associated with an “inexpensive” product. No wonder, they still hold one third of the market share in this segment in the countryProduct StabilityOf course, they have ventured into a niche market of hardtack variety which is considered to be down market. But for the last sixteen years, this is one product where in the company did not have to venture into product modification or marketing strategy. In the year 2001, they have come up with the first variant “Maska Chaska” and even this was widely accepted. Again, it is not a major variation from the existing vintage product. Here you can find the “cracker” having some features of “cookie”Taste I tried to read the ingredients description in the packet and came to know that they used to add sesame seed and pepper along with sweetening agent, diary components etc. It melts so soon but still in a moment’s time, you will get to feel the sweet, salt and the taste of some herb (that is filling the docking-hole of the biscuit). It is not like any other variety that offers a uniform taste. It is so gentle but distinct. To sum up, you shall not be an analytical champion when it comes to choose a biscuit. At times, familiarity can breed contempt. It is like \"know biscuit and no biscuit\".  But often the gut churns when we identify something unique and appealing. I am having a penchant towards earthy and simple stuffs and here I got this companion. So, what are you waiting for, let us have a cup of tea and cracker!", "swtneha31": " Hi all,When I was a kid from school snacks and brunch was not in fashion and we only had biscuits and tea or milk for our snacks. I always liked munching all the timeThat time we sometimes had Krackjack. A similar biscuit was evolved that time named as 50-50. I really loved its taste very much. Its little salty little sweet taste and crunchiness is the USP of this biscuit. My family loved it a lot.Now after marriage I don't get this biscuit here in my locality so I have Horlicks biscuits with my tea. But the taste of 50-50 is incomparable.", "Aniket22": " When we think of Biscuits we Think of some sweet cream ones or some cookies to enjoy during tea time. But this are something diffrent. britannia 50-50 are kind of combination of sweet and salty biscuits. They tastes best with tea or can be served separately.The are kind of square in shape with holes on them:D", "pankajparihar08": " Britannia 50-50 biscuits are in market from a very long time. 50-50 are squared shaped salty biscuits. actually they are not salty much and not sweet though. they are mixture of both with crunchiness.they are so light and can eat anytime. and tastes perfect with tea. in evening.(i usually do the same)Taste wise its just awesome. and its taste is something different when you compared with other biscuits available in market. thats why its name is something different.The small pack of 50-50 comes in Rs 10. so reasonable. But dont know why when I start eating it. I finished the pack in one go. and then I feel that. I eat the whole pack. I want more. may be this happens because the biscuits are so light.Eat it. Crunch it. Enjoy it.", "simranxyz": " Normally, I hate biscuits, chips and other such fad foods. You never really know what goes into its making, but you always get addicted to it, you cant eat just one.But Britannia 50-50 Maska Chaska, is it just a biscuit? I am not talking about the normal variety, which I feel is a blind but pathetic imitation of the age-old Parle Krackjack. I am referring to the green variety, which is a lot better innovation from the Britannia family.FlavorThis biscuit is so light, thin and flaky, it just melts in your mouth. The taste is something between sweet and salty, but there is some other flavor to it that is quite appealing. Some herbs they add to this biscuit and appears in it as green speckles is giving this biscuit its cutting edge. So addictive is this biscuit that you no have to worry about storing the pack, once it is opened.Health WiseWell, unless you are health conscious, I recommend you not to read the nutritional information on the cover. 100g of the biscuit contains60g Carbohydrates,7.8g Protein,210mg Calciumand a whopping 27g FAT.......That means 1/4 of what you eat goes directly into your fat cells. Maybe thats what makes them so tasty.IngredientsHere is a list of other ingredients in the biscuit.Wheat flourEdible Vegetable OilsSugarLiquid GlucoseLeavening agentsButterMilk &amp; Milk ProductsSaltEdible Vegetable Product (?)CalciumDough Conditioners (E-223, Enzyme)Added flavor (butter)Permitted Antioxidant (E-320)PackagingIt comes in a silver and green glistening wrap. A pack contains some 20 or so biscuits.VerdictGreat tasty biscuit, highly addictive, but not recommended to indulge on a daily basis. Keep this biscuit handy for those times when hunger or your boss strikes. You can tame both of them with it.", "tanaykochrekar": "  Shortest Commodity Reviews:  Britannia 50-50To compete against Parle’s Krack Jack, here comes Britannia 50-50. It’s not only sweet but kind of salty as well, so it goes on the lines of Monaco in taste and Krack Jack in shape.This product, if you’ve eaten Monaco Biscuits first tastes very bland. Since it has a very low density, it gets swollen when dipped in hot tea/coffee and breaks off fast. That’s really irritating for a general biscuit fan.Recently Britannia 50-50 held a Lucky Draw competition in which the first prize was Iphone.", "Addy_Ahmed": " Whenever the name Biscuit comes, our mind thinks about something sweet and soft. But this is not true in all the cases. If you are choosing Britannia 50-50 you will have the totally different experience. Its not sweet and soft at all like other biscuits Instead it is crunchy and salty.Whenever I get bored with sweet things I prefer to eat this biscuit. It is quite Crunchy and Salty which differentiate it from others. This is having totally different taste which makes it special and I love to eat special and unique things.", "naavisrock": " Britannia named this biscuit 50 50 because its having 50% salty taste where as 50% sweet taste. It a great combination, it is a perfect snack with Hot tea or Hot Coffee or Hot Milk, just eat like that or little bit dip in what you are drinking than eat it. Not too much dip, because it is verfy soft yet very crispy but smooth also. Can easily eat elder age people even small kid who have just one teeth. We can make delicious cake with 50 50 biscuits by just crushing them with your hands. and mix sufficient milk, dry fruits, and keep it in freezer. Than take it out after half an hour, your salty and sweet cake is ready to grab.This is such a tasty biscuits can eat just like wafers also. For 60gram pack, just spend to 10 rupees. Nice and smooth pack."}]