[[[[[[[[[[[[[[[[[[[[{"Slcmounika": " One of the most popular brand in biscuit and cookie world is britania. Especially good day is very delicious and healthy bicsuit. These biscuits are made up of wheat flour. The quantity of other ingredients and food saftey measures are very good. Good day has wide range of flavours like butter, cashew, badam pista, Choco chips etc whatever is the flavour it maintain its quality standards. I like good day biscuits and cookies very much. Even it starts from lower prices itself. The 5 RS pack contains 6 biscuits. And it is very easy to carry. It is so soothie and very soft to eat without any crumps. And it will digest easily as it is made up of wheat flour. The product quality is very good the packing is hygiene and the product inside the pack won't degrade early. Good day has its taste in every bite and when ever I eat this I never forget the flavour and taste of cashew in each bite. When ever I am felling depressed or frustrated I eat this biscuit because it changes my mood and my favourite flavour is cashew nut. I highly recommend you guys to taste it at least once in ur life.", "Priyanka108": " Hello I am priyanka and I am writing my personal experience about with a review a Biscuits this named Britannia Good Day Biscuits.This biscuit is so testy and delisious.Britannia is one of the standard company in manufacturing of biscuits all over the india and the other different countries.Britannia good day biscuits are one of the sweetest biscuits among all the biscuits.The smaller joys of life that can brighten up one 's life every day often get ignored in the pursuit of larger joys .Good day will act as an enabler in enjoying all those small movments in every day life .The good day biscuits are available in the form of different types like Cashwes , choco chunkies , better cookies , nuts cookies , chocochip and choconuts. Britannia good day biscuits are one of the largest selling biscuits now a day .So friends bought this biscuit and eat it so testy. So guys read my review and rate me.", "krrish4444": " Britannia Good Day Biscuit has more than 15years of TrustIt Has Trust in Taste and FlavorIt Consist of Kaju which is Good for HealthSo It is the wonderful product which is more addictableIam always eat it at journey and in Cinema IntervalThe Flavor of this product unforgettable once you eat you will know the huge taste of Britannia Good Day BiscuitIam Biggest fan of this Britannia Good Day Biscuit I hope you will also became a fan of it if tastethankyou.!", "yogespalariya": " Hello friends I am using Britannia Good Day Biscuits. It is really a very nice product of Britannia. Its Flavor gives you real test of cashew or butter. When I eat it I feel real the test of real good butter and cashew flavour. It a brand of Britannia, any one can trust on this company. It gives you best Quality Biscuits. All integrants are used in this biscuits is very good quality. every one can eat this biscuits. Britannia Good Day Biscuits comes in a very colorful packing. It gives you a very attractive packing. Finaly its good product.", "rashig73": " The packaging is marvelous, and it yummy biscuit. The flavour is delicious and I can eat a whole pack of biscuit in one time. The ingredients are pistachio, cashew which are rich dry fruits, that gives a yummy taste to biscuit. The price is also not so high, seeing its ingredients, quality and taste. I love this biscuit to eat a lot.  The packaging is also of good quality and one is attracted to buy it, by its packaging.", "annurajreddy": " Britannia is the best ever brand in the fields of the biscuit. Good day which is from this brand is of awesome taste from the day it entered into the market. In every bite the flavor will be same and awesome. The quality of the biscuit is out standing we can feel the dry fruits taste in every bite. We can just tempt to the biscuit by just seeing its pack. Packages are available in several sizes. Good Day brings a lot of goodness in the taste and the mood.", "narendraprataps98": " I'm using britania good biscuits regularly.not only my nephews and adults members of my family is crazy for it.Good day gives us the taste of butter, peanut and badam in its every bite.The composition of all the ingredients in right proportion thats why we can fell the taste of each ingredients.All the sources like -protein, fat, energy, carbohydrates are present in definite amount.All these ingrients makes the good day quality product.and thats the reasons why most of us prefer good day with water and tea also.The packing of bratania good day is done nicely by the workers.", "vikaskumar31292": " This is very tasty n yummy biscuit. It is full of rich quality ingredients like pistachio, cashew nuts etc. Its pakaging is very gud. I can eat this biscuit at any time full packet. It melts into my mouth and very smmothy in taste. its really awsm. Every people can try these biscuit. Its price is very much worthy at relevant pricing. No biscuit can be compared to this biscuit as it is the best biscuit sold in india.", "saritaahuja": " From childhood to till now we start a day  with GOOD DAY BISCUITS.Rich  in recipe.  the  Good Day  has  been popular among masses  with its  bite and taste . In addition Britannia   has used  ingredients like  cashew, pistachio  and  chocolate  to add spice to it brand.Good Day  biscuit  has now many variants  such  as   Butter, Cashew, Pista, Chocochips, Choconuts .A day is never thought to start without a good day biscuits.", "chauhannandita80": " Britannia good day biscuits are one of my favourite biscuits . It tastes very delicious. They come in variety of flavours like pista cashew butter etc. Pricing is according to there flavours. They have maintained the quality of there biscuits. All flavours are my favourite but pista flavour is the best. Its packing is also done very well. these biscuits can be eaten without any tea or coffie with it. Some times I eat it as a desert after my meal.", "dayanandg3": " I have literally grown up on these biscuits and I still continue to to enjoy eating them!The fact that they are so yummy and filled with cashew &amp; butter make them the easiest buy for me! The biscuit has maintained its great taste shape and colour through all these years!This consistency makes me loyal to them!The biscuits can be eaten straight out of the pack however if you have a hot cup of tea and you dunk the Good Day in it, that takes it to a whole new level of goodness!Besides the Britannia good day is so affordable and easily available, make them my favourite!Enjoy the Britannia Good Day everyone!", "Kum21": " Hi, friends. Everybody knowns and taste Britannia Good Day Biscuit. I share my personal experience about tastie biscuits. It comes in various flavours like butter bite, cashewnut, almond etc.I prefer cashnuts flavour it's taste awesome .I always eat small pack of Good Day biscuit with my tea.It comes in various size . I carry 10Rs biscuit in my purse .If you starving it satisfied you hunger in few minutes.I recommend everyone taste Britannia Good Day biscuit. You feel good after taste it.It is a good quality product.I like product packaging too.", "tejurana": " Hi all, Britania good day biscuits are very delicious biscuits. It feels premium and crunchy in every bite. You get flavours . I personally like the butter cookies. It is the best breakfast you can have with a cup of tea. When having with tea it feels really soft and melts in the mouth. Whenever guests come to our house we serve them with these premium cookies and they enjoy it.  I would definately recommend these cookies to everyone as its super delicious. When you are hungry in office you can munch on these bisuits and feel full .", "nagadi7021972": " Hello friends, I am purchase Britannia Good Day Biscuits from 5 years because it is very testy and healthy and flavor is very good.  Britannia company biscuits quality is very good,  Company using better quality of rapper paper for packing.  It attract customer to purchase this product, company give different range of product  dry fruits/Butter flavor company target all range of the customer according there  test. Overall good biscuits.", "kkqa1978": " Hello friends, here I am sharing the my personal experience with the britannia good day biscuits. This is best ever biscuits for the tea time and we are all love this. Whenever my husband comes from the office, we are serve this biscuits with the tea. The flavor is as best in the all other biscuits available in the market. Now this make our daily consuming item because its quality is very good and having very attracting packaging.", "kkrcbk1995": " Britannia is one of the standard company in manufacturing of biscuits all over the India and the other different countries.Britannia goodday biscuits are one of the sweetest biscuits among all the biscuits.The smaller joys of life that can brighten up one's life everyday often get ignored in the pursuit of larger joys.Good Day will act as an enabler in enjoying all those small moments in everyday life.The Good Day biscuits are available in the form ofdifferent types like  CASHEW, CHOCO CHUNKIES, BUTTER COOKIES, NUTS COOKIES, CHOCOCHIP, CHOCONUT.Britannia good day biscuits are one of the largest selling biscuits now a days.", "amitzuas": " Britannia good day biscuits are very tasty and yummy. I have tried several flavours and all are equally good, tasy and nutritious. My favourite is Pista badam as it contains chopped pista and badam. They uses wheat flour, edible vegetable oils so they are good for any age group I eat almost whole packet with tea. The only drawback is that you can not eat them alone because they are quite dry and you need tea or coffee to have them and I find it very tasty to have these with tea. These are much better then other local biscuits and cookies and are easily find in the local market because they are very popular. 4.5 out 5 from my side.", "vsntlxmn": " Britannia good day biscuits are very tasty and yummy. I have tried several flavors of Britannia Good day biscuits, all are very good. Very tasty and nutritious. My favorite is Pisata badam as it contains lots of chopped pista &amp; badam. other flavors are  choco chips, rich cashew, rich butter etc. They are much better than local biscuits or cookies from competitor products .The biscuits are made of refined wheat flour sugar butter and edible vegetable oil.But I will again say that the taste of biscuit is really good. A Rs5 packet of rich butter cookies has 6 biscuits in packet and weight 39grams. Product quality and Packing is good", "vinodhreddysteve": " The product is good day . it is one of the famous biscuit brand in the market .it has high demand in the market.it is made out of wheat  and butter .it has great  taste and good flavor satisfaction. it has very good taste and good quality.the product quality is good .they  have good quality of wheat and butter so they provide fresh and tasty biscuits .which are loved by the customers . it has good reputation in the market due to high quality product.the packing id good they pack with great care .the cover comes inside with silver coating .to keep the biscuits fresh and healthy ."}], {"amolgpatil": " The Britannia Good day buicuit continuously maintain its product quality and taste all over. Typically I am only prefer this biscuit with tea as other biscuits can not be ate by tea effectively or it rinse in tea which is not in case with this product. I like it's flavor both Butter and Kaju too. Product packaging is average but it is good enough. Forgot to mentioned but it's energetic too.", "syedarukiza93": " I love Good day cookies and cashew taste I love to have it in tea usually in my home we fight to have this. Britannia Good day biscuits and love to share it with friends best butter tastes if I went to beckry I saw different types of cookies like salt and Sweet and nuts cookies but I buy only Good day it's not much flavor but its simple and Good", "shravani1": " Good day biscuts very tasty and yammy quality also good and price also resonable, I eat regularly teat time. my mom like very much and I ate mostly, cashe nut and butter flavour.butter chese I ate in tea and cashe used to eat timpasss time packing also rich look I like cashw and butter flavor mostly, and its have other flavors they are pista and boadam flavor and chaco chips. may be they are also good flavours.", "ganeshgawade1111": " Hello friends.Britannia Good Day Biscuits is the awesome biscuts.Britannia Good Day Biscuits taste is very very good, Britannia Good Day Biscuits have so many flevour.i am everyday use this biscuits at morning and evening tea time, my home my brother.sister, also like this biscuts.This Britannia Good Day Biscuits is the very much femous brand in India.This Biscuits Products quality is also very good, and packing quality is so nice.Briyannia Good Day Biscuits rates are very low.i like this biscuie with my family.Thanks.", "mohit123122": " Hello guys today I am sharing the popular biscuit is Britannia good day. This biscuit are very tasty and yummy. very tasty and nutritious. my favourite is pista badam as it contains lots of chopped Pista &amp; Badam. I have tried several flavors of Britannia Good day biscuits all are very good. other flavors are choco chips rich cashew rich butter etc. they are much better than local biscuits or cookies from bakery. now a new variant of Britannia good day is also available in the market it's good day chunkies it contains choco chips, I have tried this one also its very crunchy liked by kids as contains lots of choco chips. every one like this Biscuits. this product quality is not compare for other's products . this product(Britannia Good Day) present in every home, really it's a nice and awesome Biscuits. so guys if you not tried earlier so you try atleast one time its a good biscuit.", "akashrawbin123": " Every morning I take britannia good day biscuit and one cup of coffy at tha day fress and faithfull in works you take at relax good brand and tast crispy good tast many flavor and so much tasty in good day biscuit in this genaraction boys, girls and 40+ and all of age like one of one biscuit in world try in this", "shaikbaji4154": " Calories    125     Sodium     90 mgTotal Fat   4 g     Potassium     0 mgSaturated   2 g     Total Carbs     19 gPolyunsaturated 1 g     Dietary Fiber     0 gMonounsaturated 2 g     Sugars     7 gTrans   0 g     Protein     2 gCholesterol 3 mgBritannia Good Day Rich Butter Cookies contains 120 Calories per 24 gm Find . and preferences on low fat, low sugar, low salt and high protein food products.Nutrition facts and Information for Biscuits, plain or buttermilk, refrigerated dough, . may yield a more complete protein source and improve the quality of some types . Vitamin C. 0.0. mg. 0%. Vitamin D.~.~. Vitamin E(Alpha Tocopherol). 0.2.", "omali": " Good day biscuts very tasty and yammy quality also good and price also resonable, I eat regularly tea time. my childrens like very much and I ate mostly, cashew nut and butter flavour. butter chese Product Packaging: Good Day is one of the famous brand names of Britannia. It has some variants like Butter, Cashew, Badam Pista. It is a soft biscuit not crispy, and breaks very easilyIngredients contain Wheat flour, Butter, Sugar, Milk and Milk Products, Salts, Permitted Flavour, colour etc. Cashew, Badam and Pista are also added as per variant name.So, it is a high calorie biscuit and most suitable for little naughty one. Addition of nutrients like badam, pista, butter, cashew makes it really enriched as claimed by Britannia. Taste is good.", "vs1715592": " Britannia good day biscuits are very tasty and yummy. very tasty and nutritious. my favourite is Pisata badam as it contains lots of chopped Pista &amp; Badam. I have tried several flavours of Britannia Good day biscuits all are very good. other flavours are choco chips rich cashew rich butter etc. they are much better than local biscuits or cookies from bakery. now a new variant of Britannia good day is also available in the market it's good day chunkies it contains choco chips, I have tried this one also its very crunchy liked by kids as contains lots of choco chips. every one like this Biscuits. this  product quality is not compere for other's products . this product(Britannia Good Day) present in every home, really it's a nice and awesome Biscuits.", "Swaraa2017": " Britannia good day biscuits are very tasty and yummy.I have tried several flavours of Britannia Good day biscuits, all are very good.Very tasty and nutritious.My favourite is Pisata badam as it contains lots of chopped pista &amp; badam.other flavours are  choco chips, rich cashew, rich butter etc.They are much better than local biscuits or cookies from bakery .Now a new variant of britannia  Good day is also avialable in the market, its Good day chunkies, it contains choco chips, I have tried this one also, its very crunchy, liked by kids as contains lots of choco chips.", "heyyou93": " The same number of the general population like the rolls if Brittania I for one don't care for them much. Yes they are great when you are eager or when you need to snatch a fast snacks for visitors however they are not a significant decent decision.  A portion of alternate bread rolls are great at 10-20 rupees and this is likewise not a terrible decision but rather with regards to taste. It is recently approach to much sweet and thick. I don't care for the bread rolls to be thick and sweet and it is particularly thick at that.  Presently commonly I had a go at eating it with tea yet its so much sugary that it gives me a suger surge in my mind and I for one don't care for the items sweetened particularly with the end goal of making it taste hitter.", "eaglesdanceinstit": " I love Good day biscuit and I love the flavours of the Britannia's ProductsI give you the full information of the Britannia's good biscuit:-( flavours added - nature identical and artificial flavoring substances - Butter, Milk, Nut And Vanilla). Quality is very good of this product as I think.Nutrition Information per 100g product(approx.)Carbohydrates 65g, Sugar 22g, protein 7g, Fat 24g, Saturated fatty acids 11g, mono unsaturated fatty acids 10g, poly unsaturated fatty acids 3g, Trans fatty acids 0g, cholesterol 9.5mg, Energy 504kcal.Ingredients: Refines wheat flour, Sugar, Edible Vegitable Oil(Palm), Cashew Bits(4.5?), Butter(3?), Invert syrup, Milk solids, Raising Agents [503(ii),500(ii)], Edible comman salt and Emulsifiers(322,471,472e)( Numbers in brakets as per International numbering system).", "kirankumarmc123": " There are many flavors of Good Day Biscuits like Cashew, Butter, Nuts Cookie, Chocochip, Choconut, etc., and my favorite is Nuts Cookie as it has dry fruits that are good for heart.  We eat at home casually, and we carry them on outings that involve strenuous exercises as Good Day Biscuits give instant energy and have a good taste.  Some times if I am too busy or something to have food, I just grab Good Day Nuts Cookie and keep going.Quality is the best in the industry, I should say.Its wrap keeps its quality uncontaminated and also makes it simple to open.", "RREVIEWS": " Britanni good day biscuits are very popular in India because of its delicious products. This product keep its brand value and given satisfaction to all customers those who are using biscuits for snax, childrens in their tiffin box and older with a cup of tea. This is one of the popular choice in biscuit segment. I used to have this product because of its quality and test. As a customer you never compromise in quality of the product. Since Britanlia is one of the oldest brand and bringing various products in the market and all are very hygienic products keeping into the mind all types of customers demand. As a biscuits lover I love to use this product I normally use small pack Rs 5.", "thecajatin": " Good day is now old in cookies industries but the taste is same as like before delicious. I regular have good day biscits in my breakfast.Sometime I take small packets to my office colleague, everybody blush when I pick out good day from my pocket.Biscuts quality is increasing day by day and becoming more crunchier and tastear.I'm completly satisfy with good day biscits. Value for money biscuts.", "ashakalwani": " Britania is very famous brand in all other biscuits company. I like britannia biscuit very much although britannia made many type of made biscuits, all the biscuits has a differ test but britannia good day one of them biscuit which ilike it . it contains rich butter which is very healthy and tastier . my childern also like this biscuits very much  fully satisfaction with quality, product packaging is very attrective", "SumitChandra545": " Hello people, britania good day biscuits are really really tasty(i am including other flavours also like: pista, butter etc). There is no doubt that these will satisfy you.These have a great buttery taste and the smell is just sooo good, it is the smell that attracts me more than the taste. These will taste great with tea.Bitania is a famous company and when I first bought its biscuits, from then till now I haven't eperienced any problems related to quality. These are nicely packed.Britania Good Day biscuits are a perfect option to choose for adults as well as kids.", "sonuk16511": " Britannia biscuits are very good biscuits as I used it in our monthly ration. Now it is the part of our family and I am using it with the tea after reached at home only in the evening from office. the taste is very good and delicious. I used only the butter flavor for every time. There are other flavor available in the market but me and my family use only butter biscuits. The product quality is very genuine and we are totally satisfied with this product.", "ck28660": " There is no doubt that this will satisfy you.britannia good day biscuit taste is very good.this biscuit comes in many flavours.britannia comes in very good package.these have a great buttery taste and the smell is so good.britannia is a famous company and when I bought its biscuits from then till now I haven't any problems related to quality.britannia good day biscuits are a perfect option to choose for adults as well as kids.i am everyday use this biscuits at morning tea time.i like this biscuits very much."}], {"sadiasana83": " I like this product as its healthy and filling as well as tasty. Instead of namkeen or maida biscuits, its a good habit to eat these biscuits as evening snack. The fiber keeps our system healthy and zero.Britannia nutrichoice digestive is very healthy and tasty biscuits.It is tasty, nutritious and healthy for me and my family. I love it.Britannia is not just a name but a very trustful brand. I would luv to try this product. Please send me sample.I have tried Brittannia Nutri choice for the past two years. I liked very much. It contains fibre, it is good for health.It is very tasty and filling.It is good for Diabetic and Heart patients.", "ammajeemadeena": " Good day biscuits are good in taste. they provide peanuts biscuits at low cost. and it is tasty  tohave with tea. and this good day chocolate flavoured biscuits also nice. but their butter flavoured biscuits are little bit ok when compared with peanut and chocolate flavoured biscuits. this good day biscuits are healthy  for health. it's packing process also good.it's flavour are satisfaction. quality of product is good.", "Sanjay8080": " Early mornning very rush every family every familis women have rush to start her work because her childrun go to the school her hasbund want go office then she want make some brackfast to all but mornning time is evary one have tention to late so .I have 3 child that above problem comes to my wifeSo what I do for her .I take other biscuits from market but no one like that biscuits then I bought britannia  good day biscuits every one of my family like this biscuits this biscuits have good test so I love britannia goody biscuits", "syedaruqsar": " Britannia Good Day Biscuits is the best biscuits and having a good taste.This biscuit having a different types of flavour.This biscuit having a delicious taste.The product is nice and many people eating this biscuit.The packing is good and hygenic.As it is having a different flavour children enjoy it while eating.We can serve this to the guest which look royal.I personally love to eat this biscuit.I really like its flavour.", "merajrb": " Britannia good day biscuits are very tasty and yummy I have been eating for the past so many years and it's taste is such that I just can't stop myself from eating them its very yummy the biscuit is easily available in market an you can easily carry them as well since size are very small and can even fit in your pocket I love the packing of Britannia good because of the colors used in the packing and how simple it is open the packet and good teste.", "srilalithaPTC": " Yummy. Good Day Biscuits make my day really good.  I Just have a Good Day Biscuit pack when I skip my meal. In spite of many costly biscuits in market good day is little bit different. This is because of its yummy flavor. The cashew nuts filled in this biscuits are very crispy. As these biscuits use Nutritional Ingredients  I always prefer going with Good Day Biscuits.Even though packing looks simple the biscuits inside gives good yummy taste. I like the texture and the design on the biscuits which shows a smiley face. Its always available for reasonable price.I recommend Good Day Biscuits", "spnkumari083": " Britannia good day biscuits are very tasty and yummy. I have tried several flavours of Britannia Good day biscuits, all are very good. Very tasty and nutritious. My favourite is Pisata badam as it contains lots of chopped pista &amp; badam. other flavours are  choco chips, rich cashew, rich butter etc. They are nuch better than local biscuits or cookies from bakery . Now a new variant of britannia  Good day is also avialable in the market.", "ek2424ek": " I like it britanna good day it is very tasty they are very tasty and yummy but my brother favorite is pista badam.britannia good day biscuits tasted  best with the milk or kisan jam. product quality is excellent and the packaging of product can be said as average and be used for serving guest and small children so you eat britannia  good day packaging is very tight roll have fun friend and eat britanna", "neerajarora501": " Hellllooo. Everyone.  I love this Britannia good day biscuits.The  Britannia  good day biscuits  taste is very good and the Britannia good day biscutus  is totally hygienic .i am eating the Britannia good day biscutus from last many  years and the packing of the Britannia god day  biscutus also very good. I am totally satisfied from this product and this come in many flaovur you can enjoy with your favourite flavour .", "mamtasankwar": " Britannia Good Day most favourite brand its quality its taste and its packing also the design of packing is so attractive that you can't resist yourself to buy it and when you open packet, it feels to have a fresh cookie from Bakery its flavour its Aroma are so tempting that you can't resist yourself to take bite and when you take bite its really such a yummy taste. I love Brittannia good day butter and Britannia Good Day cashew very much. it's very healthy and has nutritious value for my growing children and I love it for my whole family also. thank you brittania for giving us such a highly loved biscuits at such a reasonable price. Its range starts from 10 rs. and a common man also purchase it. I highly recommend that everyone to have written a good day in there routine and day to day meal diet", "prasanthi578": " Britannia good day biscuits are very tasty and yummyI have been eating for the past so many years.And it's taste is such that I just can't stop myself from eating them its very yummy the biscuits.this flavor is very kaju and so taste. this product packing is good and nice.these are  very yummy the biscuits, I think its very interest and taste  for kids. good quality and nice finally I preferred these product.", "abhimane11": " Britannia good day biscuits are very tasty and yummy.i have  several flavors of Britannia Good Day, all are very good.very tasty and nutrition,My favourite is pasta badam as it contains lots of chopped pista &amp; badam, other falvors are choco chips, rich cashew, rich butter etc.They are much better than local biscuits or cookies from local bakery.Now a new variant of Britannia good day is also available in the market, is good day chunkies, its contains choco chips, i have tries this also, its very crunchy liked by kids as contain lots of choco chips in this.", "pankbhandari22": " Britannia Good Day Biscuits is one of my favourite biscuits.I am eating this biscuits from last few years.It is healthy to eat as well as tasty.Britannia Biscuits is popular amoung children. Parents referr their children to eat Britannia  because of its popularity as well as honesty.Its popularity increase because it comes in different variety with different test.My favourite is rich butter.As it contain butter in biscuits.It will be popular in market for many years because of its variety and tast.I well perfer u all to eat Britannia Biscuits ones.I will rate Britannia Biscuits on its tast and variety 4 out of 5.", "mukuljethiwal4": " The britannia employer is the quality business enterprise in biscuits merchandise because this company biscuits taste is so yumeee. This biscuit are eating with and without tea, milk and many other ingesting products. This enterprise merchandise satisfactory is aver I visible fresh and very curky quality its gentle in facet and Britannia excellent Day Are The most scrumptious Biscuit.I have been consuming Britannia properly Day Biscuits now for decades and I can say it without doubt that it's miles the maximum delicious and tender biscuit that I have ever tasted. The product seems wholesome as it has nuts and butter which it gives it a touch crunchy flavour. They may be very tasty.", "aalam0000": " Precise day biscuit became better few years earlier than however now the flavor and qulity is not identical they merchandise isn't always as it become before . I suppose they should increase the price not best of there product’ itx first-rate biscuit but now the taste and best is not goood I assume so that they no longer worried about client health indian executive and meals act dept should additionally check there products I assume they now not the usage of properly first-class of objects entire making those biscuits", "deepsharmaug89": " Britannia Good Day Biscuits is very tasty Nice, Good quality and packaging this Biscuits is awesome. This Biscuits every flavor is very tasty and demand this biscuits many many more in the market. Prices this biscuits not costly. This reason every people buy this biscuits and taste this biscuits daily.The company was established in 1892, with an investment of ?265. Initially, biscuits were manufactured in a small house in central Kolkata. Later, the enterprise was acquired by the Gupta brothers mainly Nalin Chandra Gupta, a renowned attorney, and operated under V.K Brothers.\" In 1918, C.H. Holmes, an English businessman in Kolkata, was taken on as a partner and The Britannia Biscuit Company Limited(BBCo) was launched. The Mumbai factory was set up in 1924 and Peek Freans UK.The company name finally was changed to the current \"Britannia Industries Limited\" in 1979. In 1982 the American company Nabisco Brands, Inc. acquired the parent of Peek Freans and became a major foreign shareholder. The contribution of this position was of Bhavya Chugh and his family.On 27 October 2001, Britannia announced a joint venture with Fonterra Co-operative Group of New Zealand, an integrated dairy company from procurement of milk to making value-added products such as cheese and buttermilk. Britannia planned to source most of the products from New Zealand, which they would market in India.", "shivshankarmandal": " Britania biscuit company is very old company, very big company, very famius company and very good company in india.Britania company many type of made biscuits. All type biscuits test is differant . But britania good day one of the good and testy product. Britania good day my faverite biscuits because of very good test and less price.S pecially in this biscuits flavour note iv super. Britania good day also found of marketdifferant differant packet like rs5/-, rs10/- etc. Packing quality also verygood. Packing wrapper printing also excilant. So I like britania good day biscuits. And this biscuits are available in any shop in india. So this is my personal opinions you are also try and give feedback.", "kanumurinikhilvarm": " Hello every one I eat goodday biscuits daily and my favorite one is butter which is in blue colour pack.Actually I dont like dry fruits so I eat blue one.My sister likes all flavours the one thing I notice of goodday biscuits is its very hygenically packed and very rich in quality.Thanks for britania for maintaining the same quality for goodday biscuits since years unlike others.I am very much impressed with the flavour satisfaction of good day biscuits .Product quality of these biscuits is good as they use rich products its even healthy for some point of view.Product packaging is very good, they pack very hygenically .Thankyou", "faizan2637": " Britannia good biscuits are very tasty and yummy in taste. I have tried several flavour of britannia like butter, pista , badam and like choco chips and cashew rich. It is very tasty and nutritious.  My favourite flavour is pista badam which is chopped with lots of pista and badam.it is mouth watering all the time. The good day biscuits come under price of 10 , 20 as follows. These biscuits are full of nutrition so good for health . The ingredients used to make this products are very fresh and best in quality so it is very good biscuit so enjoy it .have a good day."}], {"zwxywz": " Good Day  is the major  product  as far as market leaders  from Britannia is concerned . Good Day  biscuits could not be replicated by competitors  like Parle, ITC and now  United Biscuits. you can enjoy these biscuits with a cup of tea, so that it would tasteful and exciting its Pricing is low which gives advantage for a high quality product and important point is that Britannia's distribution and brand name has strong impact on it.", "pchhabra1996": " Whoever don't like buiscuits. It is liked by all nearly all persons. I eat many biscuits but the best I like the most is britannia good day biscuits. I ate this since 9 to 10 years ago . It has butter cookies which is the best one I ate.its packaging is so good that it will not break when we go for a long tour. Me and my family regularly take that biscuits in batty time. It can even be replaced withbreakfast time rather to take routine paronthas and whatsoever.", "harshrathor": " I have been eating Britannia Good Day Biscuits now for many years and I can say it without doubt that it is the most delicious and soft biscuit that I have ever tasted.The product appears wholesome as it has nuts and butter which it gives it a little crunchy flavour. They are very tasty and yummy. I have tried all flavours of Britannia Good day biscuits, and all are them are very tasty and nutritious. But my favourite is Pista badam as it contains lots of chopped pista &amp; badam. Other flavours are choco chips, rich cashew, rich butter etc. They are much better than local biscuits or cookies from bakery.Britannia is one of the biggest brands around the world and are very reliable so it is safe to say that their product quality is beyond excellent.The best thing is that they are available at a very cheap rate. I love the product packaging of Britannia Good Day because of the colors used in the packaging and how simple it is to open the packet.I would recommend this product to everyone because of the excellent taste.", "gy1832": " Yeahhhh yummyyyyy specialy when dipped in tea yeah life is nthng if u have not tastes dis deadly comboooooooooo it's damn good ek chai cup or bscts yooooo muahh??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????", "surendhar786": " Britannia produced Lot of products In food industry, Good day is the key product in Britannia generally for breakfast purpose we used to eat biscuits, Good day is the perfect choice for breakfast as well as travel purpose, Good day comes with almond mix so, will get energy instantly. Good day comes with fantastic flavour which satisfied all age groups, Product quality wise fantastic there is nothing to say anything Britannia maintains high level standards and its comes with nice packing overall Good day gives Good day to all.!", "Sowkya": " Britannia good day biscuits are just full of milk taste and dry fruits. I am very busy could not really give time for preparing bearkfast hence my day starts with cup of milk and a pack of good day biscuits around 8am in the morning  .I feeling light and I am full till my lunch till I reach my lunch hours that is about 12 noon .Thank you good day you make my day with full of dry fruits and my best teaste of milk so yummy. I feel people who do not have time to make bearkfast fast can use this as option like me. believe me you will love your day as your active and cool.", "vishalsinwar": " This Britannia biscuits is one of the best thing you started your dayIt's price is up to 10 to 20 INR  which is really awesomeAgaghqjjajannshahhahahajajusyehbdhusjshyuddhhdhdududhjxndjdjhhsbggwbbjakiubdbwjahbabdgsehbwhuauhqgsbbnaiuquqbqbiajansbebheuwhqnauiqjwnehydhbshshsjsnsjsjsjsjsjshsnsjsjsnnsnssnhsbdndjjs", "kumarsurajeh661": " From my childhood till now I have always liked this biscuit. It is one of the famous biscuits company in India.I just love the taste of this biscuits and the flavor they use to make it just delicious. I always like the amount of cashew nuts they use to make it, which makes it more delicious and healthy.It is the best quality product in biscuits and is very cheap too. Is even best to serve to guests.The style of packaging is also very good and safe and can be easily distinguished from other biscuit products.", "TRUE_legend": " I have always liked these biscuits they of good quality and best priced. Always enjoyed with me afternoon tea. You can get them almost any were in India and outside India. They come in different flavors butter, badam and pista. I have tried and tested all of the above flavors and they are good. Indian market is full of options when it comes to biscuits but Britannia has done good job with the GOOD DAY biscuits . All the flavors are deliciously good .The packaging of the product is done very wisely with attractive colors and a good wrapper quality which shows how good the quality of this product is . These biscuits are there in the Indian market for now so many decades. I was surprised to find them available in the supermarkets outside India .If you are thinking to buy this product I would say go for it .", "sharmanishant761": " BRITANNIA GOOD DAY BISCUITSBRITANNIA GOOD DAY BISCUITS  IS MY FAVORITE BISCUITS FROM MY CHILDHOODI LOVE TO GOOD DAY BISCUITS WITH ALMONDS FLAVORI LIKE TO IT PRODUCT QUALITY OF GOOD DAY BISCUITSWHENEVER I EAT BRITANNIA GOOD DAY BISCUITS I COMES TO MY CHILDHOODIN MY FAMILY EVERY BODY EATS THIS DUE TO ITS HYGIENE AND GOODS FOR HEALTH THIS BISCUITSTHIS HYGIENE IS MAINTAINED BY ITS PACKAGING SO ITS MY ALL OVER THE INDIA", "atithik": " Britannia Biscuit is so tasty that once the packet is opened will be finished with in moment, anr everybody want more, and Britannia provides many flavors and all the flavors are so tasty that you can't say ki, 'ki ye wala jada accha hai' these are beyond comparision, an dwith taste in also maintain the Qulaity of the biscuit also it not only tasty but healthy also the packing is satisfactory, the biscuit is not broken into small pieces, the biscuit is in fine and proper condition and crunchy also, Me and my family love all the flavors of Britannia, so have a Good Day.", "winneramol": " Btitania Good Day Biscuit is best in morning breakfast &amp; travelling to get instant energy. There are many verities in Britania Good Day Biscuit. Each one is best to eat.Taste &amp; flavor of the each britania good day biscuit is very very nice. use it any where when you feel tired to get instant energy.Its very very healthy to our body as its quality maintain with so many ingredient in it.Britania product packaging also good &amp; attractive.", "subhamkangsiya786": " The britannia company is the best company in biscuits products because this company biscuits flavor is so yumeee. this biscuit are eating with and without tea, milk and many other drinking products. This company products quality is aver I seen fresh and very curky quality its soft in side and best beking. This company give grantad products. Packaging of the products by machine and the machine are naver fail, as u see the packaging of the biscuits as you parchaging of britannia biscuits they are never open found any side. so the best company give's us best biscuits ever.", "akshithasreee": " This biscuits good for health.my baby like this biscuits.she eat daily 2 biscuits.im using this like snaks every day for my kids.im also eat this biscuits daily.this contains low fat.this gains u r energy back.this biscuits is good than other biscuits.im recmonde this biscuits for u and u r family.", "kamirrustam": " Britannia good day biscuits really a best quality biscuit and taste of this biscuit too good.i think maximum people who eat  good day biscuit out of them ninety five percentage people satisfy by this product.it, s a good flavor and good quality product. I really enjoy to eat this biscuit. rich in recipe the good day biscuit has been very very popular among masses and taste.good day is a major product as for as market leader britannia is concerned.and product packaging is also looking good.good day is completely nice biscuit.", "desitrend": " HiFreindsI remember when I am 15 year old I was a biggest fan of Britannia Good day biscuits.But now I am totally changed with time.In good day biscuit's case you can say same thing.10 years before I used to eat good biscuits because it is an awesome biscuits because in this biscuit manufacturing   company use cashew, badam and lots of butter.But now good day is down his quility of material used in biscuit and this is because of marketing compitition level is so high in our retail market.Some other new company who wants to grow their goodwill they provide very good quality of biscuits in lower range from Good day.Thats why Britannia  down tha price of good day and also down the quality of this biscuit .Now in present time Good day is just like any 5 rupees butter biscuits.In one line I can say that Good day is not providing a standard quality  to the market for which they were famous in past.Thanks,Regards.", "umeshjha1998": " Hi there,Today I am going to review about the most eaten biscuit of times which is Britannia Good Day and has very good and bad effects on our health . I will discuss it down below.Who can eat This?The person who is a fitness freak and is maintaing his weight should eat this in limited amount may be 3-4 pcs a day is enough. But if if you want to enjoy the flavour and taste of the biscuit then Good Day is for you.Tastes Best with?Britannia Good Day Biscuits Tastes Best with the Milk or Kissan Jam.Best good competitors/replacements:NestleTigerParleAmulProduct Quality is Excellent and the packaging of product can be said as average and be used for serving Guests and Small Childrens.", "Akash4444": " Hello friends today I went too tell you my Most favorite Biscuits Britannia Good DayFriends I am eating this biscuit from my childhood this is such as a very good biscuits teste and soo awesome flavorfirst I went to tell u about its flavor satisfaction  is awesome if I compare this biscuits other product soo its is butter thenparleG, Sunfest, and many more productif I talk about product quality its awesome butter then other product because we all know that Britannia product is very affordable and soo chep I market and every can effort it daily its good for our health and  I like itif I talk about its Packaging is superb its looking very good in this", "vandanachawla2013": " Biscuit king, the company's sales grew at a compound annual rate of 16% against the market, and operating profits reached 18%.[citation needed] More recently, the company has been growing at 27% a year, compared to the industry's growth rate of 20%The company's factories have an annual capacity of 433, 000 tonnesBritannia initiated legal action against Danone in Singapore in September 2007Just because of Good day biscuits biscuits"}], {"sharmamonika": " Hello friendsI don't like the Britannia good day biscuits. because its more sweet inside it.also its poor taste, I don't know why they named it GOOD DAY, even after eating your day became WORST DAY.its very poor quality they manufacturing, even in the same price range or below price also they making very good quality biscuits.anyway I don't like it all.after eating biscuit after 10 minutes still the biscuit particles in my mouth. I hate thatManufacturers should implement the sugar quantity in the biscuits.", "rajehb4u": " Hi I am rajesh well I am using this biscuit since from 18 age are you know that Britania biscuit having many varieties liker britainia gold Britannia Marie Gold Britannia Horlicks Tiger biscuits moreoverI'll be seen that the Good Day biscuits having the various rates like 5 rupees 10 rupees and 20 rupees  according to quality that brittania gives much helpful to the people who lives in below poverty", "kumarsurajeh": " I love this biscuit from my childhood, even almost every member in my family loves it, from youngest to oldest.Thank god the flavour has not changed much over time, it still has the almost same taste it used to have 10 years ago. But still there is limit as agter some times it gets a little boring like after having 2-3 pieces.The quality of the product is very good and it too has not changed over time. It used to be always good.Packaging of this product is its main identification, which is very good and safe.", "ravirajsinh": " I love this biscuits.britania good day is always satisfying thier customers.i have been eating these biscuoys since my childhood and still I am loving it.they have maintained the same taste.in fact I would say they have improved the taste.so without thinking have them with tea, while travelling or when you dont have anything to eat good day biscuits will make your day not just good but betterflavor I like cocnut and the others are also goodproduct packaging is nice.with good quality", "bharat1276": " Hi friends,I makes my every day good day by taking Britania Biscuit in morning. I am just crazy of its taste from childhood. My favorite is choco-nut flavor, I just love this flavor as well as my both niece always demands for the same flavor.Its a record from the last decade that they provides us excellent product quality with low cost, I always prefer to have this cookies, its taste is seems home made biscuits.Its packaging is also extremely good and attract much more for Choco-nut flavor. I just love it.Thnx.", "ajay_raj14321": " Hi friends I will eat this Biscuits since my childhood my parents used to buy a lot and still I eat these biscuits.I think even after 25 years still there is no comparison with this brand in comparison with Taste, Flavor and Quality because other brands promises but they will not full fill all promises when it comes to quality and Taste why because I tried a biscuit called 20-20 which was initially a good biscuits to have but after 6 months there was a change in the Taste but where as this brand no change in taste nor in Quality of their Brand.I think we should buy this product only because the quality it maintained since long time and it is a well known brand all over the world and there is no harm full elements in this biscuits so we can give it to our children's too.", "kajal_bansal": " Hiii friends.I love this britania good day biscuits because its make me too refresh. since it came in the market I tasted it and when I taste it at that time I was not beleiving that how can be it too crispy. It is too buttery and awsome. I take every day my bed tea with this britannia good biscuits. Because I cant expect my day good without this britania good day biscuits, it may my morning too refresh.", "strikervikas": " Britannia company good day biscuit will make your day really good. because they are so crisppy and curuchy biscuit. even when you dip with tea it won't part it. this is why this biscuit is favoirte of all people. as we know about this company products are really good and have great coustmer satisfication till now. thats why it so famous in front of public. aslo there test is yo yummy. there company use a great quality seeds and wheat to make those biscuit even they make biscuit sugar free", "sumagram": " Hi all, Britannia Good Day Biscuits is a flagship biscuit product of Britannia Industries.Britannia Good Day brings alive its philosophy of Smiles through its new Logo, packaging and cookie, the New Good Day cookie comes with a smiley design on it as well.  Take a bite and get an unparalleled experience. The recipe used in its preparation is  wholesome with nuts and butter, but the high sugar makes it unhealthy, and a cause of obesity if consumed frequently.I have tried several flavours of Britannia Good day biscuits, all are very good. Very tasty and nutritious. The biscuit is quite crispy and it tastes the best when taken with a cup of tea.Packaging of this product is also very good and is also affordable to buy.", "fawad_ff": " It’s a Smile that makes a Good Day! With our tagline of Har cookie mein kayi Smiles, we will give you reasons to smile everyday.The company was established in 1892, with an investment of ?265.[4] Initially, biscuits were manufactured in a small house in central Kolkata. Later, the enterprise was acquired by the Chugh brothers mainly Bhavya chugh, a renowned attorney, and operated under V.K Brothers.\" In 1918, C.H. Holmes, an English businessman in Kolkata, was taken on as a partner and The Britannia Biscuit Company Limited(BBCo) was launched. The Mumbai factory was set up in 1924 and Peek Freans UK, acquired a controlling interest in BBCo. Biscuits were in high demand during World War II, which gave a boost to the company’s sales. The company name finally was changed to the current \"Britannia Industries Limited\" in 1979. In 1982 the American company Nabisco Brands, Inc. acquired the parent of Peek Freans and became a major foreign shareholder. The contribution of this position was of Bhavya Chugh and his family.", "Harshitzzz": " The biscuits of brtraiNia is the famous biscuits according to their taste and flavor I like it sk kuch without tea or coffee we can eat this biscuits .it's faLovor reception is very very good.Color taste smell of the biscuits is very very awesome.If we talk about the quality then it is just awesome no words to check the quality.Oy because of its quality it is expensive than others biscuits.So I loved it so much .and recommeded everyone to buy this and atleast eat once a day.Thank you.", "pritomkumardey": " I am fond of Britannia Good day right from childhood. Now I am 25 but still I cannot resist myself from taking one from the plate whenever it is served anywhere. It's taste is constant. No change over the years. Almost everybody in every age group loves this biscuit. Whenever my mother tells me to bring biscuits from shop. I just go and ask for Britannia good day. What a taste. None other company makes the same biscuits. There are many similar biscuits in the market from sunfeast, anmol and many other but no one matches the taste of britannia good day. Whenever I go for a trip I always keep a packet of good day with me. It is my travel friend. A complete combination of taste with nutrition. I just love it. Packing is also very much safe and eye catching.", "kskavitasharma73": " This biscuite is so good I hv tried butter good day and I feel like real butter melting in mouth. I love it. I have a adiction of having these buscuit every day with tea. simply love it.my husband also like it. Highly recommended biscuit for alll. It, s so beautifuly baked that every bite have a awesome crunchy and delicious taste in mouth.", "Randhawa7003": " Good Day biscuits, the taste of india. No doubt every single person including man, woman and child like the biscuits. The flavour of biscuits remind me my childhood day. It is the flavour that make it special as it satisfy every one who taste it. The product quality is high and because of its quality it is very famous. The packing is also very sexy. Easy to carry and easy to use. No doubt each child love to have it in his lunch box. It is my favourate so I love it.", "benthomas1705": " Good day biscuits are the tastiest biscuits. These biscuits are loved by young and old alike. These biscuits have a perfect flavour. The best thing about good day biscuits is that cashew nuts are added in a perfect quantity. These addition of cashew nuts provide the perfect taste to the biscuits. Moreover, Britannia is known for the quality of products. Good day biscuits also have the best quality. No questions have been arised on the quality ever. The product packaging is also done very carefully. The factories are fully mechanised and chances of error are very less. Thus the packaging is at its best. The product gives complete value for the money.Thankyou.", "sss_sss12345": " Lets the day start with  britannia good day biscuits. u can enjoy with tea and milk as breakfast.for school going children and elder persons it is best.it is crispy and crunchy so most of eaters like that but one bad things is that is stick to your teeths as it is oily.if we talk about nutrition then it is best which gives you adequate carbs and healtheirs fats.so from myside have these products in your breakfast.avoid with air contact for large time as it gets dry.", "dharmbirsingh25": " Britannia is a big brand but still some of its product are not satisfactory, if I talk about good day biscuits then I personally feel that its taste not so good.Flavor satisfaction good day biscuits included a dry flavor and it not much so tasty.there is no more doubt about their brand and their product quality, the product is just hygiene quality and better product quality design.The product is so nicely designed and its product packaging is much better formed but still its taste is not much satisfactory .", "HimanshuParashar31": " Hello, friends Britannia good day biscuits are very tasty and yummy .i have tried several flavours of britannia good day biscuits, all are very good very testy and nutritious the biscuit is quite crispy and it testes the best when taken with a cup of tea my favourite is pista badam as it contains lots of chopped cashew, pista and badam but they are much better than local biscuits  these biscuits have a perfact flavour thus the packagings is at best, the product gives completed value for money.wheat flour nuts butter milk solids etc.", "Nishchita": " I usually find the small pack of good day with flavours of butter scotch, pista, cashew and cadbury a great buy. When compared to other products in the same category I finding eating lunch of four to five biscuits filling. I like the crispy and crunchy taste along with some water. I feel energetic the product has not got spoilt even once and is crispy due to packaging and I use the same pack to store the remaining ones, my family and  friends also have enjoyed the product with me and I haven't seen a dissatisfied face till date. I have seen even my boss have a pack of it. I have no regrets consuming the product till date even during travel I have a pack with banana to have a light stomach. On the whole I find the product to be a great buy and have seen the product move off fast from the shelves of panwallas. It is a great value for money product and details of nutrition and other standard details are also mentioned on the pack which is easy to carry. On the whole a good product worth being in the fmcg sector.", "irfaniffy": " This biscuit is nice in taste and very good biscuit.The prices are low and this biscuit has very good.Really nice because the first thing is that the cost of the biscuit is low and actually the flavours are very good and if we go with the quality and the biscuits is bitter in taste and the new flavour of the biscuit is good.my son also like it, I mix it with milk for my son and I am happy to see that my son like eating"}], {"karthiksantosh2521": " Hi friend when I was or in year 2004 good had very good quantity at very lesss price but now when we buy good day buscit the give a very less quantity and charge very high price yes belive that the wheat price is increasing but you should decrease the price so that it could be affordable to everyone but the taste of good buscuit is the best no other buscuit can give good day buscit like so good is. Best buscuit but decease the cost of the buscuit or increase the quantity of the buscuit thank you", "shrivastavanshulk": " It is very nice  biscuits, it is yummy, tasteful, creamy with  having different  flavours of orange, Malachi,  chocolate, pineapple,  and other creamy biscuit, tea without Britannia  buscuit   . it is  very light  and  dissolve in the  mouth  very easily  and  it taste is  unmatched . we have tried so many biscuit but  its taste is incomparable  and so it is no -1 biscuit  in India . Britannia is  one of the most favourite biscuit of all time .", "aries31mar33": " Britania is one of the most popular brand these days. I still remember when I was a kid I was a great fan of this brand. However it has many flavours available there used to be chocolate cream, pink apple, elaichi, orange, butter, cashewnut, almond etc. The new thing that the brand has started is their multi grain biscuits of which I am a great fan they are nutritious and people who are on diet or do not want those maidan biscuits. This healthy and tasty option is for them. There is something for everyone whether you are a kid, youngster or old.", "vikalpyadav4": " This biscuits is really so nice to taste that no one can compit it in taste. This company is so old that when I was small then my mom was bring me this biscuits to eat. I always like to take this biscuits in my tiffin as a snakes. The mouthmeting taste with lots of nut and cashues ar so delicious with Lot of butter taste and it inhance the taste bud. Advertising of this product doesn't need because if an one liking it they will ask it again and again for such a delicious biscuits. This biscuits are not so much sweet also it's normal taste of sweetening which is ossom. Eat a gooday everyday and make you good day. Day must start with good day.", "billionaire_rashu": " Who doesnot know the brand britannia as it is so common and old brand. britannia good day biscuit is one of the product of britannia which is most selling biscuit in indian family. this biscuit is so good that you dont need any cup of tea or coffee to have it you can have this any time any where. it is rich in real cashew and butter. but people suffering from acidity problem should avoid it or should eat in a controlled manner as it causes acidity problem due to its richness in butter and cashew.childrens love a lot this biscuit. this biscuit is not at all made for you if ur are diabetic.", "navneetjmh": " Good day biscuts ttaste very bad. and its very  bad. everone can not perchase thisbrand biscuts. parly and other biscutes company is better then good day.so every custmor should not buy these company biscuts. And many times good tasterecieve me in packets.  And taste is not good. it is very big company but its bicutsnot taste and good. So I want anyone did not buy these company biscutes. becauseits company biscutes not good. and damage your body. it makes maida. so I recomentanyone did not buy biscutes. Parlyjee Tiger biscutes are very good then good day.good day biscutes price high but taste very bad.", "jaineelpatel7820": " Thus biscuit is nice in taste and very good biscuit.Really nice because the first thing is that the cost of the biscuit is low and actually the flavours are very good and if we go with the quality and the biscuits is bitter in taste and the new flavour of the biscuit is good.The prices are low and this biscuit has very good.", "thegreatestdoc": " I used to have Britannia good day biscuits as a child. Then as the dieting spree began I gave up on biscuits all together(a decision I still regret). I went to the market the other day, seeing good day on the shelf I could not stop myself and bought it. To my surprise, the biscuit has quality is increased markedly. It had a richer flavor, and the taste of dry fruits was  distinctly felt. I am grateful I met my childhood love again.", "sonigajanand353": " The Company's principal activity is the manufacture and sale of biscuits.It is very nice biscuits, it is yummy, tasteful, creamy with having different flavors of orange, Malachi, chocolate, pineapple, and other creamy biscuit, tea without Britannia biscuit . it is very light and dissolve in the mouth very easily and it taste is unmatched we have tried so many biscuit but its taste is incomparable and so it is no -1 biscuit in India . Britannia is one of the most favorite biscuit of all time .", "kazmidon1000": " India Biscuits Industryis the largest among all the food industries and has a turn over of around Rs.3000 crores. India is known to be the second largest manufacturer of biscuits, the first being USA. It is classified under two sectors: organized and unorganized.Bread and biscuits are the major part of the bakery industry and covers around 80 percent of the total bakery products in India. Biscuits stand at a higher value and production level than bread. This belongs to the unorganized sector of the bakery Industry and covers over 70% of the total production.Major Players", "7276233599_s": " Britannia good day biscuits are very tasty and yummy.I have tried several flavours of Britannia Good day biscuits, all are very good.Very tasty and nutritious.My favourite is Pisata badam as it contains lots of chopped pista &amp; badam.other flavours are  choco chips, rich cashew, rich butter etc.They are nuch better than local biscuits or cookies from bakery .Now a new variant of britannia  Good day is also avialable in the market, its Good day chunkies, it contains choco chips,I have tried this one also, its very crunchy, liked by kids as contains lots of choco chips.And why I have to choose this brand means. it is special and uniquequality.All child's are very like this brand.thank you Britannia Good Day.", "Jigarkumar73": " This biscuits is really. really. good in taste.This biscuits is rich with butter.I have been eating this biscuit for the past so many years and it' s taste is such that I just can't stop myself from eating them.I have generally seen two flavors of this biscuit - rich butter cookies and rich kaju cookies.Out of the two I like rich butter cookies more. The biscuit is quite crispy and it tastes the best when taken with a cup of tea.A Rs. 5 packet of rich butter cookies has 6 biscuits in the packet and weights 39 grams. The biscuits are made of refined wheat flour, sugar, butter etc.", "devanshpanchal20": " Britannia Good day BiscuitsA Biscuits made up of pure ingredients and of loveTHE FIRST THE GOLDEN WHEAT SHINNING ON FIELDSTHEN THEN MAKE FLOUR OF THAT ADD INGREDIENTS LIKE NUTS, MILK SOLIDS, BUTTER AND OTHER MANY THINGSTHE BISCUITS CONTAIN GOOD AMOUNT OF ENERGY, LOW FATSO ONE SHOULD BUY THIS BISCUITS TO EAT IN BREAKFAST AND ON DIETAND THE PEOPLE WHO LIKE BISCUITS AND ALMONDSTHE PEOPLE WHO DON'T LIKE NUTS IN BISCUITS DON'T BUY THIS BISCUITS", "atalsh": " Hi guys, Nowadays many biscuits brands are there in the market and everyone competing for the best and more popularity.We all know about Good Day biscuits and everybody like good day biscuits because of its great taste. Many other biscuits products are there like digestive biscuits, salty biscuits, oats biscuits etc etc but I choose this one because its my favorite and pure.I also tried some other biscuits also good day is far better than others. People who want purity in he product then they must go for good day biscuits and if people are diabetic or money conscious then they don't have to buy this product.Regards", "hafeezhamza66": " Hello friends I am love of biscuit britannia because of company make it good tasty crispy biscuits you eat this and loved it taste I am fan of company bakers and chiefs it make with loved see it taste and design so you try and enjoying her great taste not of high cost buy in common shopkeeper good bye thanks for see it", "ankit223838": " Since my childhood I like good day biscuits. It's small packet price was 10Rs, and they are available in different packing and color packets like Red, green with different flavor like almond, butter. if we are talking about the test of biscuit than its really very yummy. Nowadays, so many company are coping their products but I think it has it's own proper test and that's why still they are more popular in all age group. so if you are die heart fan of test than you can buy this products but please not that, who has diabetes please stay away from this products, because it has some how high sugar content for its test.", "vik2589": " Greetings everyone Good day Biscuits is a result of Britannia and I taste it since my youth. What a scrumptious taste that can not coordinate with some other Brand. There is margarine, Kaju, Pista and Badam in this Biscuit. At whatever point any visitor went to our home we like to serve it with blend. Presently I turned into a Young and there such a variety of changes come into me.There is no adjustments in the essence of Britannia Good Day.But there's no any adjustments in Good day, its delectable as it was.Good day is a standout amongst the most heavenly pocket inviting crunchy scones I ever taste, it makes me feel great to have in with tea, best accomplice for tea . it comes in different flavors like choco chips, cashew, nuts and so on .", "ramalakshmi085": " Good Day is one of the famous brand names of Britannia. It has some variants like Butter, Cashew, Badam Pista. It is a soft biscuit not crispy, and breaks very.Good Day is the major product as far as market leaders from Britannia is concerned . Good Day biscuits could not be replicated by competitors like Parle, ITC .Britannia Industries Limited(A WADIA Enterprise) is an Indian food-products corporation based in Bangalore, India. It sells its Britannia and Tiger brands of biscuit throughout India. . The brand names of biscuits include VitaMarieGold, Tiger, Nutrichoice Junior, Good day, 50 50, Treat, Pure Magic, Milk Bikis, Good Morning, .", "mailmebaijayanti": " Hi.My name is baijayanti.I want to write something about Britannia good day biscuit.I am a mother with two kids.My children love to eat britannia products.especially biscuits.And I have a trust on britannia products because of its quality.When my children are in a hurry to eat their breakfast I always use the way to give them britannia biscuits. Good day bisciuts is a product of Britannia industrieslimited.This brand places itself in FMCG industry.In india FMCG is top four ranking industries with a net worth of arounf 15 billionUSD and is growing at a phenomenal rate. Brirannia good day biscuit is one of the reputed brand in india.It's taste and flavour is liked by all.My children love to eat them.It has a good nutritional value as well as rich in vitamins.It comes in three flavours such as good day butter, good day cashew and good day nuts cookie. You have seen in other cashew cookies or nuts cookies there is no or one piece cashew or nuts found.But in case of britannia good day we can experience the real taste of cashew and nuts.Recently britannia has lunched a new good day cookie called choco chunkies.Good Day Chunkies, as the name suggests is a ‘Chunky’ cookie…which really ups the ante on Chocolate indulgence. Great care has been taken to ensure the perfect balance of dark and milk chocolate chips in the cookie and also to ensure that the chips remain in a soft condition even after baking. Take a bite and get an unparalleled, melt in mouth chocolate experience. It’s a Smile that makes it a Good Day! The smaller joys of life that can brighten up one’s life everyday often get ignored in the pursuit of larger joys. With its tagline of “Har cookie mein kayi Smiles.” Good Day will act as an enabler in enjoying all those small moments in everyday life! This rich cookie enjoys a fan following of consumers across all ages, loyal to the brand promise of a great taste, evident from the visibly abundant ingredients. My children enjoys it's taste and even ask me  to give them to school.If you want to eat biscuit at any time try britannia good day.It can be a good snacks when you areout or even when any guest comes home.My husband also likes to eat britannia good day any time he wants.It became a good time friend of me at tea time and when I am out for any long period. Finally I suggest Britannia Good day biscuit for your family to keep your family healthy."}], {"shiv50": " In 100 gm serving size of the Britannia Good Day Biscuits there is 24 gm of sugar. This food product does not specify which sugar has been used. This is important because different sugars have different metabolic effects. For example, Sucrose(Cane Sugar) is very different from Fructose(Fruit Sugar). Some foods use high fructose corn syrup which may be harmful in much lower quantities than sucrose.  We believe that it is not responsible behaviour for a brand to not clearly state what ingredients have been used.", "kranthiraj70": " Good Day is one of the famous brand names of Britannia. biscuits are consumed almost daily as snacks and in large quantities.it has many types like badam pista.i have tried all flavors .i liked it very much.i ll have it them at evening  times with tea.among all kinds of biscuits I love only good day because  they are very very tasty.taste is very nice and at a very decent price of rs 10.The other flavoures are also available in market like choco chips, rich cashew,", "028vivek": " These biscuits come in a very luxurious looking box. These days, it has become trendy to launch luxury cookies in a giant box. It does look nice! Inside, all the biscuits are individually wrapped. Full points to the packing.s 50 for 100 grams, that’s 6 biscuits only. What’s with this high pricing thing, huh? We expect some decent pricing, are you listening Britannia!s 50 for 100 grams, that’s 6 biscuits only. What’s with this high pricing thing, huh? We expect some decent pricing, are you listening Britannia!s 50 for 100 grams, that’s 6 biscuits only. What’s with this high pricing thing, huh? We expect some decent pricing, are you listening Britannia!", "bibhuti227": " Britania ia a famous brand for its grocery item like biscuits . there are many biscuits available with britania tagline but I love good day very much.there are many variants available for good day like chocolate, cashew, butter and many more . few months ago britania was offering a recharge of 10 with 10 rupee good day biscuit pack. taste of this biscuit is very good . I just love chocalate flavour other flavour like cashew and butter are also quite good.", "guleriasunny08": " Britannia good day is very good cookies biscuits and added butter give it fabulous taste.according to me their is not any alternative for it.it will give you unexplainable feel when you put it in your mouth.i have awsome experience for good day.alsmost daily at evening snack I use it to eat.And I suggest it to my friends also.they also like it.itz amazing bizcuits far better then other brands.and health wise its also good not high in fat and sugar and nil trans fat.so buy it and enjoy it.", "david001": " HiBritannia undoubtedly remains a market leader for much of its strength is derived from its strong consumer equity.but I m not really convinced about Britannia’s positioning as health-cum-enjoyment. according to me taste and health are mutually exclusive in the Indian context.Talking about the negative aspects of good day biscuits.The wheat flour(which is white refined flour or maida) which is the major ingredient in the preparation of biscuit, this is followed by sugar and edible vegetable oil. Both refined flour and sugar(which form the bulk of the biscuit) are bad for our health. But luckily this biscuit does not contain hydrogenatedvegetable fat which is unhealthy, but just vegetable oil, which means no transfats.It’s said that naturally occurring transfat(found in dairy products and some meats) is not harmful  but artificially produced transfats as in hydrogenated vegetable oils are extremely bad for health and are a factor in causing heart disease.Gooday also contains nuts, butter, milk solids, but they are present in tiny quantities and in any case all are highly processed.As such they are not as nutritious as they would be in their natural form. And then there arethe additives and chemicals which is not good for health.A little fat and sugar isn't bad for health, so the occasional biscuit should be OK - just not very often.", "anwarshekh1111": " Greetings everyone Good day Biscuits is a result of Britannia and I taste it since my youth. What a scrumptious taste that can not coordinate with some other Brand. There is margarine, Kaju, Pista and Badam in this Biscuit. At whatever point any visitor went to our home we like to serve it with blend. Presently I turned into a Young and there such a variety of changes come into me.There is no adjustments in the essence of Britannia Good Day.But there's no any adjustments in Good day, its delectable as it was.Good day is a standout amongst the most heavenly pocket inviting crunchy scones I ever taste, it makes me feel great to have in with tea, best accomplice for tea . it comes in different flavors like choco chips, cashew, nuts and so on .", "jyotiprakash207": " THIS BISCUITS IS DELICIOUS  AND AVALABLE AT REASONABLE PRIZE AT 35 RS.VERY CRUNCHY SWEET AND TESTY.THE BRITANNIA BRAND AQUIRE FAITH OF PUBLIC.ONE CAN EASILY TRUST FOR THE FOOD PRODUCT OF BRITANNIA, A VERY LONG PERIOD OF TRUST AND TEST, SIZE AND SAPE OF BUSCUITS IS ALSO VETY BEAUTIFUL.ITS VERY HEALTY AND GOOD FOR BREAKFAST AND TEA.I JUST LIKE ITS FLAVOUR AND TEST TO I PREFER IT.IN REACH OF COMMON MAN ITS A VERY GOOD, TESTY AND AVAILABLE AT REASONABLE PRIZE AT 30-35 RS", "kantibhai912": " Aajka toh ho gaya re Good Day!. ring a bell this tagline has essentially become a part of every Indian lingo. With a name so jolly, Good Day biscuits .i like it very much .everyone should test it. Flavor  is too good . I have bought it beacause of flavour . I like more verity in this also I like kaju very much everyonr should try thisBritannia must have engaged their quality control people to check QUALITY and HYGIENE during third party production.These adhesives are normally twin system, one part is adhesive and the other part is hardener.", "wadhetushar": " Every one in world starts his day with biscuits.My and my family also starts day with eating biscuits with tea in the morning.This fashion that taking biscuits as break fast with tea.People think that it support for stomach till you do not take lunch.I was also the person thinking like.My family was taking britannia good day biscuits We were big fan of this brand, but one incident tells us how these biscuits are dangerous for our health.My three years girl was not taking meal.She was not felling hanger if she did not takes meal for a day.We went to doctor He check my child and He asked us what food we gives us as we mention about biscuits .He told us side effect of biscuits.Britannia is big brand in biscuits,but they use a material to make biscuits are not of good quality.They use the sugar having bad quality.The sugar is not refined sugar.Now a days sugar is very costly and britannia biscuits are very cheap because they use bad quality sugar.They use hydrogenerated vegetable oil in biscuits.This is dangerous for our health.Britannia use nuts, butter, milk solids to make biscuits by using chemical process.These all are danger for our health and it kills our emotion of felling hungry.From that day we stopped eating Britannia Good Day Biscuits.", "devendra31772": " Britania good day biscuit are very yummy crunchy and tasty. My favorite is pista badaam flavor. It contains lots of chopped pista and badaam. The other flavoures are also available in market like choco chips, rich cashew, rich butter etc.These biscuits are much better in comparision with local made biscuits in markets as well as better then bakery made cookies.I eat these biscuits when I feel hungry during travel. I always keep packets with me and eat when ever I feel hungry.Britannia Good Day was launched in 1986 in two delectable avatars - Good Day Cashew and Butter. Over the years, new variants were introduced - Good Day Pista Badam in 1989, Good Day Choco chips in 2000 and Good Day Choconut in 2004Its a very nice product from Britania. These biscuits loved by every one from kids to old any body enjoys it.", "jatinderangural": " This is most famous brand in India me and my family also eat Britannia biscuits. I am not joking it's real most people's in India like this brand. Lowest price and good quality that is Britannia biscuits. I know you are also  his followers and take this brand biscuits. Everyone like Britannia biscuits  who's child, younger and old age.  East or west Britannia biscuits is the best I am like only this and not take another Brand biscuits", "RK4U206": " Good Day Biscuits are one of the best biscuit available in India, really testy and yummy.even my little son loves it's taste too, he only eat this biscuit.My favorite one among all the variants is Good Day cashew &amp; nuts, put it in your mouth keep your eyes closed and enjoy the taste as it melts in your mouth, delicious really delicious.It comes from the house of Britannia which in itself is a big brand in India &amp; abroadSo taste and make your day a really Goooooooooooooooooooood day.", "DEKA009": " Dear all,The most popular and tasty biscuit now days and highly recommended.taste is very nice and at a very decent price of rs 10.its is healthy biscuit go for it.Good Day is one of the famous brand names of Britannia. Britannia good day is one of my favourite biscuits.its tasty and crunchy and nuts put in between made it even more tasty.i eat it whenever I feel hungry in evening and sometimes I dip it in milk or tea and have it.product quality is very good and packing is also good.It is very delicious in taste . It comes in various packets . I eat it from my childhood. There is no match in comparison to good day biscuits . It’s really taste like butter and cashews in it . It gives a enrich taste .", "DesignOnContract": " So poor in taste.every time when I eats, I found it so much gummy.no good in taste, when I put it outside from the warp, withing a moments it gets damp(Dampness), so much bad in taste, and Stay put in mouth, I feel it even after eating 30 mins, in my mouth.I found it so so much gummy. very poor in tasteit should be crisp atleast for 5 minutes, but its notit poor taste, I don`t like it all,I suggest you to dont buy itThnaks", "naveen25356": " In last few days I got more weight and tired to walk or so something.The doctor suggest me to avoid junk foods and keep to do exercise.For this purpose I avoid break fast.But its too difficult to manage the day.So I started to eat britannia biscuits.Its really helpful to eat low fat food.Its tasty also.So I preferred its better for break fast or snakcs time.I also suggest to some of my friends while they eating some junk foods on tea time.Then some of them was like to eat this biscuits and they suggest to some of them friends.Finally in my team of friends mostly eat this biscuits at tea time and some of them take the biscuits as a break fast.n last few days I got more weight and tired to walk or so something.The doctor suggest me to avoid junk foods and keep to do exercise.For this purpose I avoid break fast.But its too difficult to manage the day.So I started to eat britannia biscuits.Its really helpful to eat low fat food.Its tasty also.So I preferred its better for break fast or snakcs time.I also suggest to some of my friends while they eating some junk foods on tea time.Then some of them was like to eat this biscuits and they suggest to some of them friends.Finally in my team of friends mostly eat this biscuits at tea time and some of them take the biscuits as a break fast.", "bhagwatab2017": " Britannia Good Day Biscuits is very testy  biscuits in that time. And also Britannia is very popoular buscuit company  in india. Britannia companys more food products. But Good Day buscit is very populer biscuite ever. I like very much this biscuit.I eat this britannia biscuit dealiy morning  and evening time. I eat this biscuite with tea and coffee.This biscuit  is made a pure vage. No any additional content are include. Compare  to other biscuit this is good biscuit for eatring.", "tausifhashmi372": " BRITANNIA GOOD DAY biscuits are very tasty, i have tried almost all flavours of Britannia but my favourite biscuits are BRITANNIA GOOD DAY and I cant stop myself from eating them, out of two flavours I liked the most rich cashew cookies and it will  be more delightful when it will be taken along with a cup of tea, and they are much better than any local biscuits or cookies from bakery, when I was in class 5th I remember the slogan and still chants in my ear'BRITANNIA KHAO WORLD CUP JAO\" at that time I used to take 5-6 packet of cashew flavour from the market on per day basis and the year became memorable for me and I was sharing with you all so please enjoy everyday in the morning with britannia good day cashew, pista, rich butter cookies flavours.", "sainibrothers0688": " The most popular and tasty biscuit now days and highly recommended.taste is very nice and at a very decent price of rs 10.its is  healthy biscuit go for it.one can have it with a cup of tea and it's good for children's as well.easily available in market and most of people using it.britania name is enough.", "kiranawesome2605": " Britannia Good Day is one of the tasty, crunchy and mouth watering cookie.I don't think anyone who taste it will forget the taste in their life.Its taste is just awesome .Wherever I eat this biscuit I can't stop eating .Desire won't get satisfied I feel like eating more and more.Good day biscuit is one of the way to express your love towards a person.During my school days my mom use to give these biscuit whenever I was angry on her.I give to my younger brother to get a kiss.And many more.I like this biscuit very much.My day starts with good day."}], {"renuagarwal0302": " Britannia good day is one of my favourite biscuits.its tasty and crunchy and nuts put in between made it even more tasty.i eat it whenever I feel hungry in evening and sometimes I dip it in milk or tea and have it.product quality is very good and packing is also good.price is very reasonable according to quality they provide and it comes in good quantity, its healthy also.everyone in my family like it very much.in our home it comes in lots because everyone like to have it.i would definately reccommend ypu to buy this reasonable, tasty, crunchy biscuits, if you have taste like me you will definately love it.", "mohnishkr16": " I am always use to eat this \"Good Day Biscuits\" from my childhood to now, it is the best snack for all time. when you will unwrapped this and you can't stop to stop yourself without eating this delicious biscuit.Britannia good day biscuits are very tasty and yummy. I have tried several flavours of Britannia Good day biscuits, all are very good. very tasty and full of nutritious. My favourite is cashew as it contains lots of chopped cashew. other flavours are choco chips, pista badam. they are better than local biscuits or cookies from bakery. Now a new variant of Britannia Good day is also available in the market.", "yateshre": " BRITANIA GOOD DAY HAS A UNIQUE TASTE BECAUSE OF CASHEW'S RICHNESS.WHEN I WAS IN HURRRY FOR OFFICE MY PARENTS ALWAYS GIVE ME A PACKET OF GOOD DAY AS IT ALSO PROVIDE ENERGY FOR THE WHOLE DAY. BRIATNIA GOOD DAY REALLY MAKES THE WHOLE DAY GOOD. THE PEOPLE WHO LOVE TASTE AND QUALITY SHOULD BUY THE PRODUCT .YES COMPARE TO OTHERS IT IS COSTLY BUT AFTER BUYING IT U CAN'T GET BETTER THAN THIS.I ALSO PREFER TO GIVE THIS BISCUITS AS A GIFT BECAUSE OF IT'S ROYAL LOOK", "imdadhussain": " Today I am talking about the britania good day biscuit.britania is reputated brand of biscuits.i regularly eat good day biscuits.specially in the evening, I eat it.the flavour of the biscuit is very good.it has some nuts inside.so its very testy to eat.or contains many nutrition ingrediants.which are very good for our health.the packaging of the biscuit is very classy and shiny.", "ushabharti101": " I have been eating these biscuits for the last 5 years as my breakfast. It has awesome taste with cashew and pista with spread. so love to eat . likewise have extraordinary bundling of scone so you can store it for long time additionally keep with you in the event that you going to travel becouse of it’s incredible pressing.I want to say you that this buscuits contain lots of energy.its avilable in all over markets in world and its price is very cheap. You know thats this buscuits gets high personallity but this buscuits avilable for all types of people.when they are poor or rich .i truely love this buscuit.The packing of this Good Day Biscuit is looking very nice and decent.Good Day Biscuits price also not too high price this is reasonable to everyone, with the low price we are getting the good quality and good quantity biscuits. The name of this biscuit GOOD DAY is really very suitable to this Britannia Biscuits.Aditionally it is quite heavy which eleminates hunger.", "SNEHASHIS462": " Good day is one of the most tasty pocket friendly crunchy biscuits I ever taste, it makes me feel good to have in with tea, best  partner for tea . it comes in various flavors like choco chips, cashew, nuts etc . each and evry flavour are good, I like the choco chip flavor most, as it covered with lots of  small choco chips and has a good taste of chocolate, I enjoyed it with a cuop of tea, its a healthy snack, good for health . so its a very tasty biscuit.", "parvinderkaur456": " Hi. Everyone, Britannia Good day biscuit is my favorite for each and everytime time and at anywhere. As I have make stock in home each and everyday only with britannia good day so that when I get hungry I can eat. Once when I am at alone in home I didn'd know how to cook well for my breakfast so when I see britannia good day biscuit I eat suddenly and then later my hungerness gone.So it's very tasty and my favorite biscuit.", "dhimanshikha32": " Britannia good day is my whole faimly's favourite  . you can eat this biscuit any time it may be your breakfast  or evening tea . it gives you a complete hunger solution with good nutrition and offcourse the tasty pista and badam flavour is awsome  and it increase its nutrition value .i love and recommond this tasty biscuit .", "basantkhatri84": " Good day Biscuits is a product of Britannia and I taste it since my childhood.What a delicious taste that can not match with any other Brand. There is butter, Kaju, Pista and Badam in this Biscuit. Whenever any guest came to our house we prefer to serve it with mixture.Now I became a Young and there so many changes come into me.There is no changes in the taste of Britannia Good Day.But there's no any changes in Good day, its delicious as it was.", "kumarsksk10": " BRITANIA GOOD DAY HAS A GOOD TASTE BECAUSE OF CASHEW'S RICHNESS.WHEN I WAS IN HURRRY FOR GO TO WORK MY WIFE ALWAYS GIVE ME A PACKET OF GOOD DAY AS IT ALSO PROVIDE ENERGY FOR THE WHOLE DAY. BRIATNIA GOOD DAY REALLY MAKES THE WHOLE DAY GOOD. THE PEOPLE WHO LOVE TASTE AND QUALITY SHOULD BUY THE PRODUCT . COMPARE TO OTHERS IT IS NOT  COSTLY BUT AFTER BUYING IT U CAN'T GET BETTER THAN THIS.I am always use to eat this \"Good Day Biscuits\" It’s a Smile that makes it a Good Day!", "yadavsani": " Maine ye biscuits sabse pehle 10 years ki age mai khaya tha tub se mai iss biscuits ko pasand karne laga hu. mere ghar mai mujhe ye biscuits sabse jada pasand haiiska suadh mai bhul nahi paata hu lakin iska price bahu jada hai company ko iska price thoad kam kar dena chahiye jisse sabhi log isse kha sake or iska swaad le sake .ab isski tarif mai or kya keh sakta hu or mere pass koi sabdh nahi hai.", "slcradha": " Good biscuits are very good biscuits .they very tasty and healthy. when you eat this you feel great taste. If you are hungry and you dont have anything to eat, Buy good day biscuit from any general store and eat . it will put out you hungriness quality biscuits. I have eaten these many times. My kids always demand for the same. These biscuits come in two varieties one in butter and other one in Kaju. But I like most Kaju biscuits . They are very tasty.Good day company is very old and trust able. Thats why it has made its place in the business era.Good day biscuits have many good ingredients. They are always crispy when you eat you feel good. These biscuits price is very low; Price of these starts from 5 rupees so that everyone can afford it", "rohit1705": " I eat these buiscuits  oftenly atleast 2-3 times in week. These buiscuits are rich in taste, their cashew toppings. The best and the most preferred way of eating these buiscuits is with a cup of tea. It gives you delicious taste with tea. There are also other flavours like almond and cashew, butter; but the original cashew taste's good enough. The product quality is worth but I am not satisfied with the quantity. It contains only 25 gm in 5 ? packet and vice versa. Overall the product satisfies both in quality and taste but lacks in quantity. Everyoune should try these buiscuits.", "ritwikjoshi": " It’s a Smile that makes it a Good Day! The smaller joys of life that can brighten up one’s life everyday often get ignored in the pursuit of larger joys. With its tagline of “Har cookie mein kayi Smiles.” Good Day will act as an enabler in enjoying all those small moments in everyday life!In its brand new tastier avatar, Britannia Good Day brings alive its philosophy of Smiles through its new Logo, packaging and cookie, the New Good Day cookie comes with a smiley design on it as well!Britannia 's power  brand  Good day  completes  its  25 years of existence launched in 1986   and is worth more  than  Rs 100 crore brand   rightly placed  as one of the power brand from Britannia .which includes Marie, Milk bikkis, Bourbon, Fifty - Fifty,  Nutri choice .Its origin can  be attributed to the  Britannia  R &amp; D which bridged  the  gap  of biscuit and cookies . Good Day  is the major  product  as far as market leaders  from Britannia is concerned . Good Day  biscuits could not be replicated by competitors  like Parle, ITC and now  United Biscuits . Of course  Unibic  has come closer by creating a cookies niche  in biscuit segment successfully .Rich  in recipe  the  Good Day  has  been popular among masses  with its  bite and taste . In addition Britannia   has used  ingredients like  cashew, pistacchio  and  chocolate  to add spice to it brand.Good Day  biscuit  has now many variants  such  as   Butter, Cashew, Pista, Chocochips, Choconuts . Britannia has planned to showcase Good Day  with human touch in its tvc and media campaign .", "gaurav4689": " Biscuits are our daily bread but times have changed. we all know more about biscuits and what they contain. ingredients in britania good day biscuits like hydrogenerated vegetable oil aren't good for us. nor is refined sugar, refined flour or additives. that's what most britania biscuits are made of. even the so called \"healthy\" ones. goodday also contains nuts, butter, milk solids, but they ar present in tiny quantities and in any case all are highly processed.", "patkuranirudh": " The good day biscuits are very delicious I like it. Once I unwrapped the cookie, I found myself face to face with a healthy-sized disc with which I could play frisbee(not quite). The cookie looked good: sufficient chocolate chips, rough texture, cookie-like appeal However, after the first bite, I wasn’t too impressed. The cookies are hard and definitely not “melt-in-your-mouth”. I prefer soft, crumbly cookies(more American) vs the British hard cookie. That’s a personal preference, I guess, but aside from that there was an artificial flavour in the cookies.", "dul48": " Possible to present my country biscuit products are not sold, but I never felt from a relative who had worked in India precisely in New Delhi. When he returned home he brought a souvenir biscuit is one of them. Initially I was hesitant to eat it, because I am a Muslim, so I had to make sure there are no ingredients that make these biscuits becomes not Halal. For my personal taste of this biscuit-like biscuits baby and quickly disintegrate in the mouth. To think I admit is really delicious.", "satyapriya258": " THIS BISCUITS IS VERY GOOD QUAILTY AND THIS COMPANY GOOD COMMUNICATION BETWEEN CONSUMER.BRITANIA GOOD DAY HAS A GOOD TASTE BECAUSE OF CASHEW'S RICHNESS.WHEN I WAS IN HURRRY FOR GO TO WORK MY WIFE ALWAYS GIVE ME A PACKET OF GOOD DAY AS IT ALSO PROVIDE ENERGY FOR THE WHOLE DAY. BRIATNIA GOOD DAY REALLY MAKES THE WHOLE DAY GOOD. THE PEOPLE WHO LOVE TASTE AND QUALITY SHOULD BUY THE PRODUCT . COMPARE TO OTHERS IT IS NOT COSTLY BUT AFTER BUYING IT U CAN'T GET BETTER THAN THIS.", "vishalmaji178": " I really like BRITANNIA products.About GOOD DAY biscuits its really make my day when ever I taste it.I usually have it when I use to drink milk or with tea. I really like its taste and its having various types of varity also and I tasted all Good biscuits and really loved it so awesome.It eat anytime morning or evening any time of Day.It is very good for health.Its have many flavour all flavour tast is very good.But many times I see many biscuit are broke in packet so I recomend **\"Please care when transper the boxes or move the boxes for delivery to shopes.\"", "gurtaj01": " Good day biscuits are of Britannia company . It is very delicious in taste . It comes in various packets . I eat it from my childhood. There is no match in comparison to good day biscuits . It's really taste like butter and cashews in it . It gives a enrich taste . I carry it when I was in travel , picnics, weekend getaways.  I always take it with me. It is not costly to buy . It's quality is superb .??????"}], {"kulshreshthapk": " My day starts with Britannia Good Day Biscuit only. With my bed tea I take two biscuits without fail. It's yammy taste is amazing. Cripsy and creamy flavor with small pieces of cashew nuts make it more favourite to everyone irrespective of age. Consistency in quality is the main feature of Good Day Biscuits.", "bhb_1988": " I have been eating this Britannia Good Day Biscuits from almost it's inception. But I  must say that Britannia Good Day is really making my day really a good one when taken in my routine breakfast.I Like the test of this biscuits very much along with Tea. It's Flavor is really awesome. I do recommend every one this biscuit because it is rich in test as well as proven to be healthy for giving calories that are sufficient for our body up to an extent.", "rajugorai6": " We known no age limit and no place for eat biscuits its very nice and every body eat it. we also known many type biscuits are sell in market by different company.In any country all biscuits brand like by people no any company very bad or very good.Britannia is a good company in eating fields like that britannia cake, biscuits and many more, this company are like by all people.biscuits can eat normally or with tea but not for diabetes patient.Diabetes patient use sugar free biscuits.", "shaker302": " Britannia Good Day Biscuits are very tasty and tasty the biscuits are very healty to eat it taste was very amazing this brand is a very organial and this company is a very nice in the biscuits so many kaju and we can eat with the milk also it is healty biscuits to children and to old man it is a very smooth it round shape is very nice it has butter this biscuits have so much energy it is a very high quality it rate is 5rupees only easly any one can buy and eat specaly children can buy easy it is available any shop and it packing is very good it packet colour also good", "kunalchoudhary9": " I really like Britannia products and about Good biscuits its really make my day when ever I taste it.I usually have it when I use to drink milk or with tea.I really like its taste and its having various types of varity also and I tasted all Good biscuits and really loved it so awesome.packing also nice and also not cost that much. I really like the buttery texture of these biscuits and they just melt so smoothly in your mouth.I really love this brand product.its just muuuaaah.", "singhpintu637": " Now I tell qualites of good day buscuit's its contain high nutrition and also contain kaju and butter that's are good for our health.this biscuits have already high personallity in markets.i was firstly tasted this buscuit in my life.and that's amazing its contain great taste .so I am always use this buscuit.in every small parties with friends.i am always eat this buscuit in morning with tea or coffee.this company always take care of our health its contain high carbohydrate. Carbohydrate means fat and fat means energy . I want to say you that this buscuits contain lots of energy.its avilable in all over markets in world and its price is very cheap. You know thats this buscuits gets high personallity but this buscuits avilable for all types of people.when they are poor or rich .i truely love this buscuit.and my family also love this buscuit. We are always use this buscuit in our life.now this gets more better than after.there mobile networks now reachs this buscuits avilable there.its a very large comany of buscuits products and I was suggest my friend for eat this biscuits now they all are eat this buiscuit day or night .i am relly ccrazy for this  biscuits I am always buy this from shop.and shopkepper say me why you are always buy this biscuit .i say him that beacause it is the world best buscuits in the world.So now I suggest You  all always buy this buscuits and eat this.i again tell you all its takes care of you and your family", "rupali1": " Britannia is a very well known Brand and I ate almost all flavours of Britannia Biscuits. It is needed to mention that I like salty biscuits more than sweet biscuits. My dentist advised me to stay away from sweet foods as they can produce caries. Britannia Good Day can make someones teeth bad by producing caries. That is why I do not like Britannia Good Day biscuits. If someone losts his teeth for eating such biscuits than they must regret later. So I am not going to suggest anyone to eat such biscuits.", "tanvitalwar17": " Biscuits  are very crunchy.Very good packing.Its has very delicious taste.I am  eating it  since long time.But I never get bored upI can say they are evergreen.We start our first teawith these tasty biscuits,People should buy this  beacuse not cost much.available in  R5/- also.Good taste is less pricing.Brittania has nice name  and I trust there product.It has many falvours also.Cahews, butter etc.I like Cashew  flavour.I buy daily one packet because its nice.Tasty and affordable.Packaging is good.Also available is small packets and big family packets.Good option for gifting someone.I make baskets of these biscuits during diwali time and gifts to may friends and relatives.I think everyone in india once tried these.", "chandana6d": " Good day biscuits  are the one of the most helathy, tasty biscuits in differnet varieties, Early in the morning when we eat them along with the tea it enriches teh flavour and health, There are in different varieties, there come in butter, cashew, fruit and nut and many other flavours, There are healthy and good for health, even children can eat them without any hesitation.I recomened this for all age groups, when you eat them its going to a real good day .So keep the good day for all age groups in your house.", "HARUNSHEKH": " It has awesome taste with cashew and pista with spread. so love to eat . likewise have extraordinary bundling of scone so you can store it for long time additionally keep with you in the event that you going to travel becouse of it's incredible pressing . additionally have great size so you can dunk in your Tea glass effortlessly", "praveenkumarreddy59": " I love to eat Britannia Good Day Biscuits, this biscuits are very very tasty and yummy. The Britannia Company has good fame in the Market, the Britannia Company manufacturing this Goody Day Biscuits, these biscuits are very crispy and fresh. I addicted for this Britannia Good Day Biscuits really it is very nice, there are no age limit for this Good Biscuits, even adults are also enjoying with this Biscuits.The packing of this Good Day Biscuit is looking very nice and decent. On this Good Day Biscuits arranged small pieces of cashew nuts it brings very tasty. The company was established in 1892 year in Kolkatha, initially it was started with small. In this Good Day Biscuits there different flavors are available in the market. This Britannia Good Day Biscuits are very famous biscuits and very crispy and smooth biscuits to eat. Good Day Biscuits price also not too high price this is reasonable to everyone, with the low price we are getting the good quality and good quantity biscuits. With this is Good Day Biscuits there are no problems to teeth we can eat happily sufficient biscuits. The name of this biscuit GOOD DAY is really very suitable to this Britannia Biscuits. Here I request to all eat this Good Day Biscuits and start with the Good Day in your life. Yes somebody like one taste and somebody like the another taste but I LOVE FOREVER THIS BRITANNIA GOOD DAY BISCUITS.", "isr369": " I like biscuits. I am also more interesting to eat Britannia Good Day Biscuits.The britannia good day biscuits has launched in the 1986.This biscuits has good and excellent tast.This biscuits are more healthy and sweet.This biscuits are very very taste and healthy.This biscuits are used in the world wide.The good day biscuits are consists of excellent quality.The good day biscuits has good and amazing excellent quality of products.", "boneypatel9090": " Britania Good Day Biscuits is one of the best popular biscuit forever. I have been eating this biscuit for the past so many years and it' s taste is such that I just can't stop myself from eating them.I have generally seen two flavors of this biscuit - rich butter cookies and rich kaju cookies.Out of the two I like rich butter cookies more.The biscuit is quite crispy and it tastes the best when taken with a cup of tea.A Rs. 5 packet of rich butter cookies has 6 biscuits in the packet and weights 39 grams.The biscuits are made of refined wheat flour, sugar, butter and edible vegetable oil.The biscuit is easliy available in the market.You can easily carry them as well since their size is very small and can even fit in your pocket easily.The only thing that I found as a drawback in this biscuit is that they are quite dry and you can't eat the entire packet without having a liquid drink with it.So I often have them with a cup of tea or even some sips of water in between can help to gulp down the biscuits into your stomach.But I will again say that the taste of the biscuit is really good.I will give 4 out of 5 stars to this biscuit.", "mrrdsaifi5258": " I bought a packet of good-day biscuits. The biscuits of that packet were totally bad/useless.They all were black who couldn't have been eatable.when I complained of that biscuits to Britannia Industry then after a long time a quality executive had come for taking the sample.and I said to him to give me a proof of this that he is taking my sample of biscuits.but he refused.and now.i complained again .but still they didn't give any reply of my complained.date of the incident:26-8-2016I purchase a good day biscuit .all biscuit is black .the shape in not good.product lot no. A0516K5machin cod 32Apkd. 15/05/16", "shuva12": " Britannia good days biscuit is very popular for everyone and its taste are to much awesome.good day company is a very popular company now a days.Its special features is all of flavors are awesome.when I'm very hungry then I always want to buy this product.its also healthy product.fresh creme and also very crunchy . chocolate flavors are damm good.its price are very low.so everyone buy this product.i love always this biscuit.britannia company very old and most trustable company for all customer.it is best biscuit of all the time.", "rockylwj": " I with my family have Britannia biscuits most of the times early in the morning with tea.It tastes good and is healthy. It is getting popular . It is crispy and creamy flavor with small pieces of cashew nuts makes it more desirable  to everyone irrespective of age. Consistency in quality is the main feature of Good Day Biscuits.Generally there are two flavors of this biscuit - rich butter cookies and rich kaju cookies.The biscuits are made of refined wheat flour, sugar, butter and edible vegetable oil.It is easily available in the market", "maxican111": " This scones are there from over 10 years now uniquely britannia great day is a best one. since it contains cashews and different nuts stuffed inside it.but this roll will contain parcel of margarine which is bad for wellbeing furthermore this is comprised of maida so be carefull befoe picking this scones. what's more, the measure of sugar is a lot in this, so its a complete no for diabetic patients furthermore it doesn't have any fiber in it. so I propose to go for patanjali scones which eveyone is inclining toward nowadays, since its sound and heavenly too, and when you analyze the value this has a lot of cos then patanjali, so its better to go for characteristic made rolls of patanjali then picking maida made .", "rp000215": " It is the best brand of biscuits in front of me.The company was established in 1892, with an investment of ?265 and the biscuits were manufactured in a small house in central Kolkata. Later, the enterprise was acquired by the Chugh brothers mainly Bhavya chugh, a renowned attorney, and operated under V.K Brothers.\" In 1918, C.H. Holmes, an English businessman in Kolkata, was taken on as a partner and The Britannia Biscuit Company Limited(BBCo) was launched. The Mumbai factory was set up in 1924.It has too many kinds of biscuits, cakes but one of the biscuit is good day.It is the good biscuit .The ingredients used in it are Wheat Flour, Sugar, Vegetable Oil(Palm Oil), Butter and Skimmed Milk Powder(from Cows and/or Buffalos Milk), Cashews(5.2%), Leavening(Ammonium Bicarbonate(E503), Sodium Bicarbonate(E500), Salt, Emulsifiers(Mono Diglycerides of Vegetable origin(E471), Soya Lecithin(E322), Artificial Flavours(Butter, Vanilla, Nut) and Annatto Extract(E160b).It contains  Wheat, Milk and Cashew Nut.It is a reputed company of biscuits so you may buy the products with trust blindly.", "sadiasabrina302": " What could be better than a biscuit which consist of all the possible nutritious, milk, cream, nuts in just a single bite. Yes, britannia good day biscuit gives you every sources of energy in just a package. Your children may find it tough to complete their breakfast due to rush with school timing so no more worries purchase britannia and hand them to eat and to gain energy equal to a delightful breakfast.", "preyasparker": " I always go for Britannia and particularly Britannia Good Day Biscuits.This is one of the tastiest biscuits I've had and doesn't cost you very much as compared to those expensive cookies.I really like the buttery texture of these biscuits and they just melt so smoothly in your mouth.It tastes amazing with hot milk and a perfect partner for tea. I like to have them as a morning breakfast or as an anytime snack. My younger brother loves to have it."}], {"arvindtiwari7555": " Britannia good day is my favorate biscuit.I eat it from my childhood.I eat it with tea , cofee, Juicee and its tast come woth enything even with water.My full femily eat this biscuit.It contain kaju, kishmis, badam etc types of tasty froots.We have too many biscuits in the market but no one can match with Britannia Good Day.And their addvertiesments are always looks different and very interesting.I am eating this from my childhood and I still alive so its quality is not even close to danger.I like their butter biscuits these are more tasty.if you do not like its flavor than try the butter biscuits.you will fall in love with this.", "singlamohit21": " Britannia Good Day Biscuits are the best evening snack. Whenever I found myselfhungry I ate it.It is best in taste and quality as compare to other biscuits.The price of this biscuit also very cheap.i always carry some of its packets in my bag.The taste of this biscuit is very good.Even children enjoys its taste.It is available in various varities like cashew, nuts, butter cookies and cholotes etc.Which complete the demand of all segments.Thats why I recommend these biscuits to enjoy tea time.It is my all time favourite biscuits.", "lifemoment84": " Best company of Britannia its very tasty and the nuts added in the biscuitbrings more taste than the other biscuits.The price of the biscuit is low as which the all kindof people can buy the biscuit Its very tasty, eat all age groups  kaaju badam good day is very tasty yummywere very treated of eating this.Its mainly used in my tea hours.With the tea the biscuitis really very delightful when ever we get break and we need to eat something as snacksthe Britannia Good day biscuits comes in the mind of many of us I like Britannia biscuits and compny is very old", "tushar88": " Britannia goodday is the most tasty biscuit I have tasted ever .i eat them every day and they mak a perfect combination with tea .the pista flavor is a bit different but other two butter and cashew flavour are mouth watering.cost is also economical .hope they do not contain chemicals or flavouring agents in high level .but britannia do not make others biscuits of same level as goodday. I want all my friends to eat and comment your review on my post.", "naal9741": " This biscuits are there from over a decade now specially britannia good day is a  best one. since it contains cashews and other nuts stuffed inside it.but this biscuit will contain lot of butter which is not good for health and also this is made up of maida so be carefull befoe choosing this biscuits. and the amount of sugar is too much in this, so its a complete no no for diabetic patients and also it does not have any fiber in it. so I suggest to go for patanjali biscuits which eveyone is preferring these days, since its healthy and tasty as well, and when you compare the price this has too much of cos then patanjali, so its better to go for natural made biscuits of patanjali then choosing maida made .", "earnmoney28111984": " Britannia company is very old trust full company Good Day Biscuits are the very good biscuits in the market They are tasty, hygienic and with cheap price. Every body whether rich and poor can buy this biscuits. They are available in various varieties. They can be purchased even by paying only Rs.5/- and 12 Rs for a small packets.  sweet and crispy that even an old man can eat it easily. They are packed so nicely that it can be kept without damage for weeks.I appreciate the biscuit very much. I love britannia biscuits", "ashokmallick": " The biscuit is very testy, Children are eaten very much.It's healthy, because the biscuit making so much ingredient, That's like wheat, sugar, vegetable oil, butter, milk powder, soya and salt.The biscuit price list is so sweet.That means Rs 10 to Rs 39 .Everybody can eat this biscuit.The biscuit is eat with tea and milk.The Britannia good day is divided in verious namely.That's like Britannia Good day Cashew, Britannia Good day Chocochip, Britannia Good day Butter, Britannia Good day pistabadam, Britannia Good day Chunkiness. Chunkies packing was very good. Tasted good as always.I received it in good condition. Chocolate chips in this cookies add more taste. Cookies are delicious. It is specially recommended for chocolate lovers.Bough these Chunkies when it came on offer since, then I have purchased it many times from the market. They are definitely chunkies as the seller describes it. The Cookies are crunchy on bite &amp; then melts into your mouth. The chocolate chip cookies are also adequately put in, with each bite a chocolate chip comes into your mouth. Everyone in the family loved it.", "manjuvicky": " Britannia Good Day would be loved by all aged people. It stops the hunger in you when you had it. I like the Cashew flavor one. I like it from my childhood. I used to buy when I go to school. it is the favourite snack for many children. It will be good when it is crispy and crunchy. it can be crispier even after you open the pack sometime before. compared to other creamy biscuits, it is so delight and good.", "souravmakal": " To start a day Britannia Good Day Biscuit is perfect. This is a taste Biscuit with Cashew flavour and Crunchy. Children always like this Biscuits. When I purchase this Biscuit I attract by this Colourfull packet. When I tavell any where I carried Britannia Good Day Biscuit. Till now if you not try this Biscuit, so must try Britannia Good Day Biscuit.Thank You.", "spicyruby99": " Awesome Good taste britannia good day biscuit, It's good, its made up of wheat flour, butter, sugar, milk and salt milk products, Which is made good and hygienic way.Britannia is good brandcoming from many years .I grow up eating this britannia good day biscuits.It comes in many favours all good in taste.It comes in pista, badam, butter, cashew nuts all are awesome in taste, in pista biscuit is full of pista, in badam same full of badam, and cashew nuts full of cashew nuts in every bite, My uncle buys this biscuits every day .From when I was small my uncle buys me this Britannia good day biscuits, and he use to eat alot.He use to keep in his pockets and he keeps eating it.My mom use to give me this britannia good day biscuits with milk tea and coffee whem I was small its taste awesome. Still now when I get up in morning I have milk and britannia good day biscuit, and with tea its awesome taste with nuts .I love this britannia good day biscuits.Butter britannia good day biscuit is awesome in every bite you feel butter in your mouth.Thanks for reading my review", "gdgsky": " Britannia Good Day Biscuits are the best biscuits in the market They are tasty, hygienic and cheap. Every body whether rich and poor can buy this biscuits. They are available in various varieties. They can be purchased even by paying only Rs.5/- for a small packet. They are so sweet and crispy that even an old man  can eat it easily. They are packed so nicely that it can be kept without damage for weeks.I appreciate the biscuit very much.", "ankit0505": " I have been eating these biscuits for almost 10 years now. the cashew in it is like cherry on the cake. I do not think there would be anybody who would not have tasted these biscuits uptil now. they are my first choice with tea. I always buy 10 packets of it atleast, whenever I go for shopping for my groceries.they are made of maida so do not buy these biscuits if your doctor has warned you against maida.i do not believe in having digestive biscuits. these biscuits are just the right thing . I guess this product of britania will never end in market.", "danish12": " Hello! FriendGood Day is an interesting brand Good Day biscuits mostly use in my house in 70 percentMost important If any of the guests come we provide this biscuit. And suggest my neighbors my mom we use in Good Day brand is good.This product use in all in my house.Britannia when it identified a gap between the glucose biscuit category and cream-biscuit category is tasty.I am survey According to a report in Business Line, the company felt that customers want an indulgence product which they can consume during tea-time.The company provide a biscuit \"Cookie\" category in India by positioning Good Day just above the glucose biscuits.Is a new product was different from the glucose biscuits first I am eat and suggest  my friend and house.by the inclusion of berries and dry fruits.Good Day as a brand was promoted on the basis of the happiness.our daily bread but times have changed. We now know more about biscuits and what they contain. Ingredients in biscuits like hydrogenated vegetable oil aren’t good for us. Nor is refined sugar, refined flour or additives. That’s what most biscuits are made of, even the so-called “healthy” ones.My sugess use Good Day product is nice we all use.", "savik": " Britannia good day biscuits is very tasty and it is perfect match to have with tea. It does have different biscuit varieties. I like the Britannia good day cashew biscuit the most. The biscuit quality is excellent  and I am eating this biscuit for many years.  Good day is well known for best quality and excellent taste, which suits to everybody taste buds. It is very economical and one can easily purchase the biscuit with range from small packets starting Rs 10 to Rs 30.", "atanoob": " Britania britania every day=Good Day is one of the famous brand names of Britannia. Great with tea/coffee or on its personal, it makes fI have been eating britianna biscuits from nearly 10  years and tasted many types, the best facts about the biscuits arethey are still good to taste. The biscuist stays crispy for many days and  also hygenic.It has some variants like Butter, Cashew, Badam Pista, choco chip, choco nutnuts cookie and  also  chunkiesthe ingredients list:-Wheat Flour, Sugar, Vegetable Oil(Palm Oil), Butter and Skimmed Milk Powder(from Cows and/or Buffalos Milk), Cashews(5.2%), Leavening(Ammonium Bicarbonate(E503), Sodium Bicarbonate(E500), Salt, Emulsifiers(Mono Diglycerides of Vegetable origin(E471), Soya Lecithin(E322), Artificial Flavours(Butter, Vanilla, Nut) and Annatto Extract(E160b).Net Weight: 75 gprice range from:-Britannia Good Day Butter Cookies 66 gm- 11gBritannia Good Day Pista Badam 84.5 gm- 25gBritannia Good Day Cookies - Rich Cashew, 200 gm Pouch- 35 gmthese are the all that I have eaten", "mariyamfarooq47": " It is very expensive biscuit in pakistan no one can easily buy because other biscuits is cheap price rate nd too much tasty because we buy nd try this biscuits but britiana good day biscuits is very expensive nd sometimes when go to the market and want to buy this biscuit then I search every where but sales boys says we did not buy this stock becsuse nobodu in pakistan is ready to buy beacuse from india to pakistan its price is double nd thats why we did not buy this biscuits stock nd then I want to buy another biscuit", "samratdey007": " HelloToday I reviewing on Britannia Good Day Biscuits. Start you day with Good Day. Not only me it is that every Indian family from there childhood. I buy this in every 3-4 days because I like this biscuits more than any others. In this biscuit I find lots buttery taste and lots of cashew all the time and it is also hunger craving because its have lots carbohydrates and fats. So its help me out whenever I found myself hungry I just take this biscuits.Except this brand I cant recommended other brands because once I had use other brand that also ingredients cashew but that biscuit only taste like cashew and there packaging is just awful all the biscuits smelling something others and also the biscuits are paste or half in size in packet. but about Britannia you can never find this all the biscuits in same size and good amount of cashew. Here is no special time for take this biscuits if you have this you can take it any time specially in your hunger time.If you prefer Britannia brand then you can take Good Day chunkies because it also contain lots of choco chips, lots of pesta badams and cashews with butter.I buy this brand because I trust on this brand from my childhood and so I don't prefer any other brands.", "azeemsulehri009": " This scones are there from over 10 years now extraordinarily britannia great day is a best one. since it contains cashews and different nuts stuffed inside it.but this scone will contain part of spread which is bad for wellbeing furthermore this is comprised of maida so be carefull befoe picking this bread rolls. furthermore, the measure of sugar is a lot in this, so its a complete no for diabetic patients furthermore it doesn't have any fiber in it. so I propose to go for patanjali rolls which eveyone is inclining toward nowadays, since its sound and wonderful also, and when you think about the value this has a lot of cos then patanjali, so its better to go for regular made scones of patanjali then picking maida made .", "vishalman0017": " BRITANNIA GOOD DAY BISCUIT ARE GOOD AND SWEET IN TASTE. I AM EATING GOOD DAY BISCUIT FROM MY CHILDHOOD THEY ARE PERFECT IN ALL SITUATION AND THEY ARE VERY CHEAP. YOU CAN EASILY GET THE SMALL PACKET OF GOOD DAY BISCUIT IN 5RS WHICH IS VERY CHEAP. MY FAMILY PREFER TO EAT THIS BISCUIT WITH CHAI OR TEA. NOW THEY ARE COMING IN MANY VARIANTS LIKE WITH DRY FRUIT. PACKAGING OF THE PRODUCT IS AWESOME.OVERALL THEY ARE VALUE FOR MONEY.", "sharmapinky230615": " One Liner Appreciation:- \"So Yummy, So Crispy &amp; So Classy\" .It comes in different flavors like Cashew, Butter, Cookie, Choco Chunkies, Choco Chips also. I like Butter flavor. Neither its so expensive nor so cheap. It proves tagline \"HAR COOKIE MEIN KAYI SMILES\".Its a taste of class. Mostly served with Tea as a cookies &amp; it enhances the enjoyment of tea.It can be bought from Supermarkets, Ration Shops &amp; Confectionery Shops.It's a must buy product from Britania."}], {"KRISHNARAMA": " Britannia good day biscuits are very tasty and yummy. I have tried several flavours of Britannia Good day biscuits, all are very good.Very tasty and nutritious. My favourite is Pisata badam as it contains lots of chopped pista &amp; badam. other flavours are  choco chips, rich cashew, rich butter etc. They are nuch better than local biscuits or cookies from bakery .Now a new variant of britannia  Good day is also avialable in the market, its Good day chunkies, it contains choco chips, I have tried this one also, its very crunchy, liked by kids as contains lots of choco chips. price Rs 50 for 100 gms.", "pillairajesh466": " I have been eating good biscuit from child as my family member love the good biscuit a lot as the biscuit get melt in the mouth after few second of eating I love the topping which is almond I as eate parle biscuit before it is also good biscuit but the taste is not equal to good day biscuit the biscuit is very good in taste as the eqality is good you will never regret to eat good biscuit as it contain all necessary vitamin in it as we ate it daily base it provide good nutrient to the body as you know that good day biscuit comes from famous brand britannia as this company stands for it quality more than 4 decade as I recomment to good biscuit as it good for  health as well with the taste", "sunildhanker8": " BRITANIA GOOD DAY BISCUITS IS ONE OF MY FAVAURUTE BISCUTS .I LIKE ITS SO MUCH . ITS MY FIRST CHOICE IN BISCUITS. I BUY THIS PARTICULAR BRAND BECAUSE ITS TASTE IS REALLY SO AWESOME AND THERE ARE LOTS OF VARITIES SUCH AS CASHEW, BUTTER, PISTA, CHOCONUTS , ect .THERE ARE LOTS OF ALTERNATE BRANDS LIKE 50-50, PARLE-G etc BUT NO ONE COMPETE WITH THEM IN THE TASTE OF IT. I BUY THIS PRODUCT BECAUSE ITS VERY CHEAP AND SO TASTEFULL  AND ITS ITS POPULLAR SO MUCH IN EVERY AGE GROUP WEATHER HE WAS CHILD, YOUNG AND OLD .EVERY BODY LIKE IT.THOSE WHO NEVER EAT PLEASE TRY IT IF YOU EAT ONE TIME NEVER FORGOT ITS TASTE AND WHO NOT WANT TO TAKE A REALLY TASTE SHOULD, NT TRY.", "dhruvluthraluthra6": " Britannia goo day biscuits is my one of the favorite biscuits in all biscuits I like to eat good day biscuits because its taste is awesome and in this biscuits so many good ingredients like butter, kesar, chococo chips and kaju and there are many flavors like kesar flavor, butter flavor and kaju flavor and its not harm our health and there are so many brand come in biscuits like parle g Britannia 50-50 and butter bite, hide and seek but these all are good and healthy biscuits but they can not compete with Britannia good day biscuits with these reasons I a always like Britannia good day biscuits thanks", "ganeshbhor63": " Hi friends, I really like to share my experience regarding britania good day biscuits. its choice of name is very good.its quality tell on its name only.if I take with tea or coffee its taste is awesome. and in my family from child to old person all are like to take good day biscuit with tea.it is a very good mixture with good quality taste . its packing also a very good.my all family member are very happy with this good day buscuits. and when I m going to my relatives I cant go without taking this super good tasty good day buiscuits.and I really request u to take taste of good day u will be very happy.thanku britania to make our morning happy.", "afsalsbtech": " Britannia good day biscuits are very tasty and yummy.I have tried several flavours of Britannia Good day biscuits , all are very good.Very tasty and nutritious.My favourite is Pisata badam as it contains lots of chopped pista &amp; badam.other flavours are  choco chips , rich cashew , rich butteretc.They are nuch better than local biscuits or cookiesfrom bakery .Now a new variant of britannia  Good day is also avialable in the market , its Good day chunkies , it contains choco chips , I have tried this one also , its very crunchy , liked by kids as contains lots of choco chips.price Rs 50 for 100gms.", "komaltravels2819": " I am a foodie and I always need something to eat, I always have snacks with me and good day has always a place in my snacks kit. I have been eating this biscuit since childhood so I have some emotional connection also, maybe that's why I can't live without it.One good this about britannia is that they have maintained the same quality as much as I remember when I was studying in 5th grade my grandfather use to give me some pocket money and I use to buy a small 5 rupee packet and the the taste has not changed since then, that's what I really love about it. It makes me remember my childhood days.When I don't get good day I prefer McVitie's Digestive it's not an India brand but the products are good. Good day is good everytime.", "chavanshivraj3031": " I have been eating this biscuit for the past so many years and it' s taste is such that I just can't stop myself from eating them.I have generally seen two flavors of this biscuit - rich butter cookies and rich kaju cookies.Out of the two I like rich butter cookies more. The biscuit is quite crispy and it tastes the best when taken with a cup of tea.A Rs. 5 packet of rich butter cookies has 6 biscuits in the packet and weights 39 grams. The biscuits are made of refined wheat flour, sugar, butter.", "ashif1828": " Britannia good day biscuits are very tasty and yummy. I have tried several flavors of Britannia good day biscuits, All are very good. Very tasty and nutritious. My favourite is Pista Badam as it contains lots of chopped Pista &amp; Badam. Other flavors are Choco chips, Rich butter. Oh this is my best biscuits, I have been eating this biscuits seen my Childhood. In our family every one love to have this biscuits. All the variety is Awesome I like this", "geetanjalinaravane": " Good day is one of the very famous name of brand name of britannnia.it has many varrient in good day biscuit like cashew nut,Butter,Baddam pista.it is very soft biscuit very crispy and break very easily.available in differnt brands normal pack 10biscuit 100gm. I like this good day biscuit very much from my childhood.considering other biscuit I like this biscuit very much I dont want to consider any biscuit with this biscuit.because this is the one of the favourite biscuit of mine.whenever I got ill I eat only this biscuit.i dont ea any other biscuit. because it is very soft. and it is very tasty.it is a high calories biscuit.is is not good for small children to digest because it contain maida.it may cause appetite to small children.", "mohitmonu19": " Seen I am eating britannia biscuits for more than 8 years and britannia is always good in cakes and biscuits this britannia good day is amazing in taste and very delicious we say that mouth watering biscuits. and this biscuits is also amazing in taste I prefer britannia biscuits for kids too.", "jatinaus": " WHAT A BISCUIT! WHAT A TASTE! WHAT A PRICE! 3 IN 1. GOOD DAY IS A BRAND FOR WHICH IT IS HARD TO TELL EVRY QUALITY OF IT HERE BY WRITTING. BECAUSE THE WORDS ARE MORE AND THE TIME IS LESS TO WRITE.BUT IN SHORT I WILL TELL EVERYBODY THAT I CANEAT 100 BISCUITS EVERYDAY WHEN IT COMES TO BRITANNIA GOOD DAY. I CAN LIVE MY LIFE ON 3 THINGS WATER, GOOD DAY BISCUITS AND CUP OF TEA WHENEVER I WANT. I LOVE IT TOTALLY AMAZING. AND I KNOW THERE IS NOBODY WHO HAVE NOT TRIED THIS BUSCUIT IN THEIR LIFE. BECAUSE ALL OF MY FRIENDS, RELATIVES AND PARENTS AND KNOWN PEOPLE LOVE THIS BUSCUITS. IF I GO ANY PLACE I WILL EASILY FIND GOOD DAY BRITANNIA IN THE SHOP.NO MATTER WHICH PLACE IS THAT. ITS NOT EXPENSIVE AFT ALL. ACCORDING TO ME IT SHOULD COST 100 RS FOR 10 BUSCUITS ACCORDING TO THE TASTE AND QUALITY AND DEFINITELY EVERYONEWILL BUY IT ON THAT PRICE.MY FAVOURITE BUSCUITS OFALL TIME. THANKS BRITANNIA.", "bpsharmabsf": " Britannia good day biscuits are top class biscuit it is available in various flavor like butter, chocolate, dry fruit and many more.As it  known that Britannia is topper company in field of biscuits, in this busy life crore of families using BrItannia biscuits, my every family member like  Britannia biscuit in all flavor but my best flavor is kaju  and dry fruit  biscuit, it is Delicious  biscuit these biscuit are tasty and healthy children like  britannia buiscuit very much, I say that britannia is the best brand for biscuit biscuit among various brand available in market .But Britannia is the king of biscuit, it is realy tasty, healthy and pure it is available in different packing like Rs 5, Rs 10 and also available in family pack, I noticed that mostly people use is as diwali gift , as kids birthday gifts and at different events.", "palanil554": " BRITANNIA GOOD DAY BISCUITS EVERY FLAVOR LIKE KAJU, ALMONDS, COOKIES, BUTTER COOKIES IS SO YUMMY AND TASTY ME AND MY FAMILY ALL MEMBERS EAT ALWAYS BRITANNIA BISCUITS. THIS BISCUITS IS BEST BISCUITS TO ALL OTHER BRANDS. THIS BISCUITS IS NO ANY HEAVY PRICE EVERY ONE PURCHASE AND EAT THIS BISCUITS. I HAVE RECOMMENDED TO ALL THE PEOPLE PURCHASE THIS BISCUIT VALUE OF MONEY. EVERY DEMAND HIS MOM MAMA PLEASE I WANT THE BRITANNIA BISCUIT AND MOM IS TRUSTED TO BECAUSE IS QUALITY IS VERY GOOD AND TRUST ABLE.", "harsh007singhaniya": " I buy this product becouse this biscuits are very yummy and delicious and also very healthy.Thsi brand for cookies is at no. one becouse this brand make best quality biscuits and healthy.I have tried several flavours of Britannia Good day biscuits, all are very good.All are very tasty and nutritious. My favourite is Pisata badam as it contains lots of chopped pista &amp; badam. other flavours are  choco chips, rich cashew, rich butter etc.They are much better than local biscuits or cookies from bakery.So you can enjoy this biscuits.", "04sameer": " In my opinion Britania Good Day Biscuit is one of the best product of britania I have ever tested. its taste is quite awesome and better than other cookie biscuits available in the market. it is little bit costly than other biscuits but it deserves that price. the flavour and smell of the product is also good and I don't think that you will ever regret buying it.I have only one word sentence to say about this biscuit- \" tremendously delicious\".", "veekay89": " The biscuit is from the company of britania. its very tasty and the nuts added in the biscuitbrings more taste than the other biscuits.The price of the biscuit is low as which the all kindof people can buy the biscuit.Its very tastier and for children, youngsters and all age groupswere very treated of eating this.Its mainly used in my tea hours.With the tea the biscuitis really very delightful.when ever we get break and we need to eat something as snacksthe britannia Good day biscuits comes in the mind of many of us.", "vijayagarwalla": " Oh this is my favourite biscuits . I have been eating this biscuits seen  my childhood . In our family every one love to have this biscuits. There are variance in this biscuits like butter and cashew nut. All the variety are awesome. Britannia is able to maintain the same taste but they have occasionally reduce the size and packaging but not the taste. Britannia have been a reputed band for quite some decade now . I have used some other brand with the same flavour but they were not able to deliver the same taste.One should definatly try out this brand who wants best in the market not for those who just want to eat biscuites from any brand.", "gusmirafi": " Good day biscuits very good cashwnut it is contain wheat butter  sugar milk it really enriched as claimed  by Britannia when I go  to school I buy from shop good day I will eat that I love the good day biscuits I good day brand is very good it very nice it there many years it taste is very good and its crispy I am eating from 12years we brake good day put in cake we can put in pudding when I saw in tv britannia good day biscuits I see in tv I used to buy and eat that I go to shop mall buy in goodday biscuit  britania  goodday is popular now days make it powder used as crushed I brought to my sister birthday  party good day biscuit and my  sister felt very happy good day company is good brand"}], {"geetarao8899": " Britannia good day biscuit is best in test with healthy gradients so I take it daily or where ever I go out, it gives you a delicious test and it is price worthy as well as good quality product that's why I like the most Britannia has been delivering and maintaining quality in every products for years. have good day. So start with day is Britannia Good Day tasty, healthy and nice . Easily purchase anywhere.So I like it you will also take and try it.", "rupeshgoyatxe": " Good britania biscuits. and its also god for health, when eve it has been to-do with wheat eat then and doing work.Britannia good dau biscuit is very good product for everyone. It is healthy and unsugger able to it food. Britannia biscuit eat overall my family and I told my neighbour to buying this product.customer are required to check company logo and bar code verify by scan.its best food products.", "vkumaar22": " Britannia good day biscuit is best in test with healthy gradients so I take it daily or where ever I go out, it gives you a delicious test and  it is price worthy as well as good quality product that's why I like the most Britannia has been delivering and maintaining quality in every products for years. have good day", "n212121111111": " Before these biscuits would be awesome  but after few years they have increased the price and decreased the quality and now it became a business for good day. Other than this there are other biscuits like moms magic, etc. But this one going cheap and cheap in quality day by day! So please stop eating these .", "umi123": " Good day biscuit was better  few years before but now the taste and qulity is not same they products is not  as it was before . I think they should  raise the price not quality of there product'itx nice biscuit but now the taste and  quality is not goood I think sothey  not worried about customer healthindian govt and food act dept should also check there products I think they not using good quality of items whole making these  biscuits", "ALPESH1507": " I fill happiness io say about Britania goood day biscuits because sometime whenever i eatBritania good day biscuits with tea i fill different test which is too enjoyable.Sometime i eat bourbon biscuits of parle with tea but i do not fill test well so i choose always Good day biscuits with tea.Who wants to eat biscuits with tea, should choose Britania Good day biscuits otherwise choose any famous branded biscuits.", "malasharma191979": " We buy this particular brand of biscuits because it is healthy biscuits and tasty and yummy we can eat this biscuits with tea and coffee and milk  this brand is number one brand ofcookie and the healthiest brand the name of the cookie is good day means the day is good  if anybody want that his the day is good so eat the Britannia good day every day everybody should eat this biscuits to be healthy and who is not healthy should compulsory eat this cookie and who his already healthy its not compulsory", "shaikhirshad1985": " BRITANIA GOOD DAY IS MY FAVAROTE BISCUIT SINCE I WAS A KID I ALWAYS ENJOY IT EATING MORNING AND ALSO IN ANY TIME ITS REALLY VERY CRUNCHY AND ALWAYS VERY HEALTHY.ITS A SMILE THATS MAKES IT A GOOD DAY THE SMALLET JOYS OF LIFE THAT CAN BRIGHTEN UP ONES LIFE EVERYDAY OFTEN GETS IGNORED IN THE PURSUIT OF LARGER JOYS WITH WIDE RANGE OF FLAVOURS AND DIFFERENT TASTE THAT CAN ENJOYING IN EATING GOOD DAYS AND ITS A VERY GOOD QUALITY PRODUCT AND SAFE TO EAT FOR EVERY ONE I LOVE BRITANIA GOOD DAY", "jeetkumargonnade65": " Hello this is Jeet here Every kid's and old one love to eat buscuits  And also me too.  there are so many products available in the market but all in that braitania is the best and trusted products ever. About britania good day biscuits it is one of the best buscuits in all over brand . it has great taste with cashew and pista with butter. so love to eat . also have great packaging of biscuit so you can store it for long time also keep with you if you going to travel  becouse of it's great packing . also have good size so you can dunk in your Tea cup easily . great O ring size also piece of cashew make their taste great .  so overall great biscuits .", "akshaysonavane5": " Britannia is the one the famous eatables manufacturing company which manufactures various food matrials like biscuits , Snacks , choclates and many more.My entire family loves to eat Britannia Good Day biscuits.It contains the cashewnuts which are added in small pieces which are so much tasty to have it.A small cup of Milk with Britannia Good Day Biscuits is the suitable combination to have for the people who are having the weakness problem.It does not contains any artificial ingredients which are safe to eat.The flavour of the biscuits is so much amazing.The packing of the product is so good having a red colour wrapper.It is the quality biscuits.It is available in round shaped biscuits with strips in between.It is available in the attractives prices and has the value for the money.Thanks", "Gmuthukarthik": " Britannia good day biscuit is one of the tasty product like other britannia products, birtannia of one of the leading company in the world, all the britannia products are very good but this good day biscuit is really good tasty and healthy biscuit, also there add some nuts in to the biscuit, I gives some crunchy taste, in my child hood my all time favoured biscuit is britannia good day biscuit, I prefer this biscuit my all friends, you can hve tjis biscuit with tea or coffee, morning or evening snack time you can this biscuit, we can check nutrition level, sugar level in this biscuit cover, when I go to purchasing my child and wife always inform me to purchasing this biscuit, personaly I like britannia good day biscuit  very much.", "pratip2016": " Britania good day biscuite I like so much, because the smiles lots. sometime I eat Britania good day biscuits with milk I fill different test which is too enjoyable.Sometime it gives you a delicious test and it is price worthy as well as good quality product that’s why I like the britania product., they never compromise with the product quality, but new packaging never increase the taste but increase the price and contain of biscuite so thin.", "santoshsandy172": " Britannia good day biscuitsare high quality biscuits for more calorie at reasonable rate so I have chosen this brand from othersthe alternate brand for this brand is 50-50 biscuitevery one can buy this brand this also I not sure I think doesn't contain sugarI have a good experience with itit has dry fruits such as kajuits flavour satisfaction is also goodand product packing good by this only we can say that this is a quality product", "gaurav123686": " Good day biscuit was better few years before but now the taste and qulity is not same they products is not as it was before . I think they should raise the price not quality of there product'itx nice biscuit but now the taste and quality is not goood I think sothey not worried about customer healthindian govt and food act dept should also check there products I think they not using good quality of items whole making these biscuits", "sneh12051998": " I used to eat BRITANNIA GOD DAY BISCUITS quite often in morning as well as in the evening as snacks!but then I stopped eating them cause my family doctor told me some facts which you may also know!THEY ARE MADE OF MAIDA AND NOT WHEATBRITANNIA GOOD DAY BISCUITS are completely made of maida and no signs of wheat or corn are therenow you can yourself imagine how harmful maida isTHEY CONTAIN A GOOD AMOUNT OF SUGAR AND BUTTERwhich increases calories in your body and makes you a bit fatTHEY DO NOT PROVIDE ANY ENERGY AT ALLyou are just eating them for taste and nothingINSTEAD I RECOMMEND YOU TO EAT MARIE LITEthey are much better then britannia good day cookies and also are much lighter for the bodyI HOPE THE REVIEW WAS USEFULthank you", "Sayeed10": " This biscuits are probably eaten by 2 generations in my family and taste of this biscuits gets better by time. The kids in my house probably knows the name of this biscuit only. Although there are hundreds of other good brands but people who once ate this biscuits gets it the next time. there are many flavours and varieties in goodday biscuits which are worth eating once atleast.Goodday brand are quite affordable as compared to other biscuit brands in the market and can be easily available at any store. This is the Golden cookie for a kid in the middle class family.", "kcmr12": " Good britania biscuits. and its also god for health, when eve it has been to-do with wheat eat then and doing work.Britannia good dau biscuit is very good product for everyone. It is healthy and unsugger able to it food. Britannia biscuit eat overall my family and I told my neighbour to buying this product.customer are required to check company logo and bar code verify by scan.its best food products."}], {"pavanhans11": " These biscuits are very tasty and in my home there will be always these biscuits.when my friends come to my houseI serve these and these are best timepass food.not only that but also these are very healthy and gives energy.the packaging is very well packed and the quality is excellent.britania is a trusted brand for food items sobthere is no fear of purchasing these.also the price is also in budget only.", "Uzi123": " This Biscuit is so nutritious and tasty. The best part about this biscuit is that everyone can afford it. It comes in a variety of flavours from Cashew to butter. The quality of this biscuit is also good. At this  price( Rs 5 to 10) it serves all the people. Britannia has proved it all the time that they can produce the best biscuit.I guess everyone agrees with me that in the morning Tea with good day is a good combination.", "syedmohdmuqaffam": " This is a nice biscuit by britannia I eat it daily with tea in morning it biscuit contains cashew nuts milk solid refinde wheat flour etc. It is good for health according to me Britannia is the famous company in india biscuit cost starting with only 5rs which is so cheap everyone can buy it and eat it my morning is not start without good day biscuit this is good biscuit and healthy biscuit it is available any shop in india so I want to recommend to you who did not eat the biscuit must eat once so you will understand what is itthanks to read my review.", "prasanna1988": " Britannia's Good Day is the best bread rolls I ever had.It is additionally exceptionally nutritive with regards to wellbeing front.it contains margarine and nuts which is additionally a wellspring of protein.At whatever point I feel hungry I simply get a parcel of goodday bread rolls and make some tea And there I go.It is shoddy furthermore sound choice for me.In addition Britannia is the most prestigious brand accessible in the business sector.best for eating with milk", "cryptichead": " Britannia Good Day has been such popular biscuits from old times and that fabulous taste with hidden cashews and almonds haven't changed a bit. I've been a regular eater of these biscuits during my team time and these taste always better everytime it eat. Their classic taste haven't changed which is one thing I really love the most about these biscuits.Britannia has been a key maker of biscuits in India and with Good Day biscuits they have held the loyalty of their customers with it's ever fabulous taste.Best for tea breaks!", "jeetrajkumarr": " Good day biscuit  is the best by the Britannia company its is healthy and best. I always used to eat this biscuit is morning and evening with tea. my mom always serve this biscuit when relative come in my home.britannia biscuit have several variety cashew, butter, milk, badam pista etc they are little costly but their is also rs 5 and 10 pack also. Its rich in highly nutrition fibers", "swapnilgautam27": " As many of the people like the biscuits if Brittania I personally do not like them much. Yes they are good when you are hungry or when you want to grab a quick snacks for guests but they are not very much of a good choice.Some of the other biscuits are good at 10-20 rupees and this is also not a very bad choice but when it comes to taste. It is just way to much sweet and thick. I don't like the biscuits to be thick and sweet and it is very much thick at that.Now many times I tried eating it with tea but its so much sugary that it gives me a suger rush in my head and I personally don't like the products sweetened very much for the purpose of making it taste batter. The packaging is impressive though. But I will not say its a bad biscuit but the old Brittania biscuits were much better and I don't think I can write a much better review for a biscuit.", "mypaisa": " I like this branded biscuit good day from my small age to till this date.Taste very well in this biscuit especially loaded with padam, ghee, nuts and sugary.One problem I am always facing in this biscuit, sometimes over roasted  and not roasted very well.Flavour of this biscuit is really superb and price of this biscuits from 5 rupees to 50 rupees, This is better for everyone to consume this biscuits based on their budget.No one feel bad to have this biscuit.This biscuits easily available from small shop to super market, is major advantage every customer.Definitely go for it.", "vishal5001": " Britannia's Good Day is the best biscuits I ever had, it's soo yummy. It is also very nutritive when it comes to health front. Also, it contains butter and nuts which is also a source of protein. Whenever I feel hungry I just grab a packet of goodday biscuits and make some teaAnd there I go. It is cheap and also healthy option for me. Moreover Britannia is the most renowned brand available in the market.", "akashadg97": " Britannia good day is very nice biscuit with attractive taste .I always like to eat it any time though its packing is not so attractive but biscuit is very nice and tasty too. I like it as it also gives me immense pleasure and a status symbol.My friends also like eating it, not only that old people and senior citizens also like this biscuit.as per my knowledge this biscuit is quality conscious and just because of the cashews only many people like eating it. not only that whenever I am with my friends we always like to eat this biscuit only.it tastes best with hot coffee or tea by dipping it and gives us the feeling that we are eating a fresh biscuit right out from factory of Britannia . the taste of the biscuit also different from other biscuits . whenever we eat this biscuit we get feeling of freshness.", "haardikgupta": " It's one of the best biscuits amongst the biscuits in this category, i.e, the plain category.This biscuits are actually slightly butter cookies which are so tasty to eat.The biscuits comes with size variants and price too.It starts with a small pack of Rs.10.So in just Rs.10 anyone can actually have their stomach full for a while when they are starving for food.The packaging is quite good and is not just simply a plain plastic cover. It as a superior quality covering which doesn't harm the inner contents of the packet.", "laasat13": " Britannia Good Day is a one of the my favorite biscuit It is very tasty cookies and Looking good is nice. Good day biscuits are a Breakfast is definitely a good idea. They can be accompanied by tea and coffee or enjoy them by itself. Its price is very low compared to other breakfast and snakes.Good Day biscuit has now many variants such as Butter, Cashew, Pista, Chocochips and Choconuts, Suitable for all ages, can be eaten as snacks anytime, anywhere for your choice. Good day cookies are a wholesome and healthy way to quench your hunger, It's a good product the Britannia good day is made of the finest ingredients and are a real treat to the taste senses.Britannia good day biscuit all are eating and enjoy.", "tsinha1985": " I love it's taste and can have it anytime during the day. I always keep a packet of it in my bag so that I can have a good-day break anytime:) Among it's varieties of flavors I love the taste of cashew the most. It melts in my mouth as soon as I put it in there. Moreover, it's buttery smell makes me crazy to have it more.  I am really very satisfied with it's taste and flavor.Not only me but all my family members love this biscuit.  I would love to  recommend this biscuit for everyone to have regularly.", "PradeepPuri": " As usual britannia biscuit products have made a mark of their own. So, is the same with Good day too. Very tasty buttery flavor &amp; comes in a small portable pack too, which one can carry anywhere in a small bag. The mild cashew flavor adds to the richness of the biscuit.One can dip this in tea or coffee. I liked the shape also, not that big like marie.As always, a must try to know, what I am talking about:)", "amardeepmoudgill": " Hello friends,My name is amar and today I am writting about britannina good day biscuits.it is very famous biscuits.it is my favrouite biscuits.it is a butter cookies.eat healthy, think better.Flavor satisfaction:Its flavor is good.it s taste is like a butter and nuts.it is a fully butter.Product quality:Its product quality is good.its all ingredients is usefull like sugar, vegetable oil, butter, milk, invert syrup, remind wheat flour etc. .Product packaging:Its packaging is good.it is avialable in good packaging.Overall I rated this 4 out of 5Thanks.", "naveen_eluri": " Britannia Good day Biscuit pack is one of the best Product from Britannia company.we uses every day in the morning and evening times in tea.Easpecially it will be uses for growthing children for their growthing and also uses for all age groups.coming to the Tasty, quality, quantity wise it will be best of the best product forever.After huge compliments came to this product, britannia company started free recharge offer, for ten rupees and thirty rupees packages.In this system if we open  one recharge coupon will appear hence we crack it, The numbers will come and free rechage details will shown.This offer is huge success entire india.", "krishna_14322": " Britannia company is one of the best company in india and his all products is very nice.Britannia good day has been such popular biscuits from old times and that taste is awesome and good helthy so I purchases this last 5 years regulars.The company's principal actvity is the manufacture and sale of biscuits, bread, rusk, cakes and dairy products.but britannia good day biscuits is very nice.their classic taste havenot changed which is one thing I really love the most about these biscuits.its price is very low and compared to other breakfast and snakes.I suggest all my friends and all indian this is biscuits is very nice taste and one time use this.because biscuit has now many variants such as butter, cashew, pista etc.", "Priyankasingh2016": " This product is released by a famous Britannia goodDay brand. Britannia GoodDay biscuits is my favorite biscuit in comparison to any others. I like this very much. It is very tasty and also very crunchy. Its packaging is very awesome. Its packaging is available in many colors that is so interesting. By this people attracted for this product.This can use by anyone, every family members. I always choose only this brand for me and also for my family. Most of people choose this brand. Especially children like this very much.", "abhishekkumargolu": " Britannia good day biscuits wow what a teast of this buscuits how can I say to you if you are already having this biscuits so no need to say to but who did not try upto to plzz once again try it super teasty biscuit and its also branded company buscuits of britannia good day and I want to say to start your day with britannia good day biscuits with tea and make your day good always with this biscuits in the market britannia good day biscuits came different different price five ten and also big packet for family and specialy children are like more of this biscuits good brand and good teast no feel bore if you eat more biscuits of britannia good day fully teast and super paking with butter include in this biscuits all over india this biscuits are famous and you can find this britannia good day biscuits in all shop in india what over village or town you can find easily britannia good day biscuits tring tring tring."}], {"visheshkumarsingh": " After being bombarded by all the drool-worthy marketing, I decided to try Britannia Gooday Chunkiesfor myself. Picked up a small pack and discovered six individually wrapped cookies inside for Rs 50.Once I unwrapped the cookie, I found myself face to face with a healthy-sized disc with which I could play frisbee(not quite). The cookie looked good: sufficient chocolate chips, rough texture, cookie-like appeal.However, after the first bite, I wasn’t too impressed. The cookies are hard and definitely not “melt-in-your-mouth”. I prefer soft, crumbly cookies(more American) vs the British hard cookie. That’s a personal preference, I guess, but aside from that there was an artificial flavour in the cookies.Despite that, the cookies are pretty delicious. Relatively quite soft with huge chocolate chips. I like!(I still prefer Milano chocolate-chip cookies in the packaged cookie market! Or better still, bake your own cookies.)Update Feb. 1: I recently tried Parle Milano chocolate-chip cookies(Hide &amp; Seek) and they were nothing like what I remembered! They were, in fact, pretty disgusting. Very hard, very non-chocolatey and with a strange after taste. Mr T agreed with me.", "moinsyed": " Britannia has come out with a new good day flavour Choco nut cookies, good one among good day range. The cookies are yum  that delight you for quick snack anytime, anywhere.The cookies are well blended in choco nuts and delicious in quality. The quantity is prudent &amp; packaging is attractive, if you are looking for a break than the choco nut cookies is ready to make your break into a tasty one.Good taste in Good day.Stay alert.", "PintooSharma": " Britannia is the oldest brand. Customer like Britannia biscuit. Britannia good is the good &amp; tasty biscuit. It made by milk , wheat, kaju, badam vitamin mix on Britannia good day biscuit. Milk, kaju, badam, wheat is good for health.Many people like Britannia good day biscuit. It is famous in the market. It is good in the market many people eat and give a good response. It available in nearby store in any area. I also like Britannia good day biscuit. It is a good biscuit.", "bikarsingh8": " Britannia good day biscuits are so yummy.have great taste in it.these biscuits are running a long time ago.I love to eat these. These are so crispy and also available in many tastes like butter cashew simple.Its cashew biscuits are too yummy. The small piecs of cashew when I chewed makes so much yumier.flavour is too yummy . Its packing keeps the biscuits fresh and crispy. Having nutrients in it.price is cheap and best.we can enjoy its taste with hot tea and coffee. I like these biscuits and are on top of my biscuits choice.", "pavya": " This is the most selling Biscuits from Britannia as per my knowledge because of its taste andgood price .I like its taste also it packing which is so good that when ever you open it .its crispy taste you found as it is .The dry food which present on it is increases it taste more.I observed that you can eat at any time you feel happy and fresh.I thing which also I observed the this product you will get easily in village areas remote areas.", "Varinder_Singh": " Britannia good day are very tasty biscuits. Britannia is indian food manufacture company.I eat britannia good day biscuits daily with hot masala tea. Its tast is really good.Good day biscuits's quality is good. Good day biscuits's pista badam flavor is really very tasty. Badam and pista makes this biscuits more tasty.Its packaging is very good. It is hygienic packaging. Britannia good day is comes in different quantity of packaging.Britannia Good Day biscuits are very tasty. you can start your day with britannia good day biscuits.", "Ramkirat": " Britannia good day biscuits is my favorite biscuits and one of the popular biscuits in today's market.Best if you compare packaging, price and taste and I am sure it's also healthy biscuits if you compare with otherbiscuits currently in the market.They have variety of other biscuits like Marie gold, tiger etc.Britannia good day also comes with variety of flavorlike good day cashew,  good day *butter-which has buttery taste, good day piste badam-which has **pista badaam tastechoco chunkies and good day choco chip, good day choco nut.I love to eat all flavor butand you can choose your favorite flavor, and mine favorite isbritania good day choco chip and good day pista badaam.I love to eat cashews and Britannia good day biscuits is made of cashews and other ingredientsand taste is tooo good.and too attractive packaging.value for money.easy to digest.Britannia saying eat healthy and think better .it contains good nutrients which makes this statementtrue: eat healthy and think better:)your family can eat Britannia good day biscuitstaste is very very good.and it's not bad for health.me and my family members eats Britannia good day biscuits daily as a snack every day.I carries this biscuits because when I feels hunger then I eats this biscuits.I eats this biscuits than other because it's not only tasty but also healthy.I takes tea with good day biscuits.whenever I goes outside home I always kept this biscuits in my bag and whenever I feelshunger I only eats this biscuits.really best biscuits.there are many other brands in the market butif you will taste this biscuits at least once you will never buy other brand becausetaste wise and health wise it's one of the best biscuits nowadays in the market.I ate so many biscuits but this is different**, it's differentin taste, it's different in packaging, it's different in flavor,can't compare with any other brands.*Britannia is improving day by day and introducingvariety of flavor which is good for health.*now Britannia good day biscuits  is giving offers. on everypackage Britannia is giving 10rs. mobile recharge.by which you can recharge your mobile for free.:)*really it's always makes my day.because it's too tasty and deliciousand price is also cheap. which you can buy:)this biscuits is highly recommended by me", "macneil_borges": " Britania good day is an awesome biscuit, it has varieties of flavors in it and has a yummy taste like pista cashew almond.The best one that I like is cashew it tastes really very good and if you have it with tea it is even more deliciousIt costs around 20rs. The packaging is good as wellIf have tea party at home . This is the best biscuit that you can have with tea.butter flavor is ok ok and the pista flavour is good . Really good biscuit", "skmusa143": " In the wake of being barraged by all the dribble commendable promoting, I chose to attempt Britannia Gooday Chunkies Grabbed a little pack and found six independently wrappedWhen I unwrapped the treat, I got myself eye to eye with a solid measured plate with which I could play frisbee(not entirely). The treat looked great: adequate chocolate chips, harsh composition, treat like bid.In any case, after the primary nibble, I wasn't excessively awed. The treats are hard and unquestionably not \"liquefy in-your-mouth\". I lean toward delicate, brittle treats the English hard treat. That is an individual inclination, I figure, however beside that there was a counterfeit flavor in the treats.Regardless of that, the treats are really delectable. Moderately entirely delicate with immense chocolate chips. I like! Despite everything I lean toward Milano chocolate-chip treats in the bundled treat market! Then again even better, prepare your own cookies.I as of late attempted Parle Milano chocolate-chip cookies(Hide and Look for) and they were in no way such as what I recollected! They were, truth be told, really sickening. Hard, extremely non-chocolatey and with a peculiar delayed flavor impression. Mr T concurred with meor myself. Gotten a little pack and found six exclusively wrapped cooki I wasn't excessively awed. The treats are hard and unquestionably not \"dissolve in-your-mouth\". I incline toward delicate, brittle cookies(more American) versus the English hard treat. That is an individual inclination, I figure, however beside that there was a fake flavor in the treats.I as of late attempted Parle Milano chocolate-chip cookies(Hide and Look for) and they were in no way such as what I recollected! They were, truth be told, really disturbing. Hard, exceptionally non-chocolatey and with a bizarre persistent flavor. Mr T concurred with me", "bhambure23ashwini": " BRITANNIA is a very known company in India. The Good Day Butter cookies is product of BRITANNIA. It is very tasty cookies. when I am hungry Good Day cookies is the first choice to finish hunger. with the tea and enjoy the taste of butter cookies .Good Day BRITANNIA is very tasty cookies and our whole family like it .If someone guests came to our home we serve Good Day cookies with tea. Its packing is good and keeps its Overall it is very tasty and delicious cookies. I recommend this product to other people also taste it enjoy it", "luicismith": " Britania Good Day Biscuits is the one of the most favorite biscuits of mine. The taste is so good that can be compared to Mcvitties etc. Biscuit just melts in the mouth as soon as it is put in there. And the greatest thing is that the price is so low.These biscuits are available in the range of ?5-?20 which can be affordable by every society. Its just great with the best taste and the price. Ones who love the natural flavor, go for these,", "anandpandey900": " Good day biscuit is quite good indeed, tastes best with shaam ki chai and with friendscombination of cashew nut(kaju) and butter is so delightful .packingpacking is air tight and keeps the product fresh all timeflavorthere are lots of variety of flavour availableproductthe moment we take a bite of cookie, it starts to melt within mouth and feels so good at that timewhen to eatanytime, yes have it anytime and make you dayENJOY:-)", "san_xeon": " Britannia is a well known brand in india and one of its great product is Good Day Biscuits. I have seen this biscuits generally in three flavours Butter, Cashew and Pista. Once I have seen Good day choco chips but its hard to find in nearby shops. Its a nice product. I have been eating this biscuit since my childhood. Although there is a little bit of change in taste and price but definitely these cookies are still great in taste and mouth melting.I buy this product every month in my grocery and even my little two year old daughter likes it very much.Its a good product and my experience with it so far is good. You can rely on this brand and enjoy the cookies with tea or coffee or you can simply have it watching your favourite show/ movie.", "arpit082m": " Britannia good day is providing a cool good day offer on the purchase of biscuit GOOD-DAY BUTTER COOKIES, With an exciting offer that if you buy pack of this biscuit of cost rupees 10 or rupees 30 available in market . you can recharge instantly on freecharge by applying this 12 digit code in the block of free-fund code and process it . this offer on this biscuit is valid till 28th February 2016. and please note that biscuit packs of same cost are available without offer to, so please insure before buying it .NOTE - the offer is valid 3 times on a single account in freecharge . It sometimes also show some error, if it so please try after some time.I also have applied and this works too. But you can not add money to your account by applying this free-fund code . And if you want to reacharge of 20 rupees and you have 10 in your freecharge account and apply britannia biscuit code then it fails .So till 28th feb go for it.", "saikrishnaa": " When I feel hunger mostly I prefer to have this biscuits as it taste very good. These biscuits are made from milk, grains, kaju tastes very good. It is also available from small packet to bigger pack. It price costs from 5rs, 10rs and so on.It also available in many flavours. Almost every one like this biscuits. Which gives us good energy also. The package from good day biscuit is very fine. Good day biscuits are produced by britania company. Which is trustworthy. Many celebrites also acted in the advertisement of the good day biscuits. It is available in almost all shops. I love this biscuits very much.", "sachin8686": " Its truly turning into my day great. I like this bread in all flavor yet most I like you would love to have Britannia great day rich margarine treats straight from the pastry kitchen. These additional crunchy treats are produced using genuine margarine and are a treat for anybody at all seasons of the day. Britannia great day rich spread treats are 100% vegan and suitable for all ages.Britannia great day rich spread treats have rich margarine content in it, which pulls in the margarine beaus towards it to purchase it and get a chomp of it. Britannia great day rich spread treats are one of the finest results of Britannia. So attempt the new Britannia great day rich margarine treats and have a spread event in your mouth.", "vinodbstd664": " Good Day Butter cookies is product of BRITANNIA and it is very known company in India. It is very tasty cookies I like it very much. In which small- small cashew nuts pics makes its very tasty.I am college student and when I am hungry Good Day cookies is the first choice to finish hunger.In college canteen  orders the tea and enjoy the taste of butter cookies .It is very tasty cookies and our whole family like it .If someone guests  came to our home we serve Good Day cookies with tea.Its packing is good and keeps its crunchy taste longer time otherwise when it is opened after some time it became soft and not give crunchy taste.It is  responsibility of user when they once opened pack and they not able to eat it then they contain it in air tight counters.Overall it is very tasty and delicious cookies.I recommend this product to other people also taste it enjoy it.", "naviku": " BRITANNIA is a very known company in India. The Good Day Butter cookies is product of BRITANNIA. It is very tasty cookies. when I am hungry Good Day cookies is the first choice to finish hunger. with the tea and enjoy the taste of butter cookies .Good Day BRITANNIA is very tasty cookies and our whole family like it .If someone guests came to our home we serve Good Day cookies with tea. Its packing is good and keeps its Overall it is very tasty and delicious cookies. I recommend this product to other people also taste it enjoy it", "mshaik793": " Subsequent to being assaulted by all the dribble commendable showcasing, I chose to attempt Britannia Gooday Chunkiesfor myself. Gotten a little pack and found six exclusively wrapped treats inside for Rs 50.When I unwrapped the treat, I got myself eye to eye with a sound estimated plate with which I could play frisbee(not very). The treat looked great: adequate chocolate chips, harsh composition, treat like bid.Be that as it may, after the main chomp, I wasn't excessively awed. The treats are hard and certainly not \"dissolve in-your-mouth\". I favor delicate, brittle cookies(more American) versus the English hard treat. That is an individual inclination, I figure, yet beside that there was a fake flavor in the treats.Notwithstanding that, the treats are really delectable. Moderately entirely delicate with gigantic chocolate chips. I like!(Regardless I lean toward Milano chocolate-chip treats in the bundled treat market! Then again even better, prepare your own treats.)Redesign Feb. 1: I as of late attempted Parle Milano chocolate-chip cookies(Hide and Look for) and they were not at all like what I recollected! They were, indeed, really sickening. Hard, exceptionally non-chocolatey and with a bizarre delayed flavor impression. Mr T concurred with me."}], {"nottyrajat": " Britannia Good Day Biscuits are the best biscuits according to me which you can take anytime to relieve your hunger. It is another good product from the Britannia.This biscuits contains real butter and gives a smooth and soothing taste that you will love to take it again and again. I am eating this biscuits and it most be above 3 years and I am a huge fan of this biscuits and will strongly reccomend for everyone to take it in daily basis. Packaging is very well done ensuring to retain its taste intact. Flavor and quality wise full marks 5 on 5 . must try !", "samridhisawalka": " Consumer loyalty is the essential wellspring of any business action, holding the clients to their item is most imperative in the business.The fundamental goal of the study is to discover out the consumer loyalty and dependability towards Britannia Good day scones. Distinct exploration is followed in this examination. The universe of the populace incorporates the respondents who are the customers of Britannia scones, Avadi, Chennai. The samples(i.e. test size50) were chosen among the customers of Biscuits, in Avadi for this exploration.The major discoveries of the study are, most(90%) of the respondents are willing to suggest Britannia.Great day scones to their companions and relatives. From the exploration, it is inferred that the  demographic variables, for example, age gathering, sex and occupation are having less effect on the elements of consumer loyalty. The exploration result additionally shows that, the vast majority of the clients were fulfilled towards expending BritanniaGood Day bread rolls.", "SUBRAT_1111": " Britannia biscuit is my favorite.i always eat this biscuit in morning with tea.i have been eating this biscuit since school time.it is very taste and delicious.i have become so addicted to it.it come in small and big size packet.look of the biscuit is good.britannia is popular and trusted brand in India. This biscuit contain kaju, butter and very less content of unhealthy ingredient.it really melt your mouth and full of sweet and sugar.It serving about two decade in Indian market.this biscuit maintained its quality from start till date.good day cashew and butter is my favorite.you can take this biscuit with milk and casual use.i recommend Britannia biscuit to my friends.", "tanmaykundu25": " BRITANNIA is a one of the best biscuits brand in India . They have many type of biscuits like parle, top, bourbon, good day, 50-50, etc  . All are in different flavors .Out of all biscuits, Britannia Good Day is best . Good Day Biscuits has many flavors like cashew, chocolate, etc . Cashew Good Day biscuits are full of piece of cashew with sweet taste .Chocolate Good Day biscuits have chocolate flavor&amp; color . Taste of good day is awesome .Good Day have good nutrition . All ages man can buy&amp; eat this biscuit . For children this biscuits is very interesting&amp; there have no bad effect . I too much like cashew good day biscuit. It make my day very good . It's packaging is very good . I am fully satisfied with Good Day biscuits. I highly recommend this biscuits to all .", "suji1234": " Britannia good day is my favorite cookie!!Good day biscuits are awesome, it is very tasty. I used to eat good day biscuits at coffee time.Britannia good day biscuits is one of the good biscuit we have in India. .We can see nuts on the surface and a great new taste. .the new good day will gives awesome taste.In Britannia good day, we can find various flavors like good day cashew, good day butter, good day pista badam and many more.It is very good in taste and crispy.we can enjoy all small moments in everyday life with Britannia good day biscuits.One interesting thing we can see is.the new good day cookie comes with a smiley design .it looks very nice .", "satyalshiv": " When I was join hostel during my graduation time I got food in two times only and in afternoon it becomes necessary to me to eat something in noon then in one day I took Britannia good day biscuit which does not help only to meet my hunger but also provide me good test.WHEN WE CAN USE BRITANNIA GOOD DAY BISCUITYou can not use good day biscuit to meet your own hunger but you can also use this for your guest.WHAT SHOULD TAKE IN CONSIDERATION WHILE YOU ARE GOING TO BUY BRITANNIA BISCUIT:Manufacturing date biscuit may be prove unhealthy for you if these are expired date so you should check its expired date.MAXIMUM RETAIL PRICEPrice should check whether shopkeeper charged you price below MRP price or not you should not buy it if the price charged by shopkeeper are more than MRP.HOW SHOULD WE USE-If you want to get more test with biscuit you should eat with milk.PRICE CHANGES-The price of Britannia biscuit is rupees 20, 30, 40 or more.", "Faim_Uddin": " Good Day is a tasty biscuits by Britannia. Britannia is a well known brand itself and produced many good products among the customers and their most of the products are very good in quality and quality. Good day biscuits are very tasty edible for every age person.I am a big fan of this products and eating this from many years and the best part of this product is you can eat it anytime. This biscuits get fit in your time either you are eating this on morning or evening and on your lunch time. Tasty biscuits – Britannia Good Day Biscuits.", "abdullahseraj": " Britannia good day are very good biscuits and have cashews inside it which tastes very good. The packaging of the product is very clean and tidy.They taste good with tea and is also good for health and has many protein.These biscuits are filled with richness of butter and crispy cashews.Good day cookies are full of calcium and have a irresestible flavour.It is a great biscuit to have in the morning with tea and is also full of calciums and proteins.Have a good day!", "pawanalisam": " Hello friends, Good day is not a best option in the biscuits because, we have various other cookies for just 5 rs like parle 20-20, unfeast cookies, etc. Initialy it has good in taste but from 2 years its quality is not up to market standards, now it improved a bit, how ever they lost some customers like me who always rely on the taste and quality.Some times we get casheu cookies with no cashew, flavour is also not good.Better try new buiscuits in market.", "salyshibu": " Britannia is a well known and trusted brand. All its products are very good. Coming to Good Day, it is worth its cost. I am really satisfied with its taste and flavor. I have two kids and they too like it a lot. I have no confusion regarding what should be their snacks to school.Now its comes with smiles and help spreading the smile. It is a real partner of tea. A dip in the tea doubles the taste. With out any doubt I strongly rec-command all mothers to give their children, this wonderful product.", "SheikhHamza": " Britannia good day butter cookies is the one of the most popular cookie in india now a days. These cookies are come in many range like  5Rs, 10Rs, 20Rs, 30Rs these cookies are rich in butter and cheswe. These cokkies come in many more flavors.Nutrition chart of the cokkie are:-Carbohydrates( 67g)-sugar:(22g)-Protine( 7g)-fat( 22g)-saturated fatty acid= 11g(Mono unsaturated acid( 8, 5g)Poly unsaturated acids= 2, 5g)Trans fat acids= 0g)Calestrol( 6, 5g)Energy( 494kcal)THANX", "ravikanthh000000": " Good day biscuits are my favorite because its very tasty and healthy also. this biscuits are from britannia company.its a brand company.good day biscuits are zero trans fat biscuits so every one can eat it.good day biscuits are available in three flavors.1.good day butter cookies2.good day badaam cookies3.good day  pista badaam cookiesall these three are my favorite.children also like it very much.good day biscuits are available at low price.for 75gm pack 10rs only.this biscuits are tasty and healthy that's why I recommended to try it once.thank you.", "hrmadina1": " Customer satisfaction is the primary source of any business activity, retaining the customers to their product is most important in the business.The main objective of the study is to find out the customer satisfaction and loyalty towards Britannia Good day biscuits. Descriptive research is followed in this research.The universe of the population includes the respondents who are the consumers of Britannia biscuits, Avadi, Chennai. The samples(i.e. sample size 50) were selected among the consumers of Biscuits, in Avadi for this research. The major findings of the study are, most(90%) of the respondents are willing to recommend Britannia Good day biscuits to their friends and relatives.From the research, it is concluded that the demographic variables such as age group, gender and occupation are having less impact on the factors of customer satisfaction. The research outcome also indicates that, most of the customers were satisfied towards consuming BritanniaGood Day biscuits with respect to the chosen factors.", "chanchalasaharoyf": " I like britania for its good quality product that they launches which is healthy and testy also.i like to good day beside britania Bourbon.Its good day biscuit is really a good one which has been trending before my birth I suppose to be so.This product is healthy and testy they are the first to introduce such a testy biscuit in market.now a days we can find so many biscuit company they launches testy biscuit but Good Day is the first as it appeared first in the market.Now they are modifying Gooday by introducing new test and quality and introducing more dry fruit on it such pea nut and coconut and other kind of dry fruit.I like to its Kaju scattered biscuit with butter test.it is delicious and flavour is awesome.And about its packing undoubtly it is good in packaging as its wrapper used here is of good quality that keep the biscuit crunchy for a along time. Thanks for introducing such high fiber healthy and testier biscuit at reasonable price.", "arjunshelke": " Britania has done very good job. GoodDay cashew is one of my favarite buiscuits.They taste good with tea and is also good for health and has many protein.I am really satisfied with its taste and flavor. I have two kids and they too like it a lot.All are in different flavors .Out of all biscuits, Britannia Good Day is best.Britania is one of best and famous in the field of Biscuits production companies. I take britania good day not only at tea time but also when I wish to eat biscuits.", "rahilshaikh8460734": " Hy.frnds.I am reviewing on Britannia good day biscuit. It is very sweet and fully tasty biscuit. When I walkup in morning after brushing my teeth I take tea with good day and it is so soft and superab delicious tasty biscuit. It has many flovour.But I really like its butter and kaju nuts flovour. Its butter flovour is so sweety and loving taste. Good day is extrimly good quality product and fully secure. From britannia it has good packaging system and also give its batch no. And manufactur and expairy date for its customer My recommendation to it", "gr8rupesh": " Good day is good. Name is saying everything. Its really becoming my day good. I like this biscuit in all flavour but most I like you would love to have Britannia good day rich butter cookies fresh from the bakery.These extra crunchy cookies are made from real butter and are a treat for anyone at all times of the day. Britannia good day rich butter cookies are 100% vegetarian and suitable for all ages. Britannia good day rich butter cookies have rich butter content in it, which attracts the butter lovers towards it to buy it and get a bite of it. Britannia good day rich butter cookies are one of the finest products of Britannia. So try the new Britannia good day rich butter cookies and have a butter extravaganza in your mouth.", "deshmk": " Britania is one of the trusted brand in india and he is overcoming day by day to parle products by come up with a very long product rangeone of the most popular brand from britannia is GOOD day bisuitsfrom every age group this brand attracts its a very good in quality and price so I like its as well as my family also likes it too muchif u not tried pls try it onceit contains milk, wheat, almond and cashew etc", "MrDigital": " I can easily trust the Britannia brand biscuits as they are hygienic, tasty &amp; nutritious.Its available in different flavors but I like cashew one the most.It tastes way better than competitors like priya gold, parle, etc for same category.All age group can buy this product without any issues.Although its bit higher on price but its brad value that matters too.The packaging is also decent &amp; one can makeout different flavors from package colors.", "abhijitshaw": " Britania is one of best and famous in the field of Biscuits production companies.  I take britania good day not only at tea time but also when I wish to eat biscuits.The taste of this Britiania Good Day so much delicious.I also want to say that whole members of my family eat this Britiania Good Day. The Packaging of this Biscuits also look attractive and easy to bagged it.  So, without any hesitation, recommend this product to every one and I am sure they will be happy with this product."}], {"sahilajmera82": " Earlier good day biscuits were low on cashews/nuts and were very soft but now when I tried, all my complaints are solved. Comes loaded with nuts and are crispy hard. Also they have worked on its shape . it shows a smile shape which looks beautiful.I have never seen such worked on and that too on buiscuit. Earlier too good day was popular still such improvements make it trust worthy. Even if I am not hungry I can empty the entire packet, its that tasty. Its competitor parle 20-20 is also good but lacs that quality trademark.", "amitjain_delhi": " The britannia good day biscuits are something to die for. They are what biscuits should be. simply love the taste and range of biscuits and cookies that britannia has.Good day cashew and almond, butter bite.all are very nice. I always make sure that I carry some britannia good day cookies with me. Lately the quality has deteoriated and the taste is not the same. most of the times the biscuits are under cooked.", "satra_pritesh1992": " Britannia's power  brand  Good day  completes  its  25 years of existence launched in 1986   and is worth more  than  Rs 100 crore brand   rightly placed  as one of the power brand from Britannia .which includes Marie, Milk bikkis, Bourbon, Fifty - Fifty,  Nutri choiceIts origin can  be attributed to the  Britannia  R &amp; D which bridged  the  gap  of biscuit and cookies . Good Day  is the major  product  as far as MARKET leaders  from Britannia is concerned . Good Day  biscuits could not be replicated by competitors  like Parle, ITC and now  United Biscuits . Of course  Unibic  has come closer by creating a cookies niche  in biscuit segment successfully .Rich  in recipe  the  Good Day  has  been popular among masses  with its  bite and taste . In addition Britannia   has used  ingredients like  cashew, pistacchio  and  chocolate  to add spice to it brand .Good Day  biscuit  has now many variants  such  as   Butter, Cashew, Pista, Chocochips, Choconuts . Britannia has planned to showcase Good Day  with human touch in its tvc and media campaign.", "smoiz80": " Britannia brand is old brand in making of biscuits and it completes 25 years of existence in the market &amp; they are having worth more than Rs 100 crore. The Good Day biscuits are very tasty and having unique flavour. There are 6 types of biscuits namely Good Day Cashew, Good Day Butter, Good Day Pista Badam, Choco Chunkies,  Choco Chip and Choco nut.They in small and big size packets and have very good packaging. Biscuits Looks is so good, unique size and thickness of the biscuits is too good.  In Good Day Cashew, Cashew pieces in biscuits increase taste.  Little bit crispy in butter. The price is also cheap so that everyone can buy and taste it, only for 5 rs. You can buy family biscuit which cost  slightly high.", "SoniyaP": " Good Day biscuits is Britannia product.  Britannia is considered as best company in quality and taste from decades.Good Day cookies contains kaju and butter and very less content of unhealthy ingredients.  Very healthy cookies and best time  to consume in morning and evening breakfast.  With warm milk Good Day biscuits taste yummy.  Every mother select for their child and that is Good Day Biscuits.Available in all stores with reasonable price. Good Day biscuits are less sweet which good for all.  Packaging is done very well. Even people take Good day biscuits while travelling.  Tastier cookies from all other biscuits.", "shivashankarps45": " The best cookie, we love good day and we are using for a very long time . This is the first choice when our families get together at holidays, everyone are great fans of good day and is suited with a mug of coffeeThe favorite flavor is the cashew, it is very good to bite those tiny cashew piece . The biscuits is very tasty and not have too much sugar, hence it is good for the persons who doesn't like more sugar.It is easily available in all  stores and is cheap. It can be used as snacks for children and also suitable for elders .It is quite good and a best way for suppressing appetite at evening", "ranjay275": " There are several brand of biscuit available in the market.But the taste of Good Day appeals from very beginning since my first use of seven years ago.I like this good day biscuit most. I can not take morning tea without good day biscuit.The taste of this biscuit appealing me.If another biscuit I bought , the same will be rotten my family but no one will take that biscuit.In my bag the good day biscuit is always kept.", "naavisrock": " Britannia is very popular and well known trusted brand in food products.At our home, we all like to eat Britannia Good day Biscuits with not just Tea or Milk,even any time we enjoy this light snack.When ever we go on picnic or for a movie, we never forget to carry Good day Biscuit with us. These Biscuits are very soft, melted in mouth, buttery by taste, also they comes in various flavors. Mine most favorite one is Pista Good day Biscuits where as My parents like to eat Cashew flavor in Good Day Biscuits.In Hyderabad, there is Karachi Biscuit but we like Good day Biscuit much better than Karachi Bakery.It comes in various packaging also like small packet just 20 rupees.Very popular so available at any grocery store and almost all online stores too.Perfect combination with tea or Milk.Buttery ones are also very nice, it's just melts in mouth, good and sweet taste,Really it makes your day Good.Certified by quality, best by taste.", "preetigupta5599": " I start my day with a cup of tea and good day biscuits along with it and I love these biscuits so much that I have become so addicted to it that if I dont eat these biscuits after waking up in the morning along with tea I feel something is missing all day long.It does really make my day a good 1.i love all the flavours available in good day but I like good day cashew more with tea.the nuts used are fresh and crunchy.The good day choco chip cookies are my favourite snack for the day and I can have it all the long because of the rich chocolate content in it.and the 1 with butter flavour is best liked when eaten simple.This flavour melts in the mouth and relishing.now they have improved its shape and given curves on it and compared it with smiles which is quite influential for me because it does really get a smile on my face when im hungry and I see a shop nearby with a pack of good day in the rack.its heavy and stomach filling biscuit and also healthy because of the nutitional content it it.(mentioned on the pack of biscuits). do try it once.", "akashyadav1797": " Britannia good day biscuits is one of the india's leading biscuits making company now a days people want to eat biscuits everyday speacially like kids who always eats biscuits.its taste is good and flavour also some time it taste like coconut and some time like milk it is combination of milk and coconut and wheat.its size is good and taste is also good.if you eat first time then you always try to eat britannia good day biscuits.which provide less cost to buy because it come in many variety and packets.", "sandeep1991": " These biscuits are not only tasty but also healthy biscuits. Early morning ii will eat these biscuits with a cup of tea or cofee. And I lov kaju and butter flavour in those packets.I carry two biscuit packets daily while going to office.I will have two packets daily, one is in the morning with tea or cofee and another is at the evening hourse around 5.00-5.30pm with again tea or cofee.They give relaxation to the stomach on hungry times", "jyotikavarmani": " I simply love the goodness of Britannia Good Day Biscuits, my favorite being the Kaju ones. I've tried other brands with similar biscuits to offer but nothing is as delicious as this.They are really melt in your mouth and are full of sweet butter and sugar. They are just right in their formula, with nothing excessive and nothing missing.They are perfect for sweet satisfaction without being creamy. They are also available in pista-badam, chocochip and butter. If you want pure, rich cookies, choose Britannia Good Day, and nothing else.", "Aditya_Jha": " Can you imagine any other cookie in the market at this price which offers the richly taste of cashews in it? I simply can't and I haven't seen a cookie similar to good day - the taste is incomparable.It's apt for when you are expecting guests and want to serve them with a royal cookie because this sure will make their visit a royal experience.I've been having it for years now and my family loves this cookie simply because 1) it's great on quality 2) it's reasonably priced and 3) it offers a great royal taste.Head over to a store near you and grab one of these, believe you me, you wont be disappointed.", "Rupshree1008": " Hi guys I am reviewing on Britannia good day biscuit. It is very sweet and fully tasty biscuit. When I walkup in morning after brushing my teeth I take tea with good day and it is so soft and superab delicious tasty biscuit. It has many flovour but I really like its butter and kaju nuts flovour.Its butter flovour is so sweety and loving taste. Good day is extrimly good quality product and fully secure. From britannia it has good packaging system and also give its batch no. And manufactur and expairy date for its customer. My recommendation to it.", "bikram12340": " Britania Good Day biscuit is one of the Testy biscuit from the begining of the Britania and still it keeps its pretigious.And moreover its delicious tests are developing day by day by introducing various kind of dry fruit on it.and it has a creamy test in itself which makes it different from other.One thing is that from the begining it keeps its design stagnant no change in its design.It is very healthy and one can easily fulfill his hunger with this testy and healthy biscuit", "debamishra5": " Good day biscuit is one of the oldest product from Britannia. It is serving Indian market for more than two decades good day is a very nutritious and tasty biscuit. I am eating Britannia good day from my childhood and it maintains its quality after 22 years also.All the members of my family like this biscuit. Britannia good day is available in many flavors which are cocoa chunkies, rich cashews, rich butter, rich pista badam, choco chip and coconut flavor. Mostly I eat rich cashews and rich butter flavor because it is available everywhere.Other flavors are available in big shops which is not possible to bring anytime. Good day is a expensive biscuit. I always buy RS 10 pack to eat. sometime I purchase big pack for my family. god day biscuit gives me best flavor satisfaction so I eat it in regular interval.", "Itee_Indi": " One of the finest taste of biscuits is offered by Britannia. Their Good Day is so tasty and decilious. The cashew in them could be seen and one can eat them with tea or without it because of its not too dry. There are many other competitors in the market offering the same but the pioneer Britannia has something different and actually good to offer customers. In fact Britannia Good Day is not too expensive and also less than others.Good day is also available in different tastes and with different ingredients. For example Good Day butter, which has a buttery taste and no dry foods in it, there is a whole range to offer like cookies . It is easily available in the market as the distribution system is very good.Britannia is a trusted brand and they are market leader in many products in FMCG market. They deliver trust and taste at the same time.", "sararishi": " These are too tasty and buttery. Comes in small and big size packets. Very good packaging. Cashew pieces in biscuits increase taste . Look of the biscuits is so good,  unique size of biscuits and thickness of the biscuits is too good. Quantity is nice. Baking is also good for each piece.Price is also low for both packaging. Quality of flour mainly of wheat flour is too good. Preservatives included are not harmful too. Sweet snack for eating it anytime. Specially at morning for breakfast its too good.", "ronnie_wajed": " The Britannia  Good Day biscuit which I have been eating since last 5 years has lost its quality of a good healthy food.   As during my last purchase 2 days back, I found that quality of the biscuit has deteriorate a lot since 1 years and the biscuits seems mere taste of flour and sugar.The color of the biscuit is not appealing to me and like its taste its also dull. The company if required need to increase its price to protect the quality of the product otherwise there is huge competition in the market. Recently I have changed to a different brand of biscuit which I am satisfied.  I would recommend Britannia to improve the quality of Good Day biscuits."}], {"knockaround": " It will be difficult to find the person who do not like gooday biscuits. They are crispy and smooth and tasteful. They are best when you eat them dipping in chai.The cashew is my favorite flavor. It melts fast, nowadays they have this butter flavor which is also good. The good thing about these biscuits is if you are hungry you can have it with glass full of milk. Your hunger would be resolved with minimum resources.Try it with milk and tell me how it tastes? Its so old brand. As far as I remember they used to come in paper wrappers now they come in plastic. Keep always in store. Have a good day!", "santoshbagri24": " Britannia biscuit considered to the biscuit king of india. The all product of britannia is good and tasty. In the year 1998 and 2001, the company's sales reach the compound annual rate of 16% against the market.Britannia comapany is one of the India's 100 Most Trusted brands.This Biscuits having a flavours like cashew, and badam pista. It is soft and crispy to eat. Ingredients which included in the flavours are Wheat flour, butter, milk, sugarand milk products. It is a good biscuit and which is suitablefor both kids and adult.This biscuit is mainly use for the tea time. Everday I use to eat this biscuit whenever I go for the office I buy this biscuit from the store and put I into my bag for the tea time.", "d_1481": " I buy Good Day biscuits because it comes from a trusted brand - Britannia. They really maintain a standard and I love the crunchy taste.Many biscuits have a bad after-taste. But these biscuits don't have any such thing. Yes I am particular about the aftertaste. So this is also one of the reasons that I go for Britannia. I specifically buy the Cashew and Choco-nut flavor. They are my favourites. The price is reasonable and is a great snack option.", "coolnitish654": " \"Good day\" biscuits are one of the premium biscuits out there in the country. They are just awesome in quality and flavor. I just like to eat them with tea in the evening in my garden. They are my regular evening snaks.Good day biscuits comes in the flavor.•Butter•Cashew•Chocochip•Pista BadamEvery flavor is just great in taste and just fulfill the desire of every tounge.It comes in different packages according to the quantity with different price tag. It comes in Rs 10, Rs 20, Rs 30 packages.You can get them at any grocery stores. Just go and get some to have a great taste.", "PC_Bangalore": " Good day cashew is the product of Britannia brand.Britannia is the oldest company running successfully and has a very popular name in the market.good day is my all time favourite  Buiscuits.It is one of the best  buiscuits which I ever tasted.good buiscuits with cashew has a very yummy taste.it is made of very rich ingredients.while having good buiscits you enjoy the taste of butter and cashew.i eat good day cashew twice in a day with coffee.Some times I skip my meal and have only good buiscuits.for this buiscits I always feel craving to have.good day buiscuits has wide range of flavours like, butter, kaju, pista etc.I serve good buiscuits to the guests.because of good quality and taste.I love my good day.", "darjibabulal": " There are many brands of biscuits available in the market but this is the highly selling brand of the country. Britania has both production bakery and dairy products. Bakery is producing meri gold, 50-50, tiger, milk bikies and pure magic etc. It comes in packing of 100 gm and 150 gm.Good day biscuits has nice taste and cheeper in price. This is average brand for common use. A normal man can easily afford it. If we go for short visit or on tour. We can keep 2-3 packets which will be great helpful to us.It is rich in flavor and has healthy ingredients. It gives crunchy and shoft feeling while eating and it melt in mouth with chocolate experience.So overall it is nice and healthy brand of britania products. No harm if we keep it at our how as a routine use and enjoy it.", "Jeanlhamu": " From childhood days, the best biscuit I remember eating is Good Day. The fact that this biscuit still is one of the most popular says it all.Now that Good Day has come in many more flavour, makes it even more popular. My all time favrouite has been Good Day Rich Butter flavour biscuit. It is soft and melts when chewing, this makes it easier and tastier to eat even without tea or coffee.The flavour comes so well in the mouth. So many biscuits have come in the market now, yet Good Day is still the best and most popular. Another great product by Britannia.", "poojacute1106": " Good day biscuits are the topmost selling biscuits. There's never been any of my morning without goodday. This biscuit has maintained its quality from start till date.I have tasted almost every biscuits but none of them could come near to good day. My day starts with only and only good day since 20years of my life.And still I am hoping there would be many more years to be added. My personal favorite flavor is cashew good day double pack. Bestest brand in biscuits, best product, best quality with best taste. I am not a biscuits lover kind of girl, but good day has really impressed me. Hatts off to this brand for maintaining their position with their quality of biscuits.", "Wadekar100": " Good Day biscuit is very tasty I just love it. It is affordable. It contains dry fruits butter that are good for health. The packaging of Good Day is very nice.I eat good day biscuit since my childhood &amp; I never stop eating. I daily eat two pack of good day biscuits &amp; I never missed it.Good Day has many verities &amp; I love the one which have dry fruits. Every one in my home like Good Day. The taste of Good Day is as same as when I was child &amp; I suggest Good Day to introduce new flavors  so that people like me can like it.", "sameershaikh77": " I almost always have a few packets of Britannia Good Day Biscuits at my home, Kids and My all time favourite biscuits my mummy prefer only good day biscuits they are very yummy and very crisp in taste Britannia Good Day Biscuits good to have with evening tea Britannia Good day biscuits have a very unique taste Most of the time when I visit any of my relative they must offer this biscuit My Kids love to have it in his tiffin box, better than cream biscuits", "ram94": " Everyone love biscuits at tea time and this Good Day Biscuits really make my day good.It is available in different flavours in wide variety but still the traditional cashew and badam flavour is my favorite.These biscuits are perfectly baked with the same taste all time. The cashew and badam just makes you feel good while biting them.They are available in different packs and people of all age enjoy this biscuits.But I feel now the amount of nuts in the biscuits have reduced and even the size too.The packing is always good and are costly.Still it is one of my favorite due to its good and rich taste and would definitely recommend everyone.", "Midhunmidhun": " Good Day biscuts are remaining in the top position from the day it was launched. I am a type of person who usually don't like to eat biscuts.After having a bite, literarly I became its fan. My choices among the Good Day biscuts are Good Day cashew and Good Day butter.Britania is keeping its quality in all of their products. I use to have Good Day biscuts during my tea time and its taste us awsome. Its price is also normal for me. Even old people can enjoy its taste. I love travelling and I always keep Good Day packets with me. Its easy to handle and lightweight too", "moinluhar": " Britannia Good Day is really very healthy and tasty biscuits. It is little crispy and also with butter. I like the taste of this biscuit too much.Also it just melt inside my mouth. The packing of the biscuit is also very good. The packing of 10rs biscuit wraps all the biscuits in a small packing that can easily carry in pocket. I prefer Britannia Good Day biscuits over namkeen when I want to have sine snack", "debasreeblr": " Britannia good day Biscuits is one of the best biscuits in India, Taste  wise it's awesome, you can feel the real butter flavor or real cashew nut, pista in it. Brittania is one of the best biscuit brand in it  india. so quality wise it's best.These biscuits are very crunchy and sweet taste so all the children can like the flavor.You can easily afford it because price is cheap and different type pack size is available in market so you can buy as per your choice.You can easily use it for your children snacks it's healthy and tasty.Start your day have a good day biscuits.", "swtneha31": " I like biscuits a lot like oreo, horlicks, 50-50, dark fantasy are my favourites. I have tried several biscuits till now but good day is something different.A rich aroma of butter comes from it and it taste also very nice. its crunchiness is its usp. It looks like we are having butter only. Me and my family all likes its taste very much. It goes best with your tea.Guys u should also enjoy this biscuit with ur family and favourite tea.", "Angel456": " The best biscuit I have tried ever. good day biscuit is very nutritious and good in taste and fresh in quality.it is the most trusted trusted brand in the market.there are many different types of biscuits available in the market but this the best biscuit I felt.there are cream biscuits available  but good day is simple that makes it different  from others…It is mine and my family’s one of the favourite biscuit because of its awesome flavour.but it is little expensive as compared to other biscuits.that is the one thing I didn’t liked about it much.before it was available only in one simple flavour.but now they have introduced it in kaju badam, and pista flavour.that will everyone will love about it.it comes in round shape with some design made on it that’s makes its looks good.I have started trying this from very long time and I am satisfied with its quality but I want to tell them that they should increase biscuits  quantity.i used have it my tiffin in my school days.according to me it is the best biscuit that everyone should try.i am sure you will love it.niceee!", "sachin_wadekar100": " Good day is biscuits made by Britannia which is leading company in brand .There products are good and healthy for all people. At tea time the good day biscuits are good for all people.There are many flavours of this product like Badam Pista, Coconut, Butter, Cashewnut I like cashewnut and badam pista flavour.Me and My whole family like it except my mom.This biscuits are very yummy and very crisp in taste . These biscuits has unique taste that other biscuits and taste is same as previosly.The price is also affordable but quantity is not so good because it is good .When you eat it with tea that tea have less sugar or without sugar because good day biscuits have very much sugar quantity.Overall it is good.", "sandeep3": " Good day biscuits are the product of britania.Good day some varities like butter, cashew, pista, and choclate we can find our type of good day based on our taste.We take this biscuits for casual use and we can take this with milk no matter what which occasion you take it will serve you good taste.These are the biscuits I am using from so many years and I never got disappointed.Go for these when ever you want to have a good time.", "sourabhsj": " Good Day biscuits are the very tastier biscuits to eat.I have tasted much kind of biscuits some of them are very costly but some of them contain dry fruits and many more.but this biscuit is so amazing to eat. When iam so hungry I eat only good day biscuits.This is my all time favourite biscuits to eat.These biscuits come in may flavours but I love to eat in butter and cashew nuts.These biscuits taste better with tea.", "drjyotiphd12389": " Britannia good day biscuits are very tasty.I always eat good day cookies at tea time. I can even eat it without any complimentary item.There are various flavors of this Biscuit like badam pista, coconut, butter and cashewnut, but mostly I like cashewnut flavour and other flavours are also good.Whenever I am hungry. I prefer this cookies, it quench my hunger and fill my tummy.it is very tasty, crispy and rich cookies. Good day brand is among the fastest growing brands in Britannia's portfolio.To maintain its crispness put the cookie into air tight container or in a plastic cover."}], {"poo134": " Good day biscuits are awesome.. It is very testy.. I used to eat good day biscuits at tea time... There are various flavour like butter,  cashewnut.But I dont like butter flavour that much. So the cashew-nut is good. Price is also normal. But now size of biscuits became smaller and smaller. But test is best.. Sometimes, we got one bowl free with good day biscuis.. It was interesting to get bowl. I like good day biscuits most.", "padmanabhan2654": "Recently Britannia Good Day Biscuits have launched the pack with the slogal WIN A 22 CARAT GOLD COIN EVERY HOUR and trying to boost their sales of this product.They have indicated the following :Log on to : gooddayagold.com and follow instructions.On logging the following appears : Server not found.Now why such a big company like Britannia is advertising with false logging sites and making a foolof the public.?Is this the way they want to cheat the public and make money?I wonder how many people in our country would have got cheated by sending SMS and making phone calls to the indicated numbers given on the wrapper.Why is the Government not taking any action against these misleading advertisements?", "mukund21in": " I used to feast on good day biscuits but the win a gold coin advertisement is a diversion for the consumer from the smaller size and more maida taste on tongue!!It not only s*cks in taste but it is less crispier and harder to chew!The quality is bad, it has become to sweet and more maida taste on tongueThe size is smaller and recently it had increased the price from 13 to 15.I think it is a Marketing gimmick to create a diversion of attention of the consumer to the gold coin so we forget the size and bad taste that it leaves!Will not buy ever and wont even recommend. Hope everyone thinks on this front! ANother review will come from me on Britannia Hyfibre Digestive biscuits soon.Thanks", "prayaga1989": " Good day biscuits are always my all time favorite biscuits they are very yummy and very crisp in taste. Britannia was always good at making good day biscuits. I have been eating good since my childhoodGood day biscuits have a very unique taste among all users this is the only reason why its being so popular and these come in different packages starting from 10 rupees. It has 2 flavors cashew being my favorite and the other one which I really don't like. If you love cashew then you are a real lover of good day biscuits. Though there are other good brands this good day biscuits are always addictive. Recommended", "Ghazala786": " Britannia Good day Biscuits are my favourite, I simply love its taste.So crunchy and tasty. Price Rs 20 for 100gms, thus very economical for a price of a good biscuits from a reputed brand.Now a days various flavours of Britannia good day biscuits are available, my favourite among them is pista badam, it had good quantity of pistachos in it.Its easily available at all grocery shops, superstores &amp; Malls. Quality of biscuits is excellent, much better than the local made biscuits &amp; cookies, can be given to small kids or elderly people also without fearing any type of stomach upset problem.", "alok": " In sept'10 v purchased some biscuits from a city's  Big Bazar  store.The quality of contents of one packet of ur  Good Day(Rich Butter) **is not of desired satisfaction. the taste of biscuits is not good, it gives a feeling that the material used was not up to the mark of your  Quality Control or some other reasons. V r in regular use of ur products(not only Good Day but other brands also) since long n like almost all the flavour of Good Day , but it dishearten me this time. Anyhow, I'm informing u 4 necessary decision at ur end. I'm still keeping partly used biscuit packet under reference n details stamped on the packet r given below::--      Net Wt: 207g      PKD. ; 26/07/10      LOT No: 21109          With good wishes  P. Chaurasia", "tarandipsingh": " I have purchased a brittania goodday pack but to my surprise when I opened it the biscuits in the pack was overbaked and black in colour and their taste was bitter. That was very annoying to me because I am very old customer of brittania. The information regarding the pack is lot no.71177 mfg date 08/02/2011.I say that please do not go brittania products as most of the time their products are not good in taste and also the cost is high as compared to other manufacturers.", "bellrings": " Britannia good day biscuits are very crunchy and tasty and it has different flavours of dry fruits such as cashew, pista and badam flavours. Whichever products you select there is small pieces of dry fruits present in every piece of biscuits.The biscuits is very heavy and its very healthy. Its not a cream biscuit and it is good biscuit while having tea. I always enjoy good day biscuits during tea time and I love it.It is one of my favourite biscuit and it is very awesome and I always enjoy having it. When we have it fresh its very crunchy and when we pull one bite it sound very crunchy.", "payalk832": " There are many products in the market since years, often degrade their quality after a while. However, Good Day has been giving the same quality amazing biscuits since years. They are quite addictive, have it once and you are surely going to have it again. My parents’ all time favourite are these biscuits as they are very healthy and nutritious. It comes in two flavors, however my favourite are the cashew ones. The quantity of cashew in the biscuit is so much, you will have it in every bite. The price of the biscuits are unbeatable, very reasonable as compared to any other biscuits. A very nice biscuit with great quality and of course superb taste. Must have if you haven't had till date.", "triloki1092": " Britannia Good Day Biscuits are like staple biscuit food of India. Everyone knows about it and every one eats it and even serves it to guests at home. I almost always have a few packets of Britannia Good Day Biscuits at my home.I even eat it as evening snacks. They always taste good, uplift my mood and are crunchy and fulfilling too. They taste better if you have cold milk to accompany it.They are easily available and priced very aggressively. Many a travels I have spent with Britannia Good Day Biscuits as my safe and hygienic companion.When in doubt, buy a Britannia Good Day Biscuit packet.This reminds me of a joke:Girl: Have a good day!Guy: Main gudday gudiyon se nahi khelta!;P", "seemajaiswal17": " Good day biscuits are very nice specially cashew and butter flavour. In every bite there will be cashew. And the crispyness is also nice. Specially my mumma prefer only good day biscuits. She always prefer this biscuit only. Price and quality is unbeatable if we will compare with other products.Packing is also very nice. Me and my family always take the same if we go somewhere for outing. Fully satisfied.", "Bhaarath": " I bought Good day badam flavor, butter flavor, cashew in Coimbatore Army Canteen, Coimbatore, india. The biscuits are overbaked and black in color and lost its flavour. How the quality department is approving like this and supplying to army canteen also. People should take severe action for such a p oor quality which is not worthy. I am residing in Dubai. I used to get good day badam, cashewnuts and the name is written Sultanate of Oman. But when you eat good day in Dubai what a nice flavor and taste. If you eat one biscuit you can eat 10 biscuit because of its quality. There is a vast difference though the same packet same company. Why they are cheating Indian people. Though all the products are coming in India Indians can use only worst quality and the good quality is exporting to foreign countries. The day we get independence so many leaders suffered a lot for their country. But why good quality cant give to Indian people. First we have to give best to our country. Please anyone see have to check the quality and taste of Indian good day biscuits. In foreign countries if there is any lack of taste if we give to the municipality they completely ban the product. But in India who cares about consumer court if you give money you can adjust any one.", "dr_jhansi31": " I have been buying Good Day biscuits for a long time now. I used to like the taste and quality previously.But from a month or so, the quality is very very poor. When I buy a big packet which I thought it will be economical, the quality is so bad that I could not enjoy eating even one piece. There were no cashews in any of the biscuits. Only one or two biscuits had small two pieces of cashew.And the small packets which I had bought last month were totally burnt with black color and bitter taste.This was mere waste of money and also spoil the health. Till now I have bought 5 packets from different shops and all were totally burnt and black.I dont know why the company is releasing such packets of low quality into market? And it is also affecting the health of people.", "dsat_kut": " Britannia serves its classic Good Day biscuits for years. The rich flavor of the biscuits still persists.Over the years I have watched companies degrading the quality and quantity of their products. But I did not see these changes in Britannia Good Day.Good Day has 2 varients Good day Butter and Good day Cashew. And I like both the versions.  Other biscuits companies just promise  to add nuts, but Good day doesn't fake it. While eating Good day Cashew you will feel the pieces of cashew nuts.The only complain I have with these biscuits is that I feel they are too much buttery. After eating you will feel the left over butter on your fingers. Which makes me feel that these biscuits are unhealthy if eaten too much and that's where is limit my consumption to 2-3 biscuits at a time.To conclude I always enjoy my Good day biscuits, they are rich and tasty.", "Aniket22": " Britannia Good Day Biscuits, yet a another best product from britannia. They are one of the most oldest production from britannia. They are classic Biscuits but rich in taste comes with cashew and almonds inside them. they tastes best with tea but can also  be enjoyed separately. excellent Biscuits in short:)", "SuraZKumar": " Britannia Good Day biscuits are good in taste and crispy. I was very much satisfied with the taste of biscuits and its quality. I very often eat small packs of good day biscuits in my office with hot tea. Overall one of the best biscuits we have in india.Britannia Good Day was launched in 1986 in two delectable avatars - Good Day Cashew and Butter. Over the years, new variants were introduced - Good Day Pista Badam in 1989, Good Day Chocochips in 2000 and Good Day Choconut in 2004.This rich cookie enjoys a fan following of consumers across all ages, loyal to the brand promise of a great taste, evident from the visibly abundant ingredients. Good Day is among the fastest growing brands in Britannia's portfolio and it has been the leader in the cookies category ever since its launch. The brand is synonymous with everyday treats that infuse happiness into people's lives.In Britannia Good day, You can find various flavors like Good Day  Cashew, Good Day Butter, Good Day Pista Badam, Good Day Chocochips, Good  Day Choconut, Rich Butter Cookies, Rich Cashew Cookies, Choconut  Cookies, Butterscotch Cookies, Choconut, Choco Chip, Rich Cashew Cookies  ATC, Rich Pista Badam  ATC and many more.After two decades of magnificent success; it was time to give the nation yet another reason to have a good day. Abundance, goodness, indulgence and now unrestrained joy - that is the message of this new campaign.Good Day truly believes laughter and happiness are infectious, it transcends race, caste creed unifying humanity in an inclusive emotion.The brand perseveres to infuse cheer, hearten the nation and enliven lives. With its rightful place on the front page of The Times of India, Good Day gifts the nation a priceless treasure, that of spreading JOY!How to keep the biscuits fresh?This is the question that raises in everyone’s mind. Normally when you open the biscuit, with in one or two days it will loose it’s crispiness. To avoid that you need to place your biscuit in a air tight container or tightly mold it in a plastic bag/ Plastic cover.", "shruti2708": " I always eat Good day biscuits at tea time.I like to eat it with tea or coffee.I can even eat it without any complimentary item.I like its cashewnut flavour rather than butter flavour.The price of this biscuit is much high and the biscuits in each pack is much less.Whenever I am hungry I prefer eating it which would quench my hunger and fill my tummy.:) Rather than eatin unhygienic stuffs like vada pav and all have a good day!", "tanaykochrekar": " Shortest Commodity Reviews: Britannia Good Day BiscuitsI just love to start my day with a bite of Britannia Good day biscuits dipped in tea. They come in three flavors: Butter, Cashew Nuts, And Pistachio.I love the Pistachio among them all, but it is too pricey to have on everyday basis. So I stick to butter cookies for everyday morning tea session. Britannia Good Day biscuits are exceptionally sweet, made with wholesome and homogeneously uniform batter, they just make your tea awesome if you are having with it.So basically, you do not have Britannia Good Day biscuits with the tea, you have the tea with Britannia Good Day Biscuits!", "Addy_Ahmed": " Good Day is very familiar to me, Most of the time when I visit any of my relative they must offer this biscuit. I was amazed whether it is made for guest only. But yes, it is very tasty and even seems good when you serve it to your guest. Even at my home  I have observed that good day is always present in kitchen. I asked mom about it so she said that guest may come at any time so we should have atleast something worth to serve them.Since it is present most of the time or I can say all the time at my home it has become one of my usual snack. Even sometimes when I am in hurry I just take one packet of Good day  and run. Its one packet is enough for light and hygienic snack. Even when my friends suddenly come at my place just Good day makes my day with my friends.I would only say that one must have Good Day to make his Day Good!", "dimpleas": " Very tasty. I love all the variant like Cashew, Almond, Butter. I general use to have it with tea at afternoon. My husband likes the cashew flavor and kids like butter. So I buy all of them. Its taste is really better then other biscuits not very hard to bite. My little son can easily chew it.As it is a Britannia Product so no need to say much about its quality the brand name is enough. But then also very good quality and enough quantity at given rates.I really recommend to other to try it once you will surely like it."}], {"butterscotch": " I love all Britannia products. Britannia biscuits are awesome! Some of them are Britannia bourbon biscuits , Britannia Cheese Crackers, Britannia Glucose biscuits, Britannia Little Hearts, Britannia Marie Gold biscuits, Britannia Snax biscuits, Britannia time pass biscuits and Britannia fifty-fifty biscuits.Whenever I  walk into the supermarket, I never fail to notice those familiar packets of Britannia Good day biscuits. I just LOVE those  butter biscuits and the choco-nut Good day biscuits. They are UTTERLY DELICIOUS!But my most favourite  is Britannia Good Day chocolate-chip biscuits. They are HEAVENLY! Ah! How I enjoy eating those simply sapid and luscious brown biscuits!As I am writing this review, my mouth is chewing a piece of the simply sapid and luscious brown good day chocolate-chip biscuit. It is made of wheat flour, sugar, cocoa and cocoa products, vanaspati ,leaving agents, salt, permitted emulsifier, colour, vanilla, chocolate and antioxidant.But these biscuits are fatty.  You can enjoy the magic of these biscuits once in a while, but it is unhealthy to eat them very often.Surround yourself in chocolate ecstasy with Britannia Good Day Chocolate chip biscuits. Crunchy biscuits  embedded with delicious chocolate chips, to satisfy all your chocolatey cravings. Relish every bite and have an uncommonly Good Day.P.S. I wanted to write a rvu separately on Britannia chocolate -chip  biscuits, but only this category was available.", "durgaprasad": " Iam very fond of biscuits..as you already knew about it...my colleague bought 2 packets of britannia biscuits (Goodday - Cashew  dated : 28-06-2005) we are in mood to celebrate his birhday very briefly and found greenish tinge on some biscuits we sorted, tested even tasted, at last found that it is not an edible product or suitable to eat...we also searched few more packets for the same..yet we didn`t find them...why!!?  what happenned to our beloved brand!!?..we broke our heads..but couldnot find any solution ..we dared, consumed some of them following a tea party...but I was desparately in search for the reason behind it and photographed them...if you need please look the attachment herewith..please donot get bored by this topic..if we don`t fight for it now..tomorrow there will be a big mistake which may cost our lives....may it be a fungus, stain, ink or some harmful substance/matter mixed to it...under poor supervision...i also pray food protectors or supervisors and law to look in to this matter seriously...bye for now,durgaprasad", "mayamemsaab": " What is it that is so exciting about tea time?Tea time between 4 pm to 5 pm is the best part of my day. I have always wondered what is so special about this time, but have never been able to figure it out. There could be several reasons may be because tea time is close to finishing hours at work. But I have enjoyed my work and have never looked at the watch waiting to finish work. May be work tires me and therefore makes me look forward to the hot steaming cup of tea to freshen up. But its not just tea that energizes me, coz at times when I have had tea at my desk..it has not really boosted me as much as when I have it with my colleagues. May be I am looking for company and the normal gathering that happens during the short tea break is what makes it so interesting. There is another reason - Good day cashew biscuits to go with the tea.After all tea is no good without biscuits. Goodday biscuits were not really my favourite ones. I would love the salty ones, but with no time and thanks to my friends, the taste of goodday biscuits grew on me. Now I am hooked on to the taste. We have it in the most Indian style, dip the biscuits into the tea and then bite into the soggy biscuits. Is there a better way to have the biscuits? I am sure if I were to have it on my own, people would have called me names. But when the whole gang has it that way", "sheilaR": " I LOVE MOST BISCUITS!!!OK confession time over. Iluv them but they do the worst things to my insides so I hve to restrict my intake, which is just not possible with most of the Good Day biscuits. U know? 'Yeh dil maange more' symptoms?So one day I was generally looking around the saamne wali dukan [local shop] when I spotted this choco biscuit. Couldn't resist so took it home and tried it and hey I FELL IN LOVE !!Chocolate: Plenty and very original flavourNuts : plenty , crispBiscuit: crispish-chewy. If you like your biscuits very crisp keep the packet in the butter box of the refrigeratorfor an hour and then try. The flavour of the choco doesn't change like in chocolates. [i prefer chocos thawed out]For Moms: Use it as a reward for good behaviour, grades, incentives etc.For hubbies: Present her with a pack whenever u want to 'patao' her.For the elderly: treat yourself to one a day -but only with your meals. This is no ordinary cookie-packed with calories(50 per biscuit), fats(3.2g - that's 30 % of each cookie), nuts, maida. Its bound to set your lipid profile into a tizzy.For housewives: Same as above (we really live a sedentary life). 10 in a pack of 100g.Joh bhi ho. Par CHODNA MAT!! It?s the closest thing to my mom?s chocochip cookies.", "arunroy": " Good Day is one of the famous brand names of Britannia. It has some variants like Butter, Cashew, Badam Pista. It is a soft biscuit not crispy, and breaks very easily. Available in different packs. Normal pack is of 10 biscuits weighing 100 gm, packed by laminated wrapper. It has to be stored in an airtight container otherwise; it will become very soft like many other biscuits.Some useful information is printed on the wrapper, e.g.Weight – 100 gmCalories – @ 505 KcalCarbohydrate – @ 62 gm / 100 gmProtein – @ 8 gm / 100 gmFat – @ 32 gm / 100 gmIngredients contain Wheat flour, Butter, Sugar, Milk and Milk Products, Salts, Permitted Flavour, colour etc. Cashew, Badam and Pista are also added as per variant name.So, it is a high calorie biscuit and most suitable for little naughty one. Addition of nutrients like badam, pista, butter, cashew makes it really enriched as claimed by Britannia. Taste is good.Let me share some of my observations –A) Marketed by Britannia but manufactured by some other company as mentioned on the wrapper. Nowadays, that is the trend. Big one is out sourcing even their famous products. Britannia must have engaged their quality control people to check QUALITY and HYGIENE during third party production.B) Wrapped by Laminates – Laminates are made of plastic sheets with the help of laminating adhesives. These adhesives are normally twin system, one part is adhesive and the other part is hardener. There is possibility of migrating one of the components of adhesive system through thin plastic sheet to food. This migration may change taste, odour / flavour of the biscuit and it is harmful. Only food grade adhesives are recommended for food products. Management of Britannia must ensure use of food grade adhesives for laminates used for food products.Information to parents –a) All biscuits contain Maida (Type of wheat flour) and it is not easy to digest unlike Atta. Due to this, a child may loose appetite if he consumes too many biscuits a day.b) Balanced food is essential. Therefore, only high calorie biscuit like Good Day does not serve the purpose. Vegetable, Milk, Fruit, Egg is essential.c) Most important – Infants may not be able to make out bad taste or odour of spoiled food. So please, check yourself before feeding even Good Day Biscuit.To Executives – During brain storming meeting, we eat many biscuits form the plate with too many high calorie biscuits like Good Day. Especially the successful, workaholic young one, you are under stress from very young age and miles to go to touch the milestone. Take care of Health. ", "hstp": " Dear Sir,We purchased one packet of Britania Good Day on 21.02.006. The details are as follows.Packed on 20.07.2005, code-BA3V3, . We found Nylon thread inside one Biscuit which could be very dangerous to my child's life. We have kept this Biscuit with nylon thread inside the buscuit. his thread is being inserted throughot the Biscuit.This is a very serious matter &amp; we want to lodge our complaint through prper channel. Please come back to us immediately.My contact No. os 09372402546 &amp; Email ID is santoshsingh21@hotmail.comPh. 020-27441908We purchased one packet of Britania Good Day on 21.02.006. The details are as follows.Packed on 20.07.2005, code-BA3V3, . We found Nylon thread inside one Biscuit which could be very dangerous to my child's life. We have kept this Biscuit with nylon thread inside the buscuit. his thread is being inserted throughot the Biscuit.This is a very serious matter &amp; we want to lodge our complaint through prper channel. Please come back to us immediately.My contact No. os 09372402546 &amp; Email ID is santoshsingh21@hotmail.comPh. 020-27441908 ", "alagu_hcl": " I dont have words  to explain abt good day biscuitsI  had been eaten a lot of biscuits in other products but I never ate biscuits like good dayI really proud of u U peoples producing biscuits like foreign company taste  Iin economy cost. Thanks a lot u peoples giving a chance to me to say about extraordinary taste of good dayWat I like in this biscuits  as follows1.taste2.smell3.design4.packing5.highly hygienic6.quantity7.company image8.more than this I dont have words to explain abt ur productsand one more important thing I should have to tellI am working as a field engineer In my working days i  dont have a time to eat foodsIn that time  i really preferred  ur healthy product  GOOD DAY  to save my time and make me more energetic.Lot of days in my life started with good day and end with good dayYour biscuit are crunchy other biscuits are soggyYour biscuits are taste other biscuits are worst", "mohanR": " Britannia Good Day is a biscuit that kind of grows on you.Funny as that may sound 'tis true.The first time you eat one you forget about it.But you when you see the familiar bright colored packet you're done for.You must take one.And one more and more...Its really kinda addictive.Specially if youre the gastronome type.Actually the taste is bland.Its somewhat crusty too.The flavor of butter just cannot be missed.The pistachio and kaju are there.Strangely its always lighter than you think it is.But I prefer cream biscuits.Good for my paunch you see.Good Day is ideal for snacking.It kind of kills your see-and-eat appetite if youre watching TV.But as mentioned before its quite irresistible at other times.Like all Britannia items Good Day is free from defects that are harmful to the consumer.Each biscuit looks and tastes just the same which is no mean feat.The product in our household has never caused any health problems and never will.I swear by Good Day.", "prk_mids": " Britannia Good Day is one of the  products of Britannia Industries Ltd.  Good Day, biscuits with butter,  is round and  somewhat thick. In terms of nutritional contents it is good. Good Day is good to start one's day good.The biscuit is particularly liked by children. It is not crisp, but is somewhat soft and  is easy to  bite. Earlier probably the product was available only in small packets. Now it is available in large packets also. Going by its label it is best before eight months from packaging. The package has the standard Bar Code.The package has the slogan Eat Healthy, Think Better. But the correlation between the two has not been established.", "my_sanshine": " Now, let me tell you how I fell head over heals with this pure magic treat.....Myself and my hubby were on our way to the airport to pick one of our friends. On the way, I was 'whining' that I was hungry. So he stopped at one of the small retail shops and after intense scrutinising of the biscuit section, I picked up 2 packs of Britannia Choconut Good Day biscuits. Well, what really made me buy this was the advertisement. I was asking myself,''now, is this biscuit that delicious?''. So anyway, happy that I had something to fill up my 'little tummy', we set off.I opened the pack very carefully (as my hubby will freak out if I spill any crumb of the biscuit on his 'darling' car). I had the 1st bite and I went...''this stuff is awesome....one of the best chocolate biscuits I have ever tasted....do you want some?''......my hubby, after checking whether I had spilt any crumbs in the car, said ''yeah..ok''.....so I popped one into his mouth.And that was the end of the 2 pack of biscuits. By the time we reached the airport, I alone finished one pack and finished the other pack by sharing it with my hubby. It was pure heaven....really very yummy yum.....But one thing to take note of..those who are health-freaks, should think twice on consuming this coz it's about 50 calories per biscuit. Boy! popping in 50 cal is so much easier than trying to burn it out....Ask me....I know what I go through to burn just 100 calories in the gym (but it's heaven to pop in 2X50 can choconut biscuits)So, I consume the biscuits when I feel that I deserve it.....like for e.g when I behave...Nah!....So go ahead.....have a treat...have a Choconut Good Day!", "newuser": " Hi friends!The word good day brings a taste of good day biscuits in my mouth :) I know, I know I am a foodomanic, but yes this one is my favourite biscuits. I used to eat a lot of biscuits when I was a child, but then stopped eating all of a sudden and now again have started because of just one day.One day in the morning I was extremely hungry and I asked for something to mom. I generally have tea and a glass of milk before leaving for work, so there was no brakfast and I was given Good day. And I opened the pack and simply took 2 biscuits and kept it back where it was. As I started to eat dipping it in tea, I was so happy with the taste. It was like heaven. :)I know you all might be laughing.... but thats the fact. suddenly thoughts came in my mind like.... ahhhh God gave us so much to eat.... so many varieties of food, etc. I even said it loud for my family members who laughed at it. And slowly in that heavenly feeling I gulped down the whole pack!It was simply wonderful to taste with that cashews coming in every now and then. They are filling too. As I didn't feel hungry at work ( I generally feel hungry all the time) ha ha ha.So I am very happy with Good day, makes my day! Its worth its price which is 12 Rs. and yes a good idea to carry it along with you. will help when you really need something... Eat before you faint guys... enjoy and have a good day!!!"}], {"Slcmounika": " One of the most popular brand in biscuit and cookie world is britania. Especially good day is very delicious and healthy bicsuit. These biscuits are made up of wheat flour. The quantity of other ingredients and food saftey measures are very good. Good day has wide range of flavours like butter, cashew, badam pista, Choco chips etc whatever is the flavour it maintain its quality standards. I like good day biscuits and cookies very much. Even it starts from lower prices itself. The 5 RS pack contains 6 biscuits. And it is very easy to carry. It is so soothie and very soft to eat without any crumps. And it will digest easily as it is made up of wheat flour. The product quality is very good the packing is hygiene and the product inside the pack won't degrade early. Good day has its taste in every bite and when ever I eat this I never forget the flavour and taste of cashew in each bite. When ever I am felling depressed or frustrated I eat this biscuit because it changes my mood and my favourite flavour is cashew nut. I highly recommend you guys to taste it at least once in ur life.", "Priyanka108": " Hello I am priyanka and I am writing my personal experience about with a review a Biscuits this named Britannia Good Day Biscuits.This biscuit is so testy and delisious.Britannia is one of the standard company in manufacturing of biscuits all over the india and the other different countries.Britannia good day biscuits are one of the sweetest biscuits among all the biscuits.The smaller joys of life that can brighten up one 's life every day often get ignored in the pursuit of larger joys .Good day will act as an enabler in enjoying all those small movments in every day life .The good day biscuits are available in the form of different types like Cashwes , choco chunkies , better cookies , nuts cookies , chocochip and choconuts. Britannia good day biscuits are one of the largest selling biscuits now a day .So friends bought this biscuit and eat it so testy. So guys read my review and rate me.", "krrish4444": " Britannia Good Day Biscuit has more than 15years of TrustIt Has Trust in Taste and FlavorIt Consist of Kaju which is Good for HealthSo It is the wonderful product which is more addictableIam always eat it at journey and in Cinema IntervalThe Flavor of this product unforgettable once you eat you will know the huge taste of Britannia Good Day BiscuitIam Biggest fan of this Britannia Good Day Biscuit I hope you will also became a fan of it if tastethankyou.!", "yogespalariya": " Hello friends I am using Britannia Good Day Biscuits. It is really a very nice product of Britannia. Its Flavor gives you real test of cashew or butter. When I eat it I feel real the test of real good butter and cashew flavour. It a brand of Britannia, any one can trust on this company. It gives you best Quality Biscuits. All integrants are used in this biscuits is very good quality. every one can eat this biscuits. Britannia Good Day Biscuits comes in a very colorful packing. It gives you a very attractive packing. Finaly its good product.", "annurajreddy": " Britannia is the best ever brand in the fields of the biscuit. Good day which is from this brand is of awesome taste from the day it entered into the market. In every bite the flavor will be same and awesome. The quality of the biscuit is out standing we can feel the dry fruits taste in every bite. We can just tempt to the biscuit by just seeing its pack. Packages are available in several sizes. Good Day brings a lot of goodness in the taste and the mood.", "rashig73": " The packaging is marvelous, and it yummy biscuit. The flavour is delicious and I can eat a whole pack of biscuit in one time. The ingredients are pistachio, cashew which are rich dry fruits, that gives a yummy taste to biscuit. The price is also not so high, seeing its ingredients, quality and taste. I love this biscuit to eat a lot.  The packaging is also of good quality and one is attracted to buy it, by its packaging.", "nagadi7021972": " Hello friends, I am purchase Britannia Good Day Biscuits from 5 years because it is very testy and healthy and flavor is very good.  Britannia company biscuits quality is very good,  Company using better quality of rapper paper for packing.  It attract customer to purchase this product, company give different range of product  dry fruits/Butter flavor company target all range of the customer according there  test. Overall good biscuits.", "narendraprataps98": " I'm using britania good biscuits regularly.not only my nephews and adults members of my family is crazy for it.Good day gives us the taste of butter, peanut and badam in its every bite.The composition of all the ingredients in right proportion thats why we can fell the taste of each ingredients.All the sources like -protein, fat, energy, carbohydrates are present in definite amount.All these ingrients makes the good day quality product.and thats the reasons why most of us prefer good day with water and tea also.The packing of bratania good day is done nicely by the workers.", "dayanandg3": " I have literally grown up on these biscuits and I still continue to to enjoy eating them!The fact that they are so yummy and filled with cashew &amp; butter make them the easiest buy for me! The biscuit has maintained its great taste shape and colour through all these years!This consistency makes me loyal to them!The biscuits can be eaten straight out of the pack however if you have a hot cup of tea and you dunk the Good Day in it, that takes it to a whole new level of goodness!Besides the Britannia good day is so affordable and easily available, make them my favourite!Enjoy the Britannia Good Day everyone!", "saritaahuja": " From childhood to till now we start a day  with GOOD DAY BISCUITS.Rich  in recipe.  the  Good Day  has  been popular among masses  with its  bite and taste . In addition Britannia   has used  ingredients like  cashew, pistachio  and  chocolate  to add spice to it brand.Good Day  biscuit  has now many variants  such  as   Butter, Cashew, Pista, Chocochips, Choconuts .A day is never thought to start without a good day biscuits.", "chauhannandita80": " Britannia good day biscuits are one of my favourite biscuits . It tastes very delicious. They come in variety of flavours like pista cashew butter etc. Pricing is according to there flavours. They have maintained the quality of there biscuits. All flavours are my favourite but pista flavour is the best. Its packing is also done very well. these biscuits can be eaten without any tea or coffie with it. Some times I eat it as a desert after my meal.", "vsntlxmn": " Britannia good day biscuits are very tasty and yummy. I have tried several flavors of Britannia Good day biscuits, all are very good. Very tasty and nutritious. My favorite is Pisata badam as it contains lots of chopped pista &amp; badam. other flavors are  choco chips, rich cashew, rich butter etc. They are much better than local biscuits or cookies from competitor products .The biscuits are made of refined wheat flour sugar butter and edible vegetable oil.But I will again say that the taste of biscuit is really good. A Rs5 packet of rich butter cookies has 6 biscuits in packet and weight 39grams. Product quality and Packing is good", "vikaskumar31292": " This is very tasty n yummy biscuit. It is full of rich quality ingredients like pistachio, cashew nuts etc. Its pakaging is very gud. I can eat this biscuit at any time full packet. It melts into my mouth and very smmothy in taste. its really awsm. Every people can try these biscuit. Its price is very much worthy at relevant pricing. No biscuit can be compared to this biscuit as it is the best biscuit sold in india.", "amitzuas": " Britannia good day biscuits are very tasty and yummy. I have tried several flavours and all are equally good, tasy and nutritious. My favourite is Pista badam as it contains chopped pista and badam. They uses wheat flour, edible vegetable oils so they are good for any age group I eat almost whole packet with tea. The only drawback is that you can not eat them alone because they are quite dry and you need tea or coffee to have them and I find it very tasty to have these with tea. These are much better then other local biscuits and cookies and are easily find in the local market because they are very popular. 4.5 out 5 from my side.", "Kum21": " Hi, friends. Everybody knowns and taste Britannia Good Day Biscuit. I share my personal experience about tastie biscuits. It comes in various flavours like butter bite, cashewnut, almond etc.I prefer cashnuts flavour it's taste awesome .I always eat small pack of Good Day biscuit with my tea.It comes in various size . I carry 10Rs biscuit in my purse .If you starving it satisfied you hunger in few minutes.I recommend everyone taste Britannia Good Day biscuit. You feel good after taste it.It is a good quality product.I like product packaging too.", "vinodhreddysteve": " The product is good day . it is one of the famous biscuit brand in the market .it has high demand in the market.it is made out of wheat  and butter .it has great  taste and good flavor satisfaction. it has very good taste and good quality.the product quality is good .they  have good quality of wheat and butter so they provide fresh and tasty biscuits .which are loved by the customers . it has good reputation in the market due to high quality product.the packing id good they pack with great care .the cover comes inside with silver coating .to keep the biscuits fresh and healthy .", "kkrcbk1995": " Britannia is one of the standard company in manufacturing of biscuits all over the India and the other different countries.Britannia goodday biscuits are one of the sweetest biscuits among all the biscuits.The smaller joys of life that can brighten up one's life everyday often get ignored in the pursuit of larger joys.Good Day will act as an enabler in enjoying all those small moments in everyday life.The Good Day biscuits are available in the form ofdifferent types like  CASHEW, CHOCO CHUNKIES, BUTTER COOKIES, NUTS COOKIES, CHOCOCHIP, CHOCONUT.Britannia good day biscuits are one of the largest selling biscuits now a days.", "tejurana": " Hi all, Britania good day biscuits are very delicious biscuits. It feels premium and crunchy in every bite. You get flavours . I personally like the butter cookies. It is the best breakfast you can have with a cup of tea. When having with tea it feels really soft and melts in the mouth. Whenever guests come to our house we serve them with these premium cookies and they enjoy it.  I would definately recommend these cookies to everyone as its super delicious. When you are hungry in office you can munch on these bisuits and feel full .", "kkqa1978": " Hello friends, here I am sharing the my personal experience with the britannia good day biscuits. This is best ever biscuits for the tea time and we are all love this. Whenever my husband comes from the office, we are serve this biscuits with the tea. The flavor is as best in the all other biscuits available in the market. Now this make our daily consuming item because its quality is very good and having very attracting packaging."}]