[[[[[[[[[[[[[[[[{"seriously_555": " I can never explain in words its taste.its my childhood favourite biscuits.i can eat anytime anywhere .i like it most because its suger taste and cunch like never before.its heart shape take my heart when my kids go out gor grossary shop yhey never forget to buy this for me and its new pack of 󌡘 is family pack", "syedarukiza93": " In this Britannia little hearts I have my so many childhood memories when ever I have it I remember that Sweet memories so I love it it's Sweet in taste very simple taste snacks u all should try it once its very Good and old trusted company and Good package simply best snacks in tea time and during travel Good time pass", "samirsm6": " Britinnia little hearts flavor sweet and testy.little hearts has been unique in two sense one was packing and second was bite size small heart shaped biscuit coated with sugar.quality was good, little hearts was launched in 1993 and targeted the growing youth segment.A completely unique product, it was the first time biscuits were retailed in pouch packs like potato wafers.The launch message introduced a special taste experience that made the unlikeliest characters-like dracula and frankenstein-melt.in 1997, the'DIRECT DIL SE' campaign encouraged youngsters to openly express thier feelings and in 2003.two variants called little hearts chocolate and little hearts sesame werw rolled out with a campaign'DIL SABKA ACTUALLY SWEET HAI' with little heart, Britannia has tasted the sweet taste of success.love u little hearts.", "shail.2801": " It's Very Tasty &amp; Yummy.I like it very much.It's taste is few sweet sweet mix.It's Quality is very good.It's looks smart design like as heart.It's cost is nothing instead of taste and quality.I am sure it could no any harm of body.I must sure all children's and younger also like this.It's safe for all Peoples.It's packing is very good and tight.It's mixture of Floor and Sugar.", "tuskers19": " Little hearts the name itself is needed to understand about the reputation of the product produced by Britannia. Flavor is absolutely heart touching when one will be consuming it for the first time, once started to get use to it it will become an unavoidable part of your takings. Britannia always have been the consistent company in terms of there product quality and maintenance. packing is absolutely an unavoidable element in this competent era, its packing is nearly good one in terms to capture the attention of the little ones in the market, but it needs to make certain changes to increase more market demand for the product.", "pashpanya": " I like to eat Britannia little hearts biscuit anytime.it is on top in my snacks favourite list.I like its name n also its shape like heart.I love this biscuits since I was a little kid .when m in the lectures in colg m enjoying this buiscuits with my frnds .nothing acommponies fun moments like a pack of little hearts.so I just love this biscuits much", "chharishkar": " Little hearts biscuits by Britannia are nice tasty crunchy biscuits with no much sugar.the packaging of biscuits is superb and the biscuits we like it so much as it is shaped in heart.and these biscuits are also advisable to sugar patients because no extra sugar.these are my favorite biscuits which I'm eating from my childhood", "vikash087": " Its taste is very good &amp; I eat the this biscuit often .Its flavor is the main reason I eat it often. Its sugar which is embedded on the biscuit is very nice, provides sweet taste. I have to say Britannia, this is one the best product which you sold in the market . Packing of this product is also nice .The design of the biscuits is very funny &amp; nice . Its really my sweet heart inside the packet. So, I love this biscuits much.Have a Little Hearts Biscuit", "swaruparani": " Dear Friends,I have bought this little hearts Biscuits while we are on traveling as an evening snack. It is easily available in local markets also. It is manufactured in India and it cost Rs. 10 and packed in red color cover with heart shape biscuits shape on it which are very attractive and cache.It is a little heart shaped biscuit with sugar sprinkled on it as a topping. It looks nice and attractive, and puffy. It is crispy, crunchy and easily melts in the mouth and the taste is awesome.To make it puffy they might have used more yeast, high in fat and sugar content and not suitable for diabetic patients and who are on diet.It is a biscuit like by all age group but it contains less number of biscuits. Overall it is a good snack item and tasty biscuit and it is available at reasonable price.", "vikaskumar31292": " Little hearts is the most satisfying chips. Its flavour is sweet and its crispyness is awsm, from the childhood I loved this product. whenever, I get this chips I love to eat this, I can eat this chips a tonnes at a time.this chips is in heart shaped, some sugar are sprinkled over it and a glossy touch makes it look mouthwatering.if u haven't tasted this chips yet, I would suggest you to try it once and you will become fan of it.", "rohitmahajan197": " The Britannia Little Hearts biscuit is one of my favorite buscuit ever I had . The biscuit of popular brand name britannia doesnt need any proof for being healthy and fresh. One of the biggest company is making this product and this product is the most liked biscuit in india .Flavour of the biscuits are the best and as I ask first that this biscuit is healthy .so hope u guyz also love this biscuits .thank you", "blaster319": " Little heart is a type of biscuit whic sweet and salty taste it come in five rupees packet it really good for snacks time I use to eat everytime when I traval I use to keep two three packs of little heart I get hungrey I use it little heart inteated of taking chips it good have liitle heart but the packet contents less number biscuits  so you can get satisfied with one packets of little heart so you need to purchase extra packets it good for when you tired of eat smiliar kind biscuits you can try liitle it realy taste and yammie.", "romitkalia": " BRITANIA LITTLE HEART BISCUITS ARE ONE OF THE PIONEER BRAND AVAILABLE IN THE MARKET WHERE YOU CAN TRUST UPON .THE BRAND IS TRIED AND TESTED AND WE EASILY CAN RELY UPON IT .BRITANIA CONTINUES MAINTAINED THERE REPUTATION IN DELIVERING QUALITY PRODUCTS INTO THE MARKET .BRITANIA LITTLE HEART BISCUITS' ARE REALLY  YUM IN TASTE A WONDERFUL SNACKS ONE CAN HAVE DURING TEA TIME OR ON ANYTIME ITS SO TASTY THAT THEY WILL STOLEN YOUR HEARTS TOO.LITTLE HEART BISCUITS ARE HAVING SWEET AND SALTY FLAVOUR WHICH LEAVES NO STONE UNTURNED TO MAKE YOU COMPLETELY SATISFYQUALITY WISE BRITANIA MAINTAIN ITS GOODWILL, LITTLE HEART IS FASSAI CERTIFIED PRODUCTS THAT MEANS BRITANIA FOLLOWS ALL APPROVED STANDARDS TO MANUFACTURE AND TO PACK AND DELIEVER THE SAID PRODUCT EACH BISCUITS IS WELL COATED WITH SUGAR AND SALT WELL BAKED AND MAINTAINED HIGH QUALITY  . BISCUITS ARE NICELY PACKED WHICH WEIGHT IS APPROXIMATELY 39 TO 41 GRAMSBELIEVE ME THESE BISCUITS ARE MOUTHWATERING, DELICIOUS, EXOTIC  AND UNIQUE IN TASTE, LITTLE HEART BISCUITS ARE ONE OF THE BEST SNACKS AVAILABLE IN THE MARKET", "harshithkumar0143": " Britannia little hearts is my all time favouritr one. From my childhood onwards I am eating this biscuit and the taste of this biscuit is so good.Flavor satisfaction:The taste of this biscuit is so sweet. I always love to eat this an most probably the heart shape of this biscuit is so attractive. Well anyone wants to propose anyone they can give this little heart to their heart.Product packaging :Coming to product packing it is awesome. The cover packing and the logo on it and probably the red colour on cover is so much attractive.To say finally, anyone will get love to this taste if he eats it for the first time only.", "Madhuraj8888": " Little hearts is the best product I have ever experienced in packed packets form The biscuits contains a heart shape with sweet taste of little sugar flavour over it As u take it in mouth chew it little it will automatically melt This presents the quality of the little hearts One of most important fact there is no cause of eating these biscuits The ultimate  &amp; health snacks Be a big hearted person and eat all the little hearts go for it try I strongly recommend u all", "goyaldaksh552": " This is very good quality of biscuits with its crispy taste I Loving since form childhood I ate this biscuits a number of time and I liked its taste very much with sweetness and crispiness.Product quality is good and also of things which used in it making.product packaging is quite good. But now so much attractive and good.But Little hearts inside it that is very much OK Quality of biscuits of good.", "rohit989": " Little heart a childhood memory if I am right. now a days too we get the little in market at 5rs so much less cost.i used to in childhood time great taste and serve better quality product.its very sweets to eat hearts shape as new product are launched many of people dont but little hearts other than that is the best I have eaten", "Pratikshaniven3109": " Britania Little Heart Biscuits are my dam favourite from my childhood. I m can't express how much I like eating them. Its like heaven for me. No other biscuits and cookies can replace this Little Hearts from my heart.This is the best product I have ever eaten. From childhood I m eating this and day by day my craze of eating this biscuits are increasing.This are really a best best best biscuits. They are so much tastier than anything. One I was out of station and instead of eating food I bought 15 Little Heart Biscuits packets. And I was dam happy to have them than my food.If you have'nt tasted them yet then seriously you must try on them. you will be not dissapointed with it.Thank you.", "sharma11swati11": " First of all I am going to appreciate it lookOh my god too much pretty . Its heart shape really melt my heartWhenever it comes into my mind I just can't stop myself from purchasing itMe and my friend do party whenever this is our first preference . The taste is really to much nice . The sugar coated buiscuit make me feel happy", "charles32": " I used to love this biscuits a lot 2-3 years ago, but now the quality of these biscuits have totally changed. They used to be a lot sweet before, but now they aren't  and they ain't even crispy loke they used to be before. The quanity also has decreased a lot in these packets. Most of the packets have soft biscuits in it. It's like, now they are not even interested in customer satisfaction. I'd prefer to have some other simple biscuits than having these."}], {"swtminijain": " Today I purchased britannia Little hearts biscuit. It tastes so poor and most of the biscuits were broken inside the packet. The packet consist of 75% air and just 25% of cookies. There is no good fragnance that makes biscuits appealing. Britannia little heart biscuits is sugar coated biscuits but now-a-days the quality is also degrading, I found little bit of sugar particles on biscuits which even doesn't help in sweetning of the biscuits. The packaging is of bad quality.Almost every biscuits were broken. The product is really disappointing and has no value for money. If you want good taste or appearance and fragnance, don't choose these biscuits.", "navyayarlagaddda": " Britania is a brand and it was introduced by its little hearts it is a heart shaped biscuits and has its taste with sweetish with tinge of saltiness and it has a fantastic stuff it is available to all in price one 10rupees pack containd of thirty heart shaped and sugar coated biscuits so try this everyone guys just go and get these packs and gift ur lovers children and all etc .", "Riya105": " Britannia Little Hearts Biscuits  is so testy, Nothing accompanies fun moments with friends like a pack of Little Hearts. crunchy biscuits generously sprinkled with sugar, they blissfully melt in your mouth it awesome testy .The iconic gold and red pack is easy to spot and is found just about everywhere. So if you’re looking for some fun and memorable times, just grab a pack of delicious Little Hearts, your favorite bunch of friends and share", "ronakrr": " I have been eating this biscuit since from my childhood the taste of this biscuit is sweet.i like the heart shape of this biscuit . the best thing which I like about is the sugar which they add in the middle of the heart which make the biscuit more sweet  and more taste to eat . the quality of the product is also good the packaging of the product is also good which shows the picture of the biscuit", "babuchello": " Hiiiiiiiiiiiiiiiiii everyone, I am crunching this LITTLE HEARTS and writing this review about my feeling while I am tasting it.  Now, I am 24 still I have a habit of eatting that crunchy,  little,  heart shaped biscuit.I loved to eat that little heart. I think its plus point is that the look of the biscuit only because everyone like heart shape so it attracts all people even no restriction of age. In my home also we have it as a evening snackseven my mom, grandma,dad likes to taste.The sprinkle sugar over the biscuit gives a rich taste and melts in our mouth. I love the taste and richness. But the cost of one pack is so satisfactory and low budget.The quality of product is tremendous and packing of biscuit is also good. They pack those biscuits in a attractive RED and GOLDEN  colour package that magnetize all and give rich look.", "munish30": " Cookies are sweet, crispy, more or less taste like honey with sugars sprinkling on it. These are very delicious and I just love in it. As product is from good brand so we can assure it is quality product and it tastes fresh and crispy. Packaging is also nice with proper care. It is also in our pocket range but number of pieces are less in a packet. By the way these are superb cookies jaisa naam waisa kaam. DELICIOUS", "saberabanu5": " As its name is britannia little hearts . really melts my heart from inside. So crunchy so tasty that it really melts in your mouth.truelly worth the money as uaually almost all top quality brands biscuits have that same cashew pistachios taste this one is really unique with its design taste n also in price. I remember I used to have with my friends in school days bt now my children also love it very much. So, my no. One choice is britannia little heart because when u recomment to other u should really know the product well n I think I m using this product for the past 20 years.really want to indulge in it any time.", "Luthraankur2": " My favorite biscuit.This is a biscuit snack from Britannia called little Hearts. Its crispy and tasty.  It costs 5Rs or 10 cents.Palmiers is a pie that look alike butterfly, heart and elephant ears. That's why palmiers have several names.Delicious sweet and crispy pie that coating with sugar.liitle hearts biscuits are perfect as a desert accompaniment or an anytime snack.This biscuits in small heart shapes looks very yummy n attractive.It is a great sweet biscuits.I am having this biscuits since my school days. Packing is also nice with proper care.I love little hearts and I will give it 5/5 stars.They are cruncy to eat. The flavour is prefect a great mixture of salt and sugar with wheat.", "utkarshkakodia": " Britannia little heart biscut is sweet in nature.Friends I recommened to you try this biscut this different from other biscut its shape is heart like which is look very different. It is very tasty and delicious.  The quality of this biscut is very good.The packaging is normal of this biscut as you see in other biscuts. It is good for light hungur. I loved this biscut very much. It was really very good in taste. Its price is very low . I like the shape of this biscut ?.overall this product is very good its packaging is also and its price . It is value for money pack.", "raghuramdreamr": " Britannia is unique, I think they started that company in late 1993, since then guys it's true we didn't get a product to eat like that,  and no one ever produced better then this, I'm eating Britannia little hearts since childhood but never got bored of them,  still I would love to eat even you guys gonna love it. Try today guys if you not yet tried.", "saptarshig008": " When I remind my old days memory there is one biscuit that  comes in my mind every time that is little Heart.The name itself is so sweet.Even now whenever I have this biscuit I can memorise the old back memories the tea time fun with friends &amp; family.When I was a kid my mom used to bought this biscuit almost everyday, It has been our tea time delight since our childhood.Before talking about the taste I want to say the shape of the biscuit that is of a heart bring smile on your face.The heart is little &amp; it is sweet, just like a little kid.I am sure who so ever is reading this can remind back their old memories.Thank you Britannia.Thank you # Little Heart for all the good memories.", "Aggarwalmuskan121": " One of the most tasty and crunchy biscuit is the little heart . I luv its crunchy and sweet tasty .The sugar at the middle of the biscuit makes it very tasty.Its cost is also low so I can easily buy it anytime . I eat atleast a packet daily and still wants to eat more and more because it is so yummmmmyyy.", "sapnayadav2606": " Friends,Britannia Little Hearts Biscuit actually wins the heart and fills the stomach. The heart shaped biscuits are the heart stolen one that brings flavor to our tongue as well.Though a small bite is enough to get delighted but unless and until we finish the entire pouch, we don't feel like stopping munching, since it is so irresistible.Its an absolutely unique product by Britannia to hit the heart of every aged people.Little Hearts gives you the best company specially when you are on travel, watching movies, occupied by your friends and families or enjoying your snacks time.Britannia is one of the top leading brands that offers product with finest quality. It offers a complete package of eatery stuffs to treat ourselves through all the possible ways.", "anmolvashishth8298": " I loves it from the time when I was a kid, it is so hard to resist it. Not only me but my family also loves its taste and crunchiness inside it. It is a great sweet biscuit. I think it is far more better than other biscuits in this orice range. Other biscuits can not compete with the taste of little hearts biscuits. The heart shape of rhe biscuits also make them lovely and the sweetness inside it oh my god I can not explain that. I eat it regularly and never get bored of this taste. It is like a treat eating and enjoying it", "prashantgupta36": " A biscuit had come some years ago such a nice taste crispy with realibility  of britinia company a very nice thing of this buiscits it's sizethis biscuit comes in heart shape one more great thing abot of this buscuit It's packingwhich are diffrent of all other buiscuit pacing raper is in golden color looks attractive, this is very lite and very healty by content and sugar trooping taste increaseany age of person like this busicuit one special thing due to packing It's very comfotable to carry .", "Modi_Prashiv": " Britannia is a very good brand for food products in India. Specially cookies and biscuits. little hearted biscuits is the one of the best biscuits of Britannia. All age people liked it. Specially kids are very liked because it has heart shape sprinkled with sugar. And we know small children are fan of sugar.I like packaging also because it printing is very attractive.39gm biscuits in 10 rupees is good because quality is very good.In comparing of any local biscuits it is best.It was ideal for breckfast or snacks or too good with tea.I'm very love it", "shivapentawar": " I love LITTLE HEART biscuits. I started eating this at the age of 12 yrs. It is very tasty and crispy when ever we eat this we feel the sugar touching on your teeth. The shape of the biscuit is very nice in heart shape. You can take this biscuit at any time which is very good to health also. I strongly suggest you to take this biscuit every day definitely you will loved it. Its package also looks very nice.", "ranjitsharma431": " I love Britannia little hearts biscuits as it's very tasty and crispy. Britannia is very famous brand of food product in India. I am having this biscuit since my school days, I love the shape of the biscuit which is in heart shape, whenever I get idle time or while watching T.V, picnic, reading books I usually eat this biscuit, I can say it is the best biscuit for time pass with best price Rs. 10, 20. if you haven't taste it so far, I would recommend you to try it once definitely you will love it.", "rohitnik": " I am having these Little hearts biscuits from long time. They have a unique taste. The taste is really good and you want to have it more. The shape of heart really adds on. They have just the right amount of sugar on it . These are very crunchy. I like to have with plain milk. People with diabetes should avoid it. The overall product with fair price is good. The packing is good and the availability of it is not an issue. Good to have while travelling and during picnic times. Kids love it."}], {"jadamkalyannag": " Hi Friends,Today I am going to review about BRITANNIA LITTLE HEARTS biscuits, previously there used to be a unique pack and richness in taste of the biscuits that are there inside it and also the taste is good, but recently the BRITANNIA has changed the package and also increased the price of the biscuits, however the quality and taste remained the same and the consumers are experiencing good taste of the biscuits.", "sharmamonika": " The branded company launches the great products Britannia little hearts biscuits . it is very tasty. it is the snacks time passes biscuits. those who have eats it one time it became favorite of those person. it's shape is in triangle. it's shape is good effective. it's taste is very very excellent. I like it by taste. I eats it with namkeen. its packaging is very good. the sugar is seen on this biscuits to grow his taste. the sugar is used like cheery like as icecream in icecream's top cherry was given. those have low sugar problem it is best for low sugar patient. it is easily available in the market. it is my favorite biscuits. they are placed everytime in my bag. when I was free I take from my bag and eat starting. I give thanks to the britannia to give us  amazing biscuits.", "joseph4vkb": " Hi friends my best and cute biscuits are here the little hearts.They are very tasty and awesome biscuits for my snacks. I loved to eat this little hearts since my childhood even today I am fan of those biscuits and consume them. I could the people that this brand products are quite uncomaparable with the other brands such as parle.  The little hearts had extra flavor and taste in your snacks.  The price of this biscuits is very reasonable. I would like to suggest these biscuits for everyone who are the lovers of the biscuits because they add good taste and flavor.", "harshrathor": " I have been eating Britannia Little Hearts since childhood and I can say that even now after so many years, I have not found a better sweet biscuit than little hearts anywhere. These are the best biscuits anyone can have.The flavour of this biscuit is magical, beyond the words. The best thing is the sugar which has been sprinkled on the top of every biscuit. The sweetness is perfectly balanced,I found the product quality of little hearts to be excellent. Britannia is a big brand and I really trust little hearts. The product quality is top notch.The packaging of little hearts is the best packaging that I have ever seen. It gives a very pleasant and happy feel.I think that the packaging of little hearts should never change.I love little hearts and I will give it 5/5 stars.", "chiragbansal000": " When I was of age 12 or 14 than I eat Britannia little hearts biscuit too much and I like it's taste also and the shape of heart also attracts a lot.I take always one packet of its in my school and eat in recess with my friend and they also like it .When I come home than I visit to tution and again I go there with one packet of it.In one day I eat 3 packets of hearts at that time .But now I didn't like it why that I dont know.", "masum05": " Hey everybody my name is masum laskar. Today I am going to write on a product of BRITANNIA . The Little Hearts Biscuits is the product from BRITANNIA, its have a wonderful taste .I buy this product like 2-3 packet every day its come in just  rs 10 with 39g , it is in small in size and love to eat, with tea or coffee. you can take it while you are traveling it will win yours heart and fill your stomach  It also has a wide range of goods or stuffs to satisfy the consumer's needs including Britannia Pure.", "Akshaddha4": " I really love to eat Britannia Little Hearts biscuits.Britannia is very old brand and mostly all the products of Britannia are very nice, tasty and of good quality for eg Britannia cakes, biscuits and little hearts is also one of them it's really very tasty, yummy , delicious and is more important less sugary .One thing I love about this biscuit is its shape so cute small small biscuits of heart shape , even diabetic patients also eat this biscuits as it contains less sugar.It comes in 5Rs and 10Rs Packet not so costly, easily available in the market.Everybody in my family likes this Little Heart Biscuits, this is very light , crispy and crunchy that's why it is good for small hunger.", "strikervikas": " As we know britannia is leading brand.this is so amazing little hearts biscuits I love this biscuit. its on heart shape and thats is why this is so great looks. I love them. me n my girlfrnd love to eat those biscuit because its on heart shape this is beacuse everybody love this biscuit. its tellinhlg us to spread love in this ruthless world. showing peace to us. thanks for taking steps ahead for that kind of biscuit. this is so unique and taste is also supergood. texcher is too good and I love them.", "vpsreddy": " HI GUYS, Little hearts awesome and tasty cookies. I bought this product in my childhood and still we have it because this biscuits taste different.I think this brand is better than any other products like 50-50 or others in comparison to taste and flavor.I think this taste is best in comparison of any biscuits so I recommend this to every one only because of taste and the price of this brand is equal to the normal biscuits.I recommend this brand on basis of Flavor and Taste it looks awesome.You should taste them surely.Thank you, have a nice day.", "anwarshekh1111": " Hey folks It is more helpful for low sugar patients. The flavor is likewise exceptionally delicious. The bundling is exceptionally alluring. The little hearts contain the key unsaturated fats and PUFA poly unsaturated fat. These are exceptionally key for the developing youngsters. I think all the street side tea slows down and all the enormous grocery stores contain this item. This item is rate compatible.It is entirely in taste, its sprinkled sugar gives it great presentation and in addition great taste, I enjoyed it most on the grounds that a few scones has an excessive amount of included sugar in it, yet it has light sugar which gives it distinctive taste. Its crunchiness adds full fulfillment to its taste. What's more, obviously it shape which is focus of fascination of this treats. I like it much appreciated.", "rockygopin": " Hi Friends,I have been tasting this biscuit for the past 15 years and still it is my favourite one. The heart shaped biscuits are very crispy with the natural sugar toppings. When you are looking at the biscuit itself, it will tempt you to taste.Everyone right from a children to old age people will sure mesmerise in the taste of the biscuit.It is one of the best products from Britannia, with a good combination of flavours and quality. The only thing I dont like is half of the package will be filled with air.I love Little Hearts", "singhamit26": " SIR MEN IS BISCUIT KO PICHLE 5 SALON SE USE KR RAHA HUN.MEN ISE BOT PASAND KRTA HUN, MERE SATH SATH MERI FAMILY BHI. YE KHANE MEN BOT TASTY HE OR IS BISCUIT KI SHAP BOT ACCHI LAGTI HE. JAB KISI GUEST KE SAMNE SERVE KIA JATA HE. HE KHANE MEN BOT TASTY HE NAA HI JAYADA MEETHA NAA HI JAYADA KM MEETHA . KHANE MEN SWAD BILKUL SANTULAN HE. ISKA CRISPYNESS BOT ACCHA LGTA HE JO KI BHULTA NAHI HE, EK PAK KHANE KE BAAD MAN NAHI BHARTA JEE KARTA HE 3 YA 4 PAK KHATE JAUN. ISKI PAKING QUALITY KE BARE KYA KAHUN FIRST IMPRESSION MEN HI BHA JATA HE BOT ACCHI PAKING HE. AGAR MEN KAHIN RHATA HUN YA APNE DOSTO YA OFFICE MEN YA HOME MEN KOI PARTY HOTI HE TO MEN ISKO JYADA USE KRTA HUN. MEN ISSE FULLY RECMANDED  KRTA HUN.", "abhi6193": " Little hearts.the very first thing it reminds me is of my school days. really nostalgic.anyways this heart shaped biscuits have been my favourite since childhood.sweetness with tiny sugar crystals on those heart shaped biscuits is really yummy.the only biscuits with no haters.thanks 2 Britannia for bringing this product 2 us.it's really delicious.", "nileshgupta205": " I seriously like this biscuit a lot. It has a crispy nature and a sweetness on the top makes it unavoidable. It taste awesome. The product quality is also good and you will never regret eating this. Once I ate this it is almost unavoidable, and I eat this whenever I got the chance. If I talk about the packing quality, it is also good. If I go for a picnic, I usually have this with me so that I can eat this and enjoy the picnic. I prefer to eat this biscuit.", "sumagram": " Hi all, one of the best tasted biscuits and loved biscuit from all generation people, from children to old people. Everyone loves it.Britannia Little Hearts has been unique in two ways - one is packing and second is bite size small heart shaped biscuit  coated with sugar. The taste of this biscuit is  very good with flavours like sesame or chocolate . These heart-shaped cookies are perfect for a light snack or enjoy them with tea or coffee.It simply melts in mouth and has an awesome taste. Product packaging is also very attractive.I am very much satisfied with the taste of biscuits and its quality. The iconic gold and red pack  of these biscuits is almost like trademark, easy to spot and is found just about everywhere.", "Sanchaybhargava": " Hearts are my childhood love seriously the best biscuits of britannia company everthe littel hearts are the oldest products of britannia still in the market with strong presencethe biscuits come in a pack like of waffers and are not binded together in one small package this is the best part and other than that these biscuits are so sweet and soft they actually melt in your mouth and the sugar sprinkeld on it gives you a sweet taste with a crunch I can have these all my life in every minute of my life", "sajjad5132": " Iam 20 years old and believe what? I still eat my nephew's cookies because it tastes awesome, the cookies looks like delicious and they are in heart's shape which people will love to taste, the sugar points attached to the cookies adds more taste to the entire cookie. these cookies are best to eat as a snack and best time pass snack. My dad still eats these cookies:DI recommed everyone to try these biscuits atleast once", "mrudulbhoir": " Britannia little hearts biscuits are in my hearts itself .This biscuits all always remember me of my childhood since that time I am eating this biscuits same taste same shape of heart .The best thing of these biscuits is crunchy sound which come with every bit and sugar is cheery on the top.I LOVE Little hearts.", "nayangajjar83": " I would like to call these little hearts a perfect snack time serve. Dual little heart designed biscuits like a cute couples, sugared coated, shined and looked golden baked looks cute eat delicious.They are crunchy to eat. The flavour is prefect, a great mixture of salt and sugar with wheat . It is neither too sweet nor to salty, just the perfect balance of both.It is due to this little sweet and somewhat salty mixture, that makes it a perfect snacks The best thing is, it is very cheap, you can get these little hearts in just Rs. 5/-. These biscuits are tiny in size and FDA approved, so we dont have to concern about the quality checks up. A perfect snack time biscuit, loved by all.", "anjigundlapally": " These biscuits are super tasty biscuits.I am always love  this biscuits. Sweet and salty.Littile Hearts is the apt Name to this product.Why because this biscuits are broken my heart .Who ever once taste this biscuits they are dont leave .l believe buiscuits lovers are compolsary love this biscuits."}], {"ishusharma651": " Britannia's little hearts biscuits is a very good and cool snack to have. They are heart shaped biscuits with sweet and amazing flavor coated with melted sugar. they are loved by people of all ages from young children to older people, as it tastes amazing and is a cool snack to have if you are feeling hungry.This biscuit was launched long ago since then it has a favorite snack for all. Because of that melted sugar all over the biscuit it is very light and melts quickly as soon as you put it in your mouth. Very light and digestive for sure without a doubt.very nice biscuits and I love them allot. a 10 rupee pack though wont fill your stomach entirely but is a good one.", "ritu16": " Every human should have this type of heart. Joke apart, literally Britannia Little Hearts Biscuit is very delicious. The packet contains heart shape biscuits with sugar on it. One can alone eat this but if eat this biscuit with your loved one then you enjoy it more. But these days 2 or 3 out 10 are diabetes and other people are health conscious. People try to avoid having sugar on daily basis. So my suggestion to the company is that they can use the substitute of sugar and make this biscuit more healthier. Its just a suggestion. Can Enjoy this biscuit on special occasions also.", "rajugorai6": " I am very like Britannia Little Hearts Biscuits and my family are also like it. We eat at any time. My mother goes to market, she buy its 3 to 6 pack.I am eating this biscuits last one years because its taste is very different to biscuits. In this biscuits are mixed  sugar and dry fruits and its packaging is so good.This biscuits is like by all youngster because its not bad for health and no gain extra fat but some people are not like because in this biscuit made by sugar.", "ajay_raj14321": " Hi friends, I bought this product in my childhood and still we have it because this biscuits taste different.I think this brand is better than any other products like Krack Jack or others in comparison to taste and flavor.I think this taste is best in comparison of any biscuits so I recommend this to every one only because of taste and the price of this brand is equal to the normal biscuits.I recommend this brand on basis of Flavour and Taste it looks awesome.", "kratikaarya": " I like Britannia Little heart biscuit from my childhood.Very light in weight. Nice approch of britannia of giving it lovely shape.Taste awesome. Nice flavour, more tasty if available in vanilla flavours.Anything eatable.Good packing.Nutritional value is good. Sugar content is also low.Only drawback is their is lot of air filled in packet due to which packet looks bigger, but biscuits are less in it. Although according to price it is a nice eatable product for picnics, journeys etc.Simply loving it", "dhimanshikha32": " Soo yummyyyy. I like this snack so much. Its taste is very good .my all faimly love to eat it as evening snacks.Britannia is reputed brand of market and there almost product have good quality and  they dont  have any health suffering issue with there any product . I think Britannia Little heart is a light snack with a very low cost and this quality make it better then other Biscuits .", "sunnyhirsch": " Delicious biscuit to eat and since long time I am eating this shape of biscuit. I am eating this brand of biscuit from when and in that all of my family members loves to eat heart shape of biscuit which is so cute in looking and design In heart sign with small small cube of sugar has added from up. While eating its feel original material has used in this biscuit because this company of biscuits is one the branded company and comparing to another company Britannia is the best of the best company in tasty and I do recommend this brand product packing is also good.", "sarzilsam7": " Britannia little heart are really good I must say incredible biscuit. I am in love with these biscuits, its really amazing.i am having these biscuit since past 2-3  years. The way it's melts in the mouth is amazing. I don't even bite this biscuits. But I am dissatisfy with the quantity which they provide. These biscuits are best when it's comes to quality. We can gift someone this biscuits because of its shape. These biscuits are heart shaped with sugar in the middle. It has sugar in the middle which taste really awesome.It would rate it 4/5.", "Saniasrivastav": " Its so cute sugary heart shape biscuit its light weight and tasty, previously I guess the quantity was much then provided nowdays.its yummy all my friends sister like it.quality is very nice never got packet tampered or in bad condition its always fresh I use to carry in my college and eat inbetween lectures.packaging is also attractive red and golden colour.", "amit2293": " Britannia Little Hearts is a tasty and crunchy biscuits generously sprinkled with sugar, they blissfully melt in your mouth. It was the first time biscuits were retailed in pouch packs like potato wafers and these heart shaped cookies are perfect for a light snack or enjoy them with tea or coffee. It contains Wheat flour, Edible Vegetable oil, Raising agent and yeast emulsifiers, these all natural ingredients gives tasty and crunchy biscuit and it ideal snack for tea time, school going children’s and teenagers. It comes in two variants called little heart chocolate and little hearts sesame.", "Rahul28sing": " Hi Everyone,When it comes to \"Britannia Little Hearts Biscuits then our mouth starts getting watery because of it's sweet taste. But very few of us know that these biscuits are not good for health as they are good in their taste. I love Britannia's products fro childhood but if we talk about this product then this product is seriously not advisable to be consumed by health conscious people.The amount of sugar is added in this product is too high which can lead to weight gain, elevated blood sugar, abdominal obesity, etc. So, the person who is diabetic can not consume these biscuits because consumption of these biscuits can enhance his sugar levels. The oil which I saw on the surface of biscuits is too much and it was very sticky also. I could not figure out the quality of oil but the oil can lead to enhance the cholesterol levels in human body so, again this product is not advisable to be consumed by people who are having high cholesterol levels in their body.After seeing health factors related to the consumption of this product I would not recommend this product to be consumed.Thank you", "prasadsawant864": " Britannia little heart buscuit is the one of my favourite  buscuit from my childhood  .  the buscuit has good taste , with remarkable design of its brand , it contain less amount of fat and more amount of iron , that help body to maintain iron in the body  , the sprinkle of sugar on the buscuit I liked the most , it seem as crystal coating on buscuit , quality and quantity  is affordable  to it prize", "renuagarwal0302": " Britiannia liitle hearts I am eating sincei used to go school.i used to take a packet sometimes for my short break period and I remember my friends would eat more than me .but it was fun doing that sharing and eating.and when your tiffin is more exciting than others you feel good.it comes in heart shaped and sugar particles quoted over it.now also I eat when I find it in any shop .its quality is good.and quantity is also good and it fun eating im heart shaped and its so yummy.flavour is nice .and packaging is also good.children and youngsters both love it.i lot of memories of it in school days as I told you.i personaly love it, I hope you will also like it", "lilmild1": " In love with these little heart shape biscuits by Britannia. Perfect treat to a person to wants to eat biscuits which are not too sweet. Sugar sprinklers gives a nice shimmery look to the biscuits making it too appealing to buy and eat everytime. I usually a pack while travelling back home after day long work and it simply lightens my evening. Even my mother has started enjoying these biscuits during tea time. Glad Britannia has come up with innovative biscuits which attracts people of all age group.", "patelabhi2725": " My chilhoods favourite snack that liitle hearts thats too good and the good thing is that  after so many years still it have too much costomers ratio, thats lreety cool, the sweat crisp test is soso good, it comes as per 2 varient the small one and big one pack, the britania biscuits provide such type of snack that are favourites of almost all people s and the company orovide this pack at such low cost, the pack looks good creative and interesting, fir all indians , must try product , most liked product very good, the snack is favourite of both generation gaps yougers as well as child ones.", "csparmar25": " Hi freinds, britannia  little hearts biscuits are my favorite biscuits, it is very soft and dilisious. it is heart shapped biscuits. this is one of very good product of parle compney.  it is very sweet. very high sugar use in this product. this is bad for health. when I m go outside, I always use this biscuits.  its pack is very attractive. if you impress your girl friend. it is best choice to it this biscuits with her.i am eating this biscuits from my child hood time. but my father not take this biscuits beacuse he has diabatics. in diabities this product is not good. I suggest diabatic people, this product is not good for them. beacuse of lots of sugar content", "viewmyreview": " Britiana is a reputed brand in the market. Whether its biscuits, breads, cheese, toast and so on. But little hearts are all time favourite of most Indians, it makes me nostalgic as it has lot of childhood memories attached. Now let me talk about the product. It comes from a Britania family. Packed in bright red and golden wrapper with a glossy and shimmering texture. The biscuits are heart shaped with caramelised texture on top. Its very crunchy and melts in your mouth. The price of product is very affordable and justifies with the quality. Its a must purchasing product. Give it a try I am sure u'll definitely make a little place for this one.", "dhirajpatel419": " In low costs the biscuits are very good and nice in taste and this biscuits are very likely to small  childrens and the best thing is if we see its ingredents then we are able to see in pack that they are using not sone harmful ingredents its shape of a geart is very good and the biscuits are very likely to small childrens.Only 8 rupees this biscuits costs and taste is brilliant and I would recomonded to eat at morning", "himanshia24": " Britannia is a well known brand in indian markets. So I decided to have a taste of its Little heart biscuits. I would prefer biscuits from patanjali becoz they are tasty as well as nutritious. I chose this brand for biscuits because britannia have many varieties in biscuits and they all taste yum. Kids as well as adults would love these. I would not recommend these to a diabetic cuz of its sweetness and use of sugar is more in them and also to those who are health conscious.", "biplobpaul10": " I would had eat this biscuit since my childhood, I dont why I choose this brand in my child time, its taste are not changed since then I also eat another products but this is tastier than other,I would like to call these little hearts a perfect snack time serve. Dual little heart designed biscuits like a cute couples, sugared coated, shined and looked  golden baked looks cute eat delicious.They are crunchy to eat. The flavour  is prefect, a great mixture of salt and sugar with wheat . It is neither too sweet nor to salty, just the perfect balance of both.It is due to this little sweet and somewhat salty mixture, that makes it a perfect snacks The best thing  is,  it is very cheap, you can get these little hearts in just  Rs. 5/-. These biscuits are tiny in size and FDA approved, so we dont have to concern about the quality checks up. A perfect snack time biscuit, loved by all."}], {"mhdsiraj49": " One of the best childhood memories is eating Britannia Little Hearts biscuits, I eat these biscuits even now, Thank you Britannia for giving us such a wonderful memories and by the concept of manufacturing little heart shaped biscuits, The taste of the biscuits is superb and with that sugar on it makes more tasty and want us eat more and more, The packaging is also very good, The biscuits has sugar coating on it but still it is not that sweet, which is very good thing and all age group people can eat this. but I see that the quantity has been decreased, but the taste is still the same since more than 20 years. there are many brands available in the market manufacturing biscuits, still no one can beat little hearts.", "swapnilbarve2013": " Britannia Little Hearts has been unique in two sense one was packing and second was bite size small heart shaped biscuit  coated with sugar .\"Each brand of bakery product has its own story and history behind them to tell .Bakery bazaar intends to discover and unravel these stories before you. Number of bakeries have opened up in neighbor hood  where one can buy his daily quantum of bread. India has few major national bread manufacturers namely Britannia.", "vishwa70956": " LITTLE HEARTS.Hi friends and readers my name is vishwa.I am food lover .Little hearts are my favouritebiscuts from my childhood . These biscuts are really delicious and softer in mouth.In Parlecompany any biscuts cant beat little hearts because the taste and flavour is different from allnew and old biscuts.For lovers and couples those are most heart touching biscuts for hearttouching times.These biscuts are special from parle company.Finally these biscuts are best in parle company.", "anujtanwar1234": " I love this biscuits from my childhood and I feel like no other biscuits are of this type.This biscuits have good heart shape and the taste is awesome, this biscuit is very very hard to find in the market and I don't know why it is not available in the market.From last 2 months I finding him but till now I can't and when I ask the shopkeepers they just simply said no supply is there from the company.So then I mail them regarding this product but they didn't reply me.It is available on amazon and other online websites so I ordered from them but the price is little bit high around 45 rupees because I have to pay delivery charge.Till now I searched for this product but I can't find it in the market.Hope this will soon available but if this us available in the market then just buy it and have it, you feel super awesome.", "abhienath22": " For Rs10/- we get so much aoumt of chips. Also there are many other biscuits which provides a wholesum amount at just rs10. Little hearts is one which provides less quantity biscuits at low prices. Though the shape of these biscuits though smaller in size makes the use of raw materials less. Thus providing less amoumt at the same price. Also the amount of sugar content in these biscuits is pretty high. Consuming these in regular fashion may increase the sugar level.", "svprabhu27": " The brittania little heart biscuits gave crispy while eating. It's a biscuit with little heart shaped and sugar was coated .it so soft in biting. The biscuit I s a light snack with tea. It simply melt in our mouth.this biscuit will be all time favourite one. I used this from my childhood. Brittania is maintaining same taste", "Antraa": " Britannia is one of the best brand. It is my childhood biscuits. In 10 Rd. We get a delicious taste. It is yummmmmyyyyyyy. I love it. One can't forget its taste. I always prefer to eat this biscuits. Even u all should taste it. U will fall in love with this. Everyone should buy this Britannia band. It is worth. As it is a old brand we can trust on this brand. Britannia is one of the best brand ever tasted in my life.", "rupali1": " Britannia is vey well known to all of us as it is enough much old company. I ate almost every types of biscuits of Britanniya. Britannia Little Hearts Biscuits are awesome for me . Most of my evening  Britannia Little Hearts Biscuits were with me and even till now. It is very crispy while chewing and sweet too. I specially like it's heart shape, for what it is more attractive. The people who never tasted Britannia Little Hears Biscuits are still unknown to it's magic taste , they must taste atleast once.", "rumanabanu786": " Have been eating this sweet hearts from childhood and happy to say that I cam also share this with my kiddo now. One of the best thing about this biscuit is the taste is not a bit changed its the same delicious as it was before. So we can say that quality is maintained by brittania and I am happy that I can give this to my son with utmost belief instead of all that junk food in market. No other biscuit have come with its duplicacy also its worth the price I love it my family loves it. Thanks brittania for such a good product and keep its production always.", "moneyforlife": " Britannia is very famous, popular and old brand, but his sweetness is always young. Britannia Little Heart is so sweet and crunchy. when I was child my father always gave me that biscuits, when I was crying, when I was unhappy, But that little heart always make my little heart happy. now a days, when I saw this biscuits, I immediately buy and it takes away  in my memorable past. is so nice of you Britannia.I think I am so lucky, because I test this biscuits, I do not want to compare with other. but now a days, new brands are available in market, they attract people more than LITTLE HEART, but who known about that brand they always buy this biscuits . I am very sure about that . thank Britannia for that lovely little heart .", "pirai21": " Little Hearts Biscuits the name itself portraits that this biscuits help to keep the heart in healthy state. It gives energy instantly. It contains all essential energy nutrients. It helps to maintain our age youngly. It is more useful for low sugar patients. The flavor is also very tasty. The packaging is very attractive. The little hearts contain the essential fatty acids and PUFA poly unsaturated fatty acid. These are very essential for the growing children. I think all the road side tea stalls and all the big super markets contain this product. This product is rate compatible.", "421shailendra": " Britain and little heart biscuits are a very old product from Britainia and I am using it from my childhood it's taste was very good and yummy to eat but at present it taste has been little bit changed than before its not looks as good as before its not seems to be a very good quality product. Little heart price is rs 10 for a pack and it contains good quantity but it taste is not looks as good as before its packing is also looks just average and its also not looks so attractive its flavor is looks so bad to eat so from my point of view it's not looks like a valuable product and I am not very well satisfied with this soup I am given it a  negative review.", "tripathiamita": " It is actually good in taste, its sprinkled sugar gives it good presentation as well as good taste, I liked it most becausesome biscuits has too much added sugar in it, but it has light sugar which gives it different taste.Its crunchiness adds full satisfaction to its taste.And of course it shape which is center of attraction of this cookies.I like it most and I would recommend to everyone at least once try it.", "mussarathrafiulla": " Britannia little hearts biscuit my favorite one .i was very small and was sleeping when I got up my mom gave me this and I felt heavens .its heart sharp and bit of sugar that melts in ur mouth make u go crazy .It my family favorite biscuit , we carry this during travelling in car for long distance .children and lover will feel very happy seeing its shape .Its sweet taste is really as sweet as its shape .i recommand , every one to eay and taste as it is very very good .i love u Britannia Little Heart Biscuit.Thank for read my review and please must try , u will go heavens.", "ersyedfaizanali": " They look like Sweet little heart and they feel like heart. They are crisp, light and sweet in taste. I just wish there would be a box full of them in front of me. In my childhood I usually bought them twice a week and share with my friends. Its being made and sold by Britannia .Little amount of sugar is sprinkled on the biscuits so that they taste sweet. Alternatively Happy Happy chocochip cookies are my favourite.", "spicyruby99": " Britannia little hearts hearts is good awesome biscuit if you eat 1 you just keep on eating.because  its so nice .its have sugar coating outside which taste awesome. This buscuits melts in your mouth.Its very delicious  yummmmmmmy biscuits .When I was small we went out of station there my dad first time bought this biscuit all were surprised  heart shape biscuits .we all had it enjoying the lovely taste.From that day we started eating this biscuits .Till now we eat this biscuits .Its britannia little hearts its branded and hygienic. And its packing is very nice you will feel like seeing wrapper again and again because its so nice.This biscuits are so nice its melts in the mouth with yummmmmmy taste.Thanks for reading my review", "Mr_Reviewer": " Since childhood, I had a stupid habit of dipping the biscuit in to the tea/milk and then to have it which continued for years.Then came in the Britannia little hearts!Britannia always provided the best and did the same with the little hearts.When I first tasted it,the hearts just went into the mouth, melted their with sweet tweak of sugar and WOW!Fell in love with the hearts!Although there were many brands of biscuits available at that time but little hearts went by its name and created a space in our hearts!It gave me the best childhood memories!This biscuit is for everyone and even now it is most of ours favourite.I hope this review was useful to you.Like, comment and share if you found this review relevant.Thanks!", "gujaratiswetha": " It's all time favourite of mine from my childhhood to till now n forever. no biscuits have replaced little hearts it's very yummy it just melts in ur mouth as soon as you keep in your mouth the small little heart biscuits are yummmmmmmmmmmmmmyyyyyy.my love forever with the little hearts forever .sweet hearts", "gusmirafi": " My mom brought  from rajasthan she brought  little heart it is look awesome I had never taste it is delicious  it like sweet when I childhood I am eating tht I was very crazy to eat that when I 18 used to eat britannia little hearts biscuit my mom used bring whole month I felt happy and keep it also I will eat that when I watch movies I will see and eat the britannia little heart biscuit when disturbed to my sister and brother to eat little sweet biscuit britannia pure magic good day brittana treat very taste cakes and many more little heart all age people love to eat it bring smile everyone face the product very amazing sprinkle  sugar on heart if we put in our mouth it will melts we can eat delicious little heart", "jazzy0000": " From my childhood till today, I love to have little heart biscuits . I still remember that I used to take it with my lunch when I was in school. Its taste really good and  is full of sugarness.  Its packaging is really nice and comes in a packet like other chips come  and are available in an affordable price in the market.  You can have it in your tea time too.  Its sweetness just melt in your mouth. If you want to have something sweetness with a crunch in it then go for little heart."}], {"Nelson14": " Little Hearts is just good and there is nothing like it and I like it but only thing is that the packet has very small amount of biscuits. I buy it when I find it in any of the stores I visit but they are not in the stocks much. Little Hearts is so unique I guess and the sugar on it is so great that without it loses it taste. Everyone can have Little Hearts but especially the couples should definitely have it and kids can too of-course.", "dhruvluthraluthra6": " Britannia has come with many biscuit flavour. It has lot of verities one of them little hearts. Little hearts is fully made by wheat aatta which is called mendaa and add sugar. It is very famous among newly married and young blood boys and girls. In my school time I eat so many time in just 3 rupees to 5 rupees. Now in market it available in just 10 rupees to 15 rupees.This biscuit has a traditional shape of hearts and it never changed by britannia. in heart shape it looks nice and on the surface of the biscuit spread some sugar piece which gives extra sugar taste. This biscuit is perfect for given gift for our girlfriend priyans and princess.Before using it we need to see its manufacturer date and packaging and it expiry date then we use it. I really really recommended it  and eat self and gives for eat other.", "manikanta1": " Little hearts is my favorite biscuit from childhood. Even though now so many biscuits and varieties have come to the market little hearts stays unique. It tastes gud with the cookie and sugar on top of it. So many years have even now the quality of the biscuit is good. I was able to get these biscuits in middle years I dont know the exact reason . Was it because of no stock? Or is it because this biscuit was not in production for long? Did they rebrand this? # taste - 4.5 /5( the earlier version was awasome now a days sugar upon biscuit are not great)# price - 5/5, its worth the price and I think they will be again come to shine.hope they will.  &lt;3 &lt;3", "jogipuja356": " I remember, in my school days, we used to have this biscuit everyday. All my friends including me like it very much and we never get tired or bored of eating this one. Best part of this product is it is available in very affordable price. Thus kid can buy this by saving his/her pocket-money. Little hearts biscuits doesn't differs its consumers. Everyone from children to elders, loves it. And I think that's a best part of it.Heart shape of the biscuits with little sugar on it adds uniqueness and flavour to the biscuits. We really love Britannia  little hearts. Hope that this product will always be manufactured by the company thus generations can have this awesome item.", "pavan566": " Britannia has made its mark in biscuits category with its little cute cute Little Hearts Biscuits.The shape and look of the little heart biscuits are also very very impressive. years after also they stand in the competition from other brands. The shape of this biscuits resembles a cute heart which spreads sweet feel all around. Upto me its differen feel whenever I see the shape of it and the taste is too good crispy when u just take it to our mouth and become soft in few seconds. According to my knowledge many young people when they first eat these biscuits, they surely fall in love with it not only because of its super taste but also for its shape and most of little heart biscuit lovers try to express their love to their sweet hearts with these biscuits for sure.These days the size of the biscuits seems so small when compare to past and now they Britannia uses sugar powder on these biscuits instead of sugar cubes which they used in past we love both but sugar cubes are cutest so keep both verities, if possible", "sona_mishra": " Britannia little hearts biscuits ultimate biscuits from ages, I am eating this from my childhood and this is my all time favorite one. This really different from rest of the biscuits taste wise and presentation wise. Each and every piece of little heart pop in your mouth and melt your heart with its taste. There is is some salty taste is also there with the sweetness of coated sugar on the biscuits.", "afsalsbtech": " Britannia little hearts is my favorite biscate. Beacause I like its teast and its shape. The attractive thing of this biscates is no age limits for this biscate both old peoples and childrens equally like this. Little hearts biscate was one of the most good item of the britannia company. Now a days people ask me that which biscates do you like? I answered one name that is britannia little heart biscates.", "jiyajain93": " Britania little hearts biscuits is best product . Its eating a biscuits that good feel and enjoy. This biscuits heart shape and on biscuit spread some sugar. So I really enjoy eating this biscuits. I suggest take  little children eating britania little heart biscuits . I really happy this product .", "subhash911": " You really need a big heart to share this little hearts.Yeah this is my favourite biscuit .This always available at my home for serving .For all party it is must among me and my friends.Sprinkled sugar makes it more yummy.Its is mostly available only in big shops and rarely available in all medium shops.So I buy it at once to feed my heart with this??", "prakashadityaadit": " Britannia doing justice with its name .one of the most delicious biscuits to be eaten.I eat them from my child hood and still crazy for it as it is now more tasty I personally suggestt all my friends and relatives about this delicioius biscuits so that everyone can get chance to enjoy this sweet biscuits", "anantkapoor662": " I used to have this biscuits in my childhood and till now when I am 19 I am still having these biscuits. when my mother use to bring these biscuits with whole month rasaan I used to consume all the biscuits in just few days and use to wait for next month to come so that I will have that biscuits again.  every month with lot of curiosity I used to wait for month to end so that I use to have these biscuits. and my mother always use to scold me that I never consume these whole biscuits whole month and then consume it in few early days of the month, but I love these biscuits so much that behind my mothers back I used to have it I m a lot crazy about these and now also I did not have the better biscuits then these. Little Hearts is just good and there is nothing like it and I like it but only thing is that the packet has very small amount of biscuits. I buy it when I find it in any of the stores I visit but they are not in the stocks much. Little Hearts is so unique I guess and the sugar on it is so great that without it loses it taste. Everyone can have Little Hearts but especially the couples should definitely have it and kids can too of-course.Britannia Little Hearts Biscuit actually wins the heart and fills the stomach. The heart shaped biscuits are the heart stolen one that brings flavor to our tongue as well. Though a small bite is enough to get delighted but unless and until we finish the entire pouch, we don't feel like stopping munching, since it is so irresistible. Its an absolutely unique product by Britannia to hit the heart of every aged people. Little Hearts gives you the best company specially when you are on travel, watching movies, occupied by your friends and families or enjoying your snacks time. In fact it is perfectly meant for matching all the circumstances. Britannia is one of the top leading brands that offers product with finest quality. It also has a wide range of goods or stuffs to satisfy the consumer's needs including Britannia Pure Magic, Good day, Brittania treat, cakes and many more. In short, Britannia offers a complete package of eatery stuffs to treat ourselves through all the possible ways. I love them!", "Gmuthukarthik": " Britannia little hearts biscuits is one of my favourate biscuit, this biscuits wins all kind of age groups peoples, britannia is one of the leading biscuit company in india, in my chilldhood my all time favourate biscuit is britannia little hearts, it wins people's heart, little hearts you can have tea or coffee, morning or evening, and people who not like biscuits also can have this biscit because this crinchy ang cripy taste, and also you can some sugar in this biscuit, personally I like this biscuit because for the sweet, you can find nutrition and biscuit price in the biscuit cover, you can take this biscuit in snack time, we can take this biscuit morning or evening, with tea or coffee, last week I went my brother house he brought me this biscuit, mostly childrens like this biscuit so much. This biscuit is baked by good method.", "khuzemahismael": " This product is amazing.that sprinkled sugar on heart shaped biscuit, and its taste is wonderful. its amazing that people of all age groups love it.little hearts brings smile on every ones face.these small hearts melts in your mouth and give amazing feel.these biscuits come in an iconic gold and red pack.the best time pass and also healthy biscuits.it usually comes in small packed, ones it get finished the thirst for more risesthe best biscuit direct dill se.", "CarlCaputo16": " It is my favorite biscuit in all and I really like to eat which is so fantastic tasty and on my school day I eat little heart biscuit because I the love taste and shape of color and sugar has also fixed from outside the little heart biscuit I really recommend this company because who had invent this biscuit also. I really need this biscuit on my school time and I daily eating on my school rises and nowadays also I am eating this biscuit but not daily. the quality also awesome of wrapping.", "vijayagarwalla": " This is my favourite biscuits . I have been eating this biscuits seen  my childhood  but earlier it had a larger package. Britannia is able to maintain the same taste but they have reduce the sugar contain on it  but not the taste. Earlier  it melts in the mouth but not now . Britannia have been a reputed band for quite some decade now . But the uniqueness of this biscuits is its shape the heartOne should definitely try out this biscuits not for those who are diabetics", "ak281994": " Britannia's little heart is one of my childhood favorites which I enjoyed very much.It had this different taste from other biscuits.I liked the little hearts and how they were presented, it looked absolutely wonderful and delicious.these biscuits had sugar sprinkled on them and gave them that extra flavour and spark.There was a time when these biscuits were available in every shops but now you don't see them everywhere britannia is not promoting or marketing this very effectively.I hope these biscuits are brought back to their original glory.", "bhaveychawla5": " Britannia little heart biscuits was become all over past time in my whole life till now the hearted shape of this with some augar on outside make him so cool and her taste you say was at equilibrium if we took about food anyone who have 10 ruppes in her pocket and want to eat something and he get confuse then I suggest to buy this from market by eating her time pass was done but at the same time he get taste different from other products", "krninsan": " Here is a  review of  Britannia Little Hearts.Britannia is a famous brand of food product in India . All its products are good, specially its biscuits and cookies are very delicious. The one I like most is Britannia Little Heart Biscuits. Its in shape of heart with sugar sprinkled on it. It simply melts in mouth and has an awesome taste. Product packaging is also very attractive. Price Rs 10 for 39 gms pouch, so price ok for a quality product. Its ideal for tea time snack. Liked by people of all age group, specially kids. Its very light. I was very much satisfied with the taste of Britannia Little Hearts Biscuits and its quality.", "saikumar12345": " Little hearts is my favorite biscuit from childhood. Even though now so many biscuits and varieties have come to the market little hearts stays unique. It tastes gud with the cookie and sugar on top of it. So many years have even now the quality of the biscuit is good. I was able to get these biscuits in middle years I dont know the exact reason . Was it because of no stock? Or is it because this biscuit was not in production for long? Did they rebrand this? # taste - 4.5 /5( the earlier version was awasome now a days sugar upon biscuit are not great)Britannia has come with many biscuit flavour. It has lot of verities one of them little hearts. Little hearts is fully made by wheat aatta which is called mendaa and add sugar. It is very famous among newly married and young blood boys and girls. In my school time I eat so many time in just 3 rupees to 5 rupees. Now in market it available in just 10 rupees to 15 rupees.This biscuit has a traditional shape of hearts and it never changed by britannia. in heart shape it looks nice and on the surface of the biscuit spread some sugar piece which gives extra sugar taste. This biscuit is perfect for given gift for our girlfriend priyans and princess.Before using it we need to see its manufacturer date and packaging and it expiry date then we use it. I really really recommended it and eat self and gives for eat other.", "amritajuhi": " Little hearts is my favourite biscuit from childhood as well as my brothers also. and more attractive is its shape and that shining on the top of this biscuit. also I remember that story which I read in my childhood that romeo &amp; Juliet story. how romeo offer little heart biscuit to Juliet and made happy to her. I perched this pack in 5rs. that time .but the quantity is good enough that time but now its not sufficient to share a packet with 2-3 person."}], {"goelhitesh7": " I having this product from my childhood when I was 8-9 years old. This is the only product for which I have not found any substitution. Trust me guy's. This is the best the best and the best biscuit anyone can have. The shape of biscuit a heart is damn good and sugar coating is excellent. I daily have 2-3 packets of this biscuit.! Everybody should buy this product and taste. Thank you Britannia for this amazing little hearts biscuit .!", "waseem_khan4u2002": " Little hearts is my favorite biscuit from childhood. Even though now so many biscuits and varieties have come to the market little hearts stays unique. It tastes gud with the cookie and sugar on top of it. So many years have even now the quality of the biscuit is good. While travelling its better snack to take it along. A very good companion for people. The quantity became less but it s efficient. Its a good snack to consume and hygenic also. . this my favorite biscuit  childhood to till now", "naruto100": " I don't need to tell more about this biscuits as this product is available in the market since many years. And I am just amazed that they are still having that many fan following. To maintain their quality for so many years is not an easy task, they have done really good job. And Britannia itself is big, known and trusted company.At our home almost all people like this biscuit. In fact we used to eat these biscuits many years ago. But recently I found that they are still available in the market. So I surprised and bought them. And I am happy that still it is having same taste like before.As they are more sweet they are not suitable with tea. But if someone interested in sweet biscuits then this one is the best.", "pratip2016": " This is the only product for which I have not found any other substitution.To maintain their quality for so many years is not an easy task, they have done really good job.So many other company launch little heart to copmare to britania but its impossible, its taste so different and amazing.And the shape of this product heart shape and itrs taste fill in thew heart.Its package also red that fill into the heart.", "ss766991": " Britannia little hearts are the biscuit where sold when I was some 3years and I still love eating this little hearts.This my favourite biscuits I ever had.It makes my heart very happy when I eat this liitle hearts.I usual eat this little hearts often.Little hearts are one of the best biscuits manufactured by brittania and love it very much.It is such a fun to eat this biscuits.When I was small boy around 3years I started eatibg this and I am 19 yrs and I still love eating this biscuit.One of the best biscuits I ever had.", "mickeyahirmickey": " One of my favourite biscuit is \"Little Heart\" which almost all person's favourite food as snacks.When I was in 4-5 standard I used to eat this biscuits most among all other products because it is more sweet and delicious biscuit.Now I am doing collage, till now I used to eat this buscuits. It is my all time favourite snacks and my whole family like it and also like to have it as snacks.If someone is there who didn't try it out, please do for once because this is so delicious and yummiee.Thank you.", "ryanathor1": " Really loved it!They are too delicious and crispy biscuits.The sugar coating over the heart shaped small sized biscuit makes it more yummy!Also, at such cheap price, you cannot expect such great product.So, friends if you haven't tried this yet, please at least eat it for once and  you will definitely like it", "riteshnsg": " I have been eating the little hearts biscuits from my childhood and I absolutely love it. The biscuits main attraction is the super filled inside which bursts once you start crunching it. The quatity is also satisfactory.The packaging is also good and all my family member love it. Its just a quick snack Bute I like to have when ever I am thinking to eat something while enjoying TV or just simply having tea.This is one of the best biscuits that I ever came across and that too at a price of 10 rupees is just simply very good.I think that is all I can write about as I cannnot stress enough that its a very good quality product for consumption. I do recommend it", "10aug1986": " Britannia is a famous brand of food product in India .All its products are good, specially its biscuits and cookies are very delicious.The one I like most is Britannia Little Heart Biscuits.Its in shape of heart with sugar sprinkled on it.It simply melts in mouth and has an awesome taste.Product packaging is also very attractive.Price Rs 10 for 39 gms pouch, so price ok for a quality product.Its ideal for tea time snack.Liked by people of all age group, specially kids.Its very light and its much better than local made biscuits and cookies which contain lot of oil and ghee.", "vishu730": " This kind of biscuit are the biscuits which are very low for the production companies to make them. some companies only makes biscuits but brittania makes biscuit with heart which is a result to little hearts. a very tasty, delicious, delightful biscuit which is very crunchy, sweet and got a layer of sugar in it. it melts when you take that in mouth and gives a hard pleasure to the throat. very tasty biscuit like by everyone and is very low price too.", "Kshitijagautam7": " I have been eating the little hearts biscuits from my childhood and I absolutely love it. The biscuits main attraction is the super filled inside which bursts once you start crunching it. The quatity is also satisfactory.The packaging is also good and all my family member love it. Its just a quick snack Bute I like to have when ever I am thinking to eat something while enjoying TV or just simply having tea.This is one of the best biscuits that I ever came across and that too at a price of 10 rupees is just simply very good.I think that is all I can write about as I cannnot stress enough that its a very good quality product for consumption. I do recommend it.", "dikki2013": " I started eating ' Britannia little hearts ' when I was 5 or 6 yr old . And how I am 24 still I love the taste and texture of this biscuit.I was able to get these biscuits in middle years I dont know the exact reason . Was it because of no stock ? Or is it because this biscuit was not in production for long ? Did they rebrand this ?Ans for these questions cannot be found here but I just wanted to review the product to inform other how great the buscuit is .Lets review on base of various category :# taste - 4.5 /5 ( the earlier version was awasome now a days sugar upon biscuit are not great )# price - 5/5 , its worth the price# quntity -4 /5 , v might get around 10 piece for 5 rs I think ( dont know exact count )# quality -4 /5# sweetness - 5/5 , perfect balance of sweetnessOverall 'Britannia little hearts' can be given 4.5/5 rating .Signing off, jai hind.Dikki", "rinkyrahut94": " Britannia is such a brand which can claim the frist position in our snacs world. This tiny product named'little hearts' can fill your heart at the very first bit. I can buy this product for - 1. Good buttery taste 2. Full with nuts 3. Oil free biscuit 4. Small attractive shap and size 5. Amazing packaging.You can take this anytime you want. It gives a fulfillness to your empty stomach. Children have a craze on it. They like it in their school tiffin. Adults like college going students and office worker also like to take'little hearts' at tea break. Ultimately when you are hungery go for it. Taste is best.", "akashgaikwad894": " The Britannia's little heart test was very good and crispyIt has been unique in two sense one was packing and second was bite size small heart shaped biscuit coated with sugarIt was first time biscuit retailed in pouch like potato wafersThe taste of this biscuit is good with flavors like same as Or chocolateThe color is dark brown and the baking is also goodThe bit is very soft like cookiesAnd the packaging is pick packing with metallized wrapperBy adding many indigents this biscuits wore baked like wheat flour, sugar, edible veritable oil, milk solids, rising agent salt, or much more.I like this biscuit very much", "rockslogesh2194": " Britannia is a famous brand of food product in India .All its products are good, specially its biscuits and cookies are very delicious.The one I like most is Britannia Little Heart Biscuits.Its in shape of heart with sugar sprinkled on it.It simply amazing.I love to have little heart biscuits.", "drhemuvet": " Yummmyyyyy, I like the biscuite very much, the shape of biscuits feel me lovely and make me full of love. because the shape is heart shape,the sugar crystals in the middle of biscuits make me cozy, and remind me my hostle mass days, because it is dispatched in our hostel mesh,its also a very good thing to give gift to someone you love. specially for girl. girls think its a part of proposal of her loved one,I highly recommend to buy it, eat it, and give happiness to your girlfriend.", "krishna_14322": " Britannia products india's number one products.it's company biscuits king.britania little hearts is my favourote biscuit from my childhood.Its now so many biscuits and varities have come to the market.so many years have even now the quality of the biscuit is good.its unique heart shapw design is the usp of the product it attracts eyes and looks adorable very nice.They are very crispy too and the mouth leaving a lingering taste.And good packing.Overall it is very good company and I recommand all of you its amazing and fabuloud biscuit good tast.", "bhargavmettu": " Britannia little hearts is one of the leading part of biscuits in present market from past till now. The taste of the biscuits is very delicious and they get melted if we kept on the tongue. I always used to keep on the tongue for sometime the sweetness in the biscuit is taken out by tongue. Many kids like these biscuits but these are very expensive at present. The brand has a good name and the product quality is good and taste is very good all ages of people can eat this biscuits.", "ashgpt": " I like Britannia little Hearts. its good in taste and its not costly is a great product of Britannia. I eat little hearts 100 of times still hungry for it.The quantity of little hearts in packet is also good its not like othet product low cast = less productI really enjoy while eating the little heartsThe idea of making this type of cookie is goodHeart shape and powder suger on it .I love it"}], {"kri_vas89": " These are my all time favorite crunchy and sweet cookies from Britannia, which is an Indian food-product company established in 1892 at Bangalore. Britannia has other products like rusk, bread, cakes and other dairy products.About these Little Hearts biscuits, these are heart shaped small in size sweet biscuits, whichare made of refined wheat flour, sugar, vegetable oil, raising agent, salt, yeast and emulsifier. The nutrition fact about these cookies is 4.32 gm of total fat, 17.04 gm of carbohydrate, 6.24 gm of sugar and 1.68 gm of protein.These cookies comes in small packets of ten rupees. One should try these sweet flavoured biscuits once, over which grained sugar is sprinkled and very delightful to eat.", "samikshapanwar445": " Britannia little hearts are my child hood biscuits. I really loved them alot. and same now.britannia makes  awsome biscuits. EAT HEALTHY, THINK BETTER.earlier I used to eat biscuits of \"parle\" brand, they are also nice but britannia is the best . their breads, rusks and biscuits are so fresh and crispy. the choco chip cookikies are so rich in taste and so the little hearts. people who love richness in their biscuits and other dairy product must buy it", "mona_magic2002": " Little Hearts are just like the name, small, sweet, heart shaped biscuits. These are actually tiny crisp and sweet snack item and not the conventional biscuits that you can dip in your tea and have. Nevertheless, these are simply great light snacks that melts in your mouth and leaves behind a nice taste.These small sugar cookies are so light and crispy that you will not even notice when the entire pack has gone empty and it doesn't make you feel full. We love Little Hearts as our evening munchies and share and enjoy it together in our family.", "jitendrakumawat40": " It's incareble biscuit&amp; Best Biscuit ever you can purchase and this it too great biscuit.It can be useful for heath.Britania is a greatest brand of India which creates numerous sustenance product.The state of the scones are adoration image.its amazing and fabuloud biscuit in world in that budget.", "ashokratnakumar24": " I  LOVE LITTLE HEARTS VERY MUCH BECAUSE IT HAD VERY TASTY AND CRISPY TO EAT, HOW EVER WE SEEN THE CRICKET MATCHES I WAS USED THE LITTLE HEARTS FOR THE TIME PASS, IT WAS VERY NICE, BRITANNIA WAS TRUSTED BRAND, IT TAKE GOOD MEASURES, WE HAVE TO GIVE THE PACKET TO OUR LOVABLE ONES, WHEN WE SIT TOGETHER WE WAS TAKE THE LITTLE HEARTS IN OUR PROGRAMME, IT WAS COMING IN THE TWO VARIABLE RATE 5 &amp; 10. BUT NOW A DAYS LITTLE HEARTS PACKET DECREASING THE CRISPY", "skaleefa": " Little heart has been my favorite biscuit since I was a child,  it os very sweet light and airy, my whole family is fond of it.As you know its name is little heart so are the shape of the biscuits or cookies.Flavour is just awsome.Look is also very good.Taste like pastry cookies.Melts in your mouth.Packaging is kind of ok.Available in every small or big shop.I am fully satisfied with this and will definitely recommed to try or indulge in this beatiful sweet.Thanks to britannia to uphold its taste.", "Priya_Balaguru": " Little hearts is my favourote biscuit from childhood. Eventhough now so many biscuits and varities have  come to the market little hearts stys unique. It tastes gud with the cookie and sugar on top of it. So many years have even now the quality of the biscuit is good. While travelling its  better snack to take it along. A very good companion for people.The quantity became less but it s effeicient. Its a good snack to consume and hygenic also.", "man_inder": " Britannia Little Heart Biscuits are very famous and old. These biscuits are in the shape of little hearts. These are crunchy and sweet. The ttaste of sugar make it delicious and its crunchyness is awsome.When I was kod these were my favourite biscuits and now also I eat these biscuits.  These are my forst choice ever when I need some sweet.Packing of it are in red color which is very attractive. It is 10rs. Pack with good quantity. Quality wise these biscuits are also very good.Overall little hearts biscuits are very good in flavour and all aspects.", "Akand": " It is one of the few products in market that is for decades have not changed in taste nor found any substituteAt a pocket friendly price range a childhood love of allIts unique heart shape design is the USP of the product it attracts eyes and looks adorableIts crispy sweet &amp; salty wafers melts in the mouth leaving a lingering tasteAlthough the packet is packet with air for restoring freshness the quantity is adequate hardly there is any peice which is not in shape or brokenIt will always be all time favourite snacks", "vishalkhatri2": " The little hearts give me joy.When ever you eat these little little hearts you get so much joy.The sweet coating, the nice taste of biscuit and the easy availability.I am in love with these little things, and if you havent teied it then please do so and I am sure you will love it.The packing is also ver good. If you dont have thw money to buy a silk or a costly gift for your girlfriend then this is also a very good option.", "vino0704": " I have tasted much type of biscuits. Especially Britannia brand, I have grace on Britannia brand. One day I bought little hearts biscuit. It’s completely different from other biscuit. It contains small size heart shape biscuits in it. Taste of that biscuit was awesome. I liked it lot. The shape attracts me lot. It’s so crunchy in sugar. This combination gives amazing taste to this biscuit. Its price starts with Rs.5. Its packing is good. I am sure girls will like this little heart biscuits. The only thing I felt bad in that was its quantity seems little for me. But I am sure its worth for the cost.", "bpsharmabsf": " The shape and the sweet taste of this biscuit attracts me most for buying it .since it is the product from britannia  which is king among the indian food products like cake, biscuit,  etc.i always buy 20 to 30 packets of little hearts when goes to buy grosser y in mall.it is heart shaped with a sweet taste which is good way to spread love with sweetness . it is always been in the favorite list of kids . and it is not too costly with  a price of 10 rupees . the demand . of this biscuit is too much . kids as well as adult love this biscuit. . even the brand of this biscuit britannia is trustful . it is from since 1892. now you can also imagine .", "siddiquishadab7860": " Best Biscuit ever you can buy and this it too too good biscuit.It can be helpful for heath.It is to good for heart healthy then other biscuit and it have very less oily.If you want to eat something you can eat this first then other.I hope you can eat this Biscuit then say What is Good and Bad", "kkalpande": " Britannia Little Hearts is My best favourite cookies forever, I am eating these cookies regularly, when I was 5 years old. It is really tasty and delicious cookies. it is design in the shape of a heart with the butter taste and at the middle of the cookies there is an solid sugar which is really delicious to eat talking about the quality, quality is still same as what I was getting previously.price is also reasonable you will get it at 10 rupees only also it is easily available on most of the retail store I will definitely recommend this product to every cookies  lovers.", "sharma_nirbhay": " Britannia is one of the leading company in india and all over the world . They have made many awsome product and britannia little heart is also their product.This product is really very tasty product britannia was making this product from last 10 year as far I know when I was so young I used to eat this product .This is really tasty and the sugar coating on the top makes it unique as well as yummy to eat.It is made in shape of heart which make them more unique in heart shape it's taste is good and sugar coating is best in that biscuit I have tried many product but I seriously like this product from my childhood . My whole family used to eat this product .It comes in small packet for 5 rs and for 10 rs .YOu can buy it from any local store.", "sagar092": " These are the biscuits which I am having since my childhood and the taste remains same. They are very unique, each biscuit is having a heart shape which is having sugar sprinkled on it. They are very crispy too. Britannia is a very renowned brand and they are not so costly like hide n seek and fab etc.", "yathiraaja": " This brand of biscuits having high sugar content. So, it may be harmful to children and others who eat it.We observe these biscuits on which sugar crystals adhere on the surface of it. We recommend Britannia salt biscuits, good day biscuits instead of it.Most of the lovers they prefer to buy this because biscuits are in love symbol.Package of little heart biscuits to be ensured as better if more quantity of biscuits fill in it to occupy the airspace in the package.", "kedgychintu": " Well there are many shapes in this huge world which we observe, use, and make but mostly whenever it comes to the matter of love than the only lovely shape that strikes on to our mind is the shape of a heart. And mostly in several circumstances whenever we think to gift anything special to our loved ones than we usually surprise them with a gift in the shape of a sweet little heart. And here the company so called Britannia which is quite a lot popular for its genuine and healthy home eatables products caught the theme of love which is the heart itself and collaborated biscuits with lots of love and cherish with most effort and the genuine kind of quality which Britannia usually provides and distributes and with these all above mentioned aspects as said Britannia has given the quality biscuits a delicious and lovely shape that is of HEART.So its literally a dumb idea to tell you guys about the shape and size about this product anymore because all are quite already familiar with this product and it is not a review as I don't think myself to be that ergonomist that i'll be reviewing this fabulous product but  actually indeed its my sweet moments and memories with this LITTLE HEARTS that I want to share with you people.Whenever I make a purchase of this product and open it the shape of this biscuits mesmerizes me and reminds me of my sweet and my very first love the way these biscuits are baked are really filled with intensed love which can be felt in every bite of the SWEET and LITTLE HEARTS and boy the sugar that sticks to the biscuits just cherishes the beauty of the biscuits and makes it more sweeter than what it actually is. Which might be another reason which makes this product more delicious in taste and flourishes the biscuit itself.And coming to the part of packaging I can only say that it is packed completely perfect which enriches its looks and raises the bar of intensity of the consumer to taste them. But the only complaint from my side is that the quantity being  offered now to be frank come on yaar \"AB rs10 ME THODA TOH JYAADA DE DO, ITNA BHI KYA KANJOOSI!\"The taste is just amazing and very delicious to be true as you all know already it can be a great piece to present as a gift to your loved ones.The actual review is just to say that simply I JUST LOVE IT and I can say that no other company's product can compete with this lovely piece which actually won the heart of millions of people with its lovely shape and delicious taste to be true.Thanks GUYS for reading my experience and knowing my view and opinion regarding this product.THANKING YOUYOURS CHINTU!", "Sneha33": " My mother used to bribe me with little hearts when I was a kid. This is my all time favourite biscuit really love it. Britannia is a world class brand and my father always preferred buying Britannia biscuits.This biscuits are a favourite to all and there is no alternative to this biscuits. I have never found a person who hates this biscuit. Its sweet from outside and really crunchy and tasty from inside.The best part of this biscuit is it still comes in the same packets as it used to come earlier. It reminds me of childhood and those bribes my mother used to give me.What can I say I have a love for classics.My love for little hearts will never be replaced.", "rahilali": " Britannia Little Hearts Biscuits the real taste and crispy biscuits that ever come in the market and you already know that this company produce the good stuff and healthy stuff.I have tried many brand biscuits but I don't like it because they not make the taste of their biscuit very dull and their stuff is not healthy enough but britannia is the one company who make their item very good.Friends please try this brand grocery item and after that you will understand my feeling why I like Britannia Little Hearts Biscuits so much.thanks to all my friends who is reading this and have a nice day."}], {"Siddiqui555": " Now I am going to share my experience with this lovely biscuit which is favorite of mine and many others.About a year ago I am unaware from this product but It comes in my knowledge when I was standing at a shop and saw this I take it only for taste and fun but after tasting.At once I took another package and starts eating after few minutes I finds that no heart remains, taste is awesome but it hardly available in our locality so I check it regularly on shops.Good amount of biscuits are packed in a packet which is sufficient. My friends also used to eat.Packages are available in five, ten and more rupees in market which is average as others biscuits.Biscuits are crunchy and little sweet with good flavour. I like it mostly than others.", "delmatfel": " My love I eat everytime I present it to my gf every time I visit her she is so happy. This taste soo divine and from another planet.I eat this after lunch it like cigarette for me so addictive and crunchy.Why stopped this no idea but missing this too much.my love I eat everytime I present it to my gf everytime I visit her she is so happy.this taste soo divine and from another planet.I eat this after lunch it like cigarette for me so addictive and crunchy.y stopped this no idea but missing this too much", "uvaraj_s": " I like this biscuits since it is fit as a fiddle and the flavor is great and it is the result of Britannia so no inquiry for quality, it is the best in India and I had at lunch hours, these are made with wheat flour and sugar and it is fresh and crunchy and it is covered with sugar and it just melts when we eat it.It is accessible in only two packs which are little in pressing size, they are accessible in 5 and 10 rs. This little hearts remind me my school days where I would bring it with me to class to take it in breaks and night study hours. Despite everything I cherish its taste and it is great quality, once you taste it you will attempt it over and over. It is served best with tea as snacks.", "JAI25993": " Britania little hearts biscuits is one of the best biscuit available in the market.Shape of the little hearts biscuits look like heart mixed with sugar the test of this biscuits is very good biscuits has the shape of heart which attracts the buyer to buy and the taste of this heart biscuit is also very sweet.The price of 39 gram britannia little heart biscuits is only 10 rupees so everyone can but this biscuit.The sugar quantity in biscuits is little more so fat content in the biscuits is also more.you can also enjoy this biscuits with you girlfriend or boyfriend due to heart size. I recommend evreyone to buy this biscuits.", "chaithanyachacao": " In my old days every love story starting point is little hearts . They give to this pack and proposing,  its very sweet and salt they symbolic, in life  love and sadness  love is sweet, and sadness is salt, ha ha ha ha. its the story now trend change chocolates trend,   packing is sex.Fun moments with friends like girl friends a pack of little heart, light and crunch and sprinkled in sugar  and easily melt in mouth, now am righting with feel of little heart, my mouth is watering automatically ha ha ha, I don't know how its happen, its really good . Some guys  going old memorable  days . I think am very happy to share this with you guys.", "hkhatri50": " Today I will tell you all about the Britannia little biscuit.I aeveryone reviews to mouthshut. com then my eye  lying on review biscuit.Seeing it was reminiscent of my childhood.The biscuits taste the same when we used to eat as a child.And the design is bean-to-bean. the flavour and taSte awesome.The design of biscuit like the heart .and the packet of biscuits just to get only 10 rs. its realy tasty biscuits.", "ghoshsuraj970": " Little Hearts make me remember my childhood.It was one of the best biscuits at that time. The flavour and taste is jst awesome.Britannia Little Hearts has been unique in two sense one was packing and second was bite size small heart shaped biscuit  coated with sugar .It is the only product in itself that has no competition.Right from the children to the old age everyone likes it.In todays world yiu can have little hearts jst to change ur taste preferencesJst awesome.", "anuverma19933": " This biscuit has been disliked by me since my childhood where my friends used to have it with great craze. The biscuit is too hard and the taste also is not that appealing.I rather like the Meetha Suhali made by my mother than to waste Rs. 5 on a packet of this cookie ( for hygene being obvious reason) . There are other appealing cookies which would like to recomend in place of this. Sorry little heart, I found your heart to be hard and tough and not that sweet ??", "19ishaan": " Since many years now I have been eating Britannia Little Hearts biscuits and it has became better every day. A sweet evenly spread sugar taste which is delicious.I have tried many other brands biscuits but no one is close to The little hearts. These biscuits are for everyone i.e children, young people and even old. With great packing and looks the taste is awesome too. I suggest all those who have not tried it, do have it once. Surely this will become a part of life after that. Very nice tasty biscuits.", "rajbaniya81": " Britania is a biggest brand of India which produces many food products like biscuits, butter, cheese, cookies, etc with a very good quality with a well hygiene . This Little hearts comes in a small plastic packed package for a 10?. The quantity it offers is 39 grams for 10? .It has a little sweet with some salty taste and as it goes in mouth it get melts adorable and taste amazingly . Every age of people love to eat this little hearts cookie which are in heart shaped .I just love to eat this little hearts .You should at least try this once I am sure will always need this .", "ahareeshyadav": " Britannia little hearts biscuits one of the best branded biscuits in India.Since childhood days I am eating this biscuits are so tasty to eat this little hearts biscuits.The shape of the biscuits are love symbol.It is super tasty biscuits are awesome. I am eating this biscuits daily .kids and childrens are eating daily.we can eat snakes timings also.Me and my family members are loved very much britannia little hearts biscuits.Britannia is number 1 biscuit company in India. Biscuit price is also impressive cost is 5 rs to 10 rs.It is healthy biscuits for children and kids.Taste is also awesome to eat biscuits.I suggest to all you can eat little hearts biscuits daily.my rating is 9/10.Thank you all.", "abhi_91": " My first meeting with this * cheeni wala biscuit* goes beyond 20 years. Yup 20! That's how old my relationship with these awesome hearts go!It had been my favorite for a long time since I was 3 or 5 years old maybe. My parents would bring me these as a \"bribe\" for being a good boy.;)And as I grew up. Ummm study pressure, I forgot about these. Until recently few months ago, when mom brought these again from market. I asked her where she found those because I can't see them just everywhere.So I get them whenever I can. Happiness at just Rs 10 isn't a bad idea. You get approx 20 pcs.  It was 16 in one of the packet that I counted. Tiny hearts. As good as they look.It used to be a bit sweet and used to melt in the mouth earlier which has been trimmed down probably. It doesn't taste bad however but now I am not able to eat more than one packet. It doesn't actually melts now.  You may not feel any difference but I am addicted to sweets so don't like it much now.", "GOWNIWARINIKITHA": " Little Hearts make me remember my childhood.It was one of the best biscuits at that time.In my Childhood I use to take snack me and my friends use to have this biscuits at that time my momprefers me this biscuit.The flavor and taste is just awesome.These are made with wheat flour and sugar and it is fresh andcrunchy and it is covered with sugar.We cant stop eating with one packet I use to have 2 to 3packets.Most Probably it is the product of Britannia, we every one know that Britannia is good product.Even old age people will prefer to eat only Britannia.THANKS TO BRITANNIA", "nayaln801": " Usually I like almost all the products of Britannia, but This is the only product which I really dislike.I feel It has a strange taste and nothing is like Britannia's other tasty biscuits, which irritates me.There is nothing like \"Classic\" in its pack.I do not know why this product is still available in the market?Best thing about it is. it does not come in a large packet in much quantity, otherwise I consider it as complete wastage of money.For me Its pack, Its biscuits, Its taste all are too bad.", "ajinkeya123": " Britannia Little Hearts is the most famous biscuit available in the market.The small heart shaped biscuit mixed with fine sugar and applied with a little bit of sugar syrup is very unique is taste.I am eating this biscuit since I was a kid, and I used to have it every other day that time.No other biscuit company has ever tried to copy the concept of what Britannia has done.I would like Britannia to come up with Chocolate flavored Little Hearts as it would taste lovely.This biscuit can be had with tea/coffee of just like that, it simply tastes good.Must try.", "atharkhan": " Little hearts from britannia company is best small biscuits.it is good to it shaped small little hearts and its combination of sugar and biscuits it is very tastey in eating I m good to tell peoples to eat this type of biscuits it costs only for rs 5 small pack and 10rs for big pack.Once you eat it then you realize it how good it is to eat and tasteful to eat it is good at all for small childrens also.largest buying biscuits in india.it is good for everyone else.i always like this biscuits it is coool to eat.it is mixture of some sugar and biscuits.But is tasty to eat.when you travel in the bus or in any vehicle then it is timepass for all when you travel anywhere.good to eat tasty to eat and brands company biscuits.", "udaykalyan77": " My all time favourite Biscuits are Britannia Little Hearts. They are heart shaped simple baked biscuits sprinkled with a layer of sugar on it.They are very tasty and I love them. Easily available in the normal stores cost is also very less. What made them famous apart from the taste is that they are easily recognized among others and the name touches the heart.I think the fat content is little more due to the sugar addition. Moreover Britannia is a trusted company since my childhood. I recommend to buy", "mehtaparth786": " Britannia is a famous brand of food product in India .All its products are good, specially its biscuits and cookies are very delicious.The one I like most is Britannia Little Heart Biscuits.Its in shape of heart with sugar sprinkled on it.It simply melts in mouth and has an awesome taste.Product packaging is also very attractive.Price Rs 10 for 39 gms pouch, so price ok for a quality product.Its ideal for tea time snack.Liked by people of all age group, specially kids.Its very light and its much better than local made biscuits and cookies which contain lot of oil and ghee.", "Sathya_Balaji": " From the early days of my Childhood, this one is my top favourite. Heart shaped biscuits with sugar sprinkled on it.39 grams is 10 Rupees. So price is good for the taste.Though not much oil and sugar and no cream, this biscuits are sure to melt in the mouth. Even My Dad, aged around 58 still loves this biscuit. Packaging can be improved as sometimes find them broken.Overll, A tasty snack for anytime in the day", "moudgill_46": " We all know very well about little heats. A beautiful and tasty gift by Britannia. It has a incomparable taste and well packed. everyone has his own memories with little hearts. Lets go through some points:Flavor:It is sweet in taste and micro sugars improve it's taste up to very high level. I have never tasted such a great taste in my entire life. It is the choice of every generation.Product quality:As we know it has a great taste similarly it has the great quality. Quality of raw material is genuinely very nice.Product Packaging:It has nice packaging as it does not comes in tradition type biscuit pack. It comes in Chips type pack. You can easily share with your dears."}], {"ashutoshroy007": " Though almost every product from Britannia is good and of standard quality.Little Hearts is addition to that list, from my childhood I am eating this product.Pack of Rs 5 and Rs 10  are easy to buy at very affordable price.Cooky is of Heart shape with Some sugar sprinkled on it, which enhances it's taste. A crispy sweet cooky is awesome to have when you are relaxing in time of evening or hanging with Friends or family.Pros: Quality, Taste, PackagingCons: Nothing changed over yearsVerdict : A good product, worth trying", "rdaraz": " Britannia Little Hearts is a scone which is a standout amongst the most offering biscuits.Unlike different bread rolls which come in ordinary pressing this one is bit distinctive at first you will think it is a parcel of chips yet its not its biscuit.I have been having this bread from my adolescence when I used to go to class regardless I have this when I tumbled to have something sweet and crispy.The taste of this bread rolls is yummy its sweet and firm an I simply cherish it.The extraordinary part about is that it comes fit as a fiddle of heart which is so attractive.The sweet taste of the bread rolls due to the sugar and the flavor they put is the best part of this biscuit.The nature of the item is great and the pressing is likewise really nice and the spread is additionally attractive.So in the event that you haven't attempted this roll yet then I profoundly prescribe you to simply ahead and have this bread rolls and you will simply adore its flavor and you won't discover a rolls that I can wager you", "Diksha123": " Since my childhood I love to eat this little heart.specially because of their heart shape with sugary cover on it. it is really yummy biscuits.and britannia is very old and good brand for biscuits. if I am eating biscuits first I prefer britannia and then any other like parle-g, sunfeast, etc.Britannia was one of the first companies in India to pioneer category defining innovations like Cream Cheese and introducing a host of international flavors for its cubes &amp; spreads in India. Britannia is recognized as one of the most trusted, valuable and popular brands among Indian consumers.Britannia has making various product like dairy, cakes, Rusk, breads, and Biscuits. and little heart is one of them.Anyone can eat this biscuits.Without any doubt you can eat this sugary sweet little heart biscuit.:)", "pandeyneeraj014": " Britannia is really another name of bakery food product in India . All its products are good, specially its biscuits and cookies are very delicious. The one I like most is Britannia Little Heart Biscuits. The most catch and attractive thing is Its in shape of heart with sugar sprinkled on it. It simply melts in mouth and has an awesome taste. Product packaging is also themed with what inside. Price no doubt is very worth. You can get it at Rs 10 for 39 gms pouch, so price fine for a quality product.These biscuits are ideal for tea time snack or you can have them for time pass. Because of its shape and taste it is liked by people of all age group, specially kids.Little heart biscuits is very light and its much better than local made biscuits and cookies which contain lot of oil and ghee.", "Surbhi91": " Britannia little Hearts Biscuits it is the great and decent organization about this britannia little Hearts Biscuits are little and hearts shapes and its a crisp when you eat this rolls time you comprehend the flaver of this bread rollsin this biscuits include the crispness and sugar with the caramel and sweetness to in hearts shapesGreat taste and great decision of this rolls I like all that much this scones and Britannia organization who make this sorts of the biscuits. At the point when any item is propelled by the organization that time is trust is imperative if the consumer trust anything so the consumer dont thing about this item and they purchasing from shop or the shopping centerI am trust on the Britannia organization you ought to trust on the britannia company and purchase the Britannia little hearts Biscuits", "kamaladevikuwar8": " Britannia little Hearts Biscuits it is the good and nice companyabout this britannia little Hearts Biscuits are little and hearts shaps and its a chrispywhen you eat this biscuits that time you understand the flaver of this biscuitsin this buscits add the crispyness and suger with the caremell and sweetness to in hearts shapesgood teast and good choice of this biscuits I like very much this biscuits and Britannia company who make this types of the buscuitswhen any product is launched by the company that time is trust is very important if the cunsumer trust any thing so the cunsumer dont thing about this product and they buying from shop or the mallI am trust on the Britannia company you should trust on the britannia campany and buy the Britannia little hearts Biscuits", "karanparmarkp5595": " Best biscuits. I love this biscuits. Nothing accompanies fun moments with friends like a pack of Little Hearts. Light, crunchy biscuits generously sprinkled with sugar, they blissfully melt in your mouth.The iconic gold and red pack is easy to spot and is found just about everywhere. So if you’re looking for some fun and memorable times, just grab a pack of delicious Little Hearts, your favorite bunch of friends and share!", "devjitsardar": " I just like Britannia. There are so many good products from Britannia. Britannia Little Hearts is one of the best biscuit. This little hearts biscuit maintaining the benchmark since a very long time. This is one of the cute looking biscuit. There are so many plus points of this biscuit.The points are,The biscuit is a very good and sweet looking biscuit.The taste of this biscuit is just awesome.This biscuit comes with a very nice packaging.The price if this biscuit is also very affordable.Anyone can enjoy the taste of this biscuit without any worry.This is all about Britannia Little Hearts Biscuit according to me. I just love little hearts.", "tamilselvam4321": " I love this biscuits because it is in heart shape and the flavor is good and it is the product of Britannia so no question for quality, it is the best in India.I eat this biscuits with tea  and it tastes very good.  I used to buy it when I would go to school and I ate at lunch hours,  these are made with wheat flour and sugar and it is crispy and crunchy and it is coated with sugar and it just melts when we eat it. it is available in just two packs which are very small in packing size, they are available in 5 and 10 rs.This little hearts remind me my school days where I would take it with me to school to take it in breaks and evening  study hours. even now I carry them while travelling to my home land. I still love its taste and it is very good quality, once you taste it you will definitely try  it again and again. It is served best with tea as snacks.", "boradedipika": " Little Hearts is a britannia branded biscuits which is so tasty and sugary.All the biscuits of britannia brand are nice but we loves little hearts very much.I like the making and appearance of this biscuits very much.Its crispiness and crunchiness is too high and idea to apply a layer of sugar on upper side is makes it very delicious.My family loves it very much.I always place it in my purse for my daughter.It is a good item when we feel something metallic like taste.Its packaging also good and price wise it too reasonable.It is available in 5rs pack and 10 rs pack.It can available to you at all shops and markets.I always choose it when I want something sugary to eat.", "ankita_6mba": " I had these biscuits first time in 2010 during my college times. at that time I used purchase a small packet around rupees 5 or 10/-.I like its sweet and salty taste with sugar crystals sticked to it. Best thing it was used to available every where. Plus it is quite economic.It is loved by everyone due to its unique shape. Even children love to eat them a lot. It is not unhealthy to eat. It is crispy in nature. It is a handy pack one can have anytime and anywhere. For snacking and little hunger pangs can be fulfilled by it and it will not overload your tummy. If you guys have not tried it, try it once", "srinuec080": " Best biscuits. I love this biscuits. Nothing accompanies fun moments with friends like a pack of Little Hearts. Light, crunchy biscuits generously sprinkled with sugar, they blissfully melt in your mouth.The iconic gold and red pack is easy to spot and is found just about everywhere. So if you’re looking for some fun and memorable times, just grab a pack of delicious Little Hearts, your favorite bunch of friends and share!", "rishu306": " When I used to go to school, I used to buy them daily when I returned from school and still they tastes the same.The shape of the biscuit is the plus point of this product. Brittania a leader in biscuit manufacturing didnt disappoint us with the launch of this product.They are crispy and they melt in mouth like choclate. And the sweetner content is balanced so they dont taste too much sweet or low on sugar content.Loved them.8.9/10", "BERKASH": " I use to always prefer Britannia brand biscuits, nutri choice, milk bikis like wise little hearts is good to taste &amp;  healthy .I Suffer with digestive problem. when I eat other brand biscuits it is giving acidity, but britannia little heart, milk bikis, nutrichoivce not giving harm. Hence I use to buy this product.Britannia little heart biscuits is very well taste &amp; flavour . Children like it very much.", "priyansharora9198": " These are the best biscuits I have eaten, these biscuits are sold since a long period and I am eating these from childhood, these are hearts in shape as the name suggests, these biscuits are sprinkled with sugar and I think these biscuits are 1st of this type.These biscuits are made by britannia which is a well known company so we don't have to worry about the quality of the product, the taste is best and these are one of some biscuits that I like its available in the market for just Rs.10 so anyone can buy it and eat as much as they want.", "Sherlocked": " I have been enjoying this biscuits for many years as not just me my kids too love this one.I prefer little hearts because they don't have any Masalas or spices or any ingredients that can be harmful,  just biscuits with sugar crystals which is simple but tasty and healthy.Children like biscuits specially cream biscuits but I  try to keep that away by giving this little hearts.They are baked perfectly crunchy and sweet sugars makes it lovely.Now a days the quantity of the biscuits and sugar have reduced and this packs are rarely available in local stores don't know the reason,  I could find only in stalls in station and supermarkets and can't stop myself from buying this golden and red pack if I notice.Good simple tasty biscuits from Britannia and have been enjoying this biscuits for more than 8 years and would recommend others.", "kalaiarasi": " Little hearts is the product of Britannia, I love this biscuits because it is very crunch and tasty and sweet and they are in heart shape and too delicious, the sugar crystals are sprinkled on it are very sweet and crispy.Whenever I travel I use to carry a packet with me for time pass.The packing is available in small and large packing, it is available in 5 and 10 rs pack. Which is very tasty and we can eat it in tea break in office or home. It has low sugar and calories. It became popular because of its taste and quality.It is best snack for the children’s.  these are in the shape of hearts, and it just melts in when we eat it. they are the best and tasty forever. The quantity may be less but the quality of biscuit is perfect. They are available in only two medium packs. it is best you can try it and have good taste of it.", "sumansaha10010": " Britannia is a very good brand name as their product quality.I use this brand during long time.My all family members also like this brands.One of the great tasty biscuit in this brand is \"Little hearts\"what is like mostly is shape of the little heart.The taste of this biscuit is very good. you can gift any one of your special this product, I am sure He/She definitely love it.whenever I buy this biscuit my family members are very happy to see this.So I must say Britannia Little Hearts For all Sweet Heart.", "jagdish_val": " The Little Hearts biscuits is something that I and most of the others too have enjoyed since their childhood days.The Little Hearts biscuit in their red and golden pack can be easily spotted in the grocery stores or the big malls.They are crunchy and would meit in your mouth as soon as you put it in. Its different from the other biscuits that it has a sugary-salty taste to it. What's more, powdered sugar is sprinkled over it, which makes it even more delicious.And further, the cost is only Rs. 10/- for a 39gm pack.One thing which I feel has changed over the years is that the thickness has gone down since the years, as previously the biscuits were quite large.", "deepikachoudhary7": " Britannia little hearts biscuits are like my best friend from my childhood days . I remember, first time I came across with these delicious biscuits at the age of 11 or 12, that time i'm on a trip to vaishno devi .You all know in train it take lots of time to reach vaishno devi . so, my mum introduce me with this sweet biscuits .the flavour, crunchiness of sugar particles, cute shape all are impressed me very much and from that day . they add in my snack list."}], {"satish59856": " Britannia Little hearts is a heart shaped biscuit. A light snack that can be eaten with evening tea or alone too.Packaging - Packaging is very good and does not let air affect the taste unless opened.Design - Heart shaped biscuits that are truly a treat to the taste buds.Taste - The taste is slightly sweet. It is a hearth shaped biscuit baked with ground sugar on top. I totally love the taste and can't stop eating. Whenever i'm bored, I get a pack and munch on.Quantity is a bit less and leaves you wanting for more.Quality - Brand like britannia is well known for it's quality and standards. You don't need to worry.Cost - It is very affordable and comes in different size packs.", "nottyrajat": " Some says old is gold and yeah perfectly said. Britannia little heart biscuits are the best biscuit and I am using it around 15 years . Which I can say I am using it from my childhood. Best in tatse , heart in size actually touches everyone hearts.Till date there is no flaws I can point out about this particular product of britannia. Quantity according to price is too good according to me. Flavor wise I will rate full 5 on 5 . packaging is done so well ensuring you get the product tatse and quality at its best. Totally value for your money.", "harishkumar721990": " Britannia little hearts is very good quality of biscuitI really like its coating sugar in upper layer in mid nd last layer baked floorI really like its low sugar upper coatingAhhhhhhhhAnd its packaging is goodPlease bring more buiscuit in low 10 rupees packagesHihihi.Anyways britannia is well known brand since my childhoodAndI nd my family fully trust with the quality of productSoAll and all try this its very good", "nik4444": " Britannia is one of the trusted company. Manufacture one of the best lookingvi weekly bought britannia little hearts biscuits they keep therev credibility the best biscuits britannia little heart britannia brand  biscuits me sabse aage hai biscuits really like is coating  sugar in upper. unlike oher biscuits which come in normal paking  this one different the. Biscuits  one of the best britannia little heartsGyus very good biscuits good tast", "prasanthibobbilli": " Little Hearts biscuits its my favourite cookie and it is one of the famous flavour of Britannia.I love this cookie since my childhood.And it is very tasty and excellent.Not only one generation almost every generation kids and youth is to love this cookie so much.Its too delicious with enough sweetness.I espically feel these look different from all biscuits. This biscuit has a traditional shape of hearts and it never changed by britannia.", "guru91": " Britannia Little Hearts Biscuits .i never thought I would write a review about something I love this much.how much.lets say.love doesnt have a scale.it does melt in ur mouth as the ad says.though takes a bit longer time that a first timer would expect.but it does make u feel sweet.atleast ur mouth.something u can definitely munch on.not sure its the right word .when u r with ur friends and loved ones. This Biscuits come in small heart shape with a tinge of sugar sprinkled over it.the moment you open the packet, your nose catches the lingering sweet smell of fresh biscuits and your hand reaches into the pouch and then you find yourself munching the small tiny hearts with pleasure and definately enjoying the blend of sweetness with a perfection.I dont know the ingredients because the moment I used to buy this pouch, the next moment I found myself enjoying it.so folks you will have to take the trouble of buying a pouch and going through the nitigrities.", "alankarhouse": " I weekly bought Britannia Little Hearts Biscuits on every Sunday. It has years of experience in the Marketing Field, and they keep there credibility till now in a good manner.Little Hearts was Launched in 1993 an targeted the kids and also it's the First Biscuit that packed in Pouch Packs.Its good with flavors like sesame or Chocolate.I still remember that, the launch message has a Taste experience that made the Unlikeliest characters like Dracula and Frankenstein.With Little Hearts, Britannia has tasted a sweet feel of Success and continuing there success till now by giving up Quality in there Products.I request all to taste it at least once in Life.Thank You.", "eahsanuz": " Britannia is one of the trusted fmcg company, who manufacture one of the best looking and tasty biscuits made in the shape of little heart. I have been eating this biscuits since my childhood and the Flavor has not change and even today the flavor have become more enhance in taste and the quality. I still remember when I bought little heart from departmental store for first time.When I opened the packet and saw the little heart biscuits coated with sugar for first time I fell in love with this heart biscuits. Little Hearts Biscuits never disappoint me with its taste and Flavor when ever I eat. I fell in love again and again with this biscuit each time I eat. product quality is  of little heart undoubtedly one of the best with all the essential nutrition available. Even packaging looks very attractive  same as its heart shaped biscuit. The package contain all the essential information regarding its ingredient. Little Hearts Biscuits is for everyboddy.", "Afroz82": " Britannia little hearts biscuits its really very tasty, Britannia company is a branded company, you can trust on this brand without any references, why because Britannia company will concentrate not only on taste, They will concentrate on quality and packing, Company have branded equipment to make biscuits, and they use good quality of raw material for making the products. On packing also will concentrate, and used quality packing, There is no alternate brand for Britannia, Britannia Is the best. Every one can buy this product, its not expensive.", "sujoy29": " Very good to taste. The sugary coat which is attached with this biscuits enhance its taste into a new level.It flavors and tastes  is such that it can be taken by anybody without anything .It package is such that it attracts customers of all ages between 6 to 60.The only problem with this biscuit is that it cannot be taken by diabetic patients.The other factor which makes this biscuit familiar with the masses is that it is very pocket friendly, In this price  range we are going to get a packet of biscuit which curb our hunger up to some extent.", "annmaryittiachan95": " My grandfather introduced Britannia little hearts biscuit to me. No other biscuit can replace this biscuit's tea time relevance. It's so crunchy, sugar crystals sprinkled on it making more sugary and tasty. I cannot avoid a pack of little heart during travels.After regular consumption it's now turned to a new taste bud to my tongue. I shouldn't forget to mention the product quality that it doesn't have any side effects. We are still following this product.but the product package contain more air than hearts. This is a disadvantage. But I think this is a business strategy to make us buy more packets.", "geethapalani200": " Britannia is a very famous brand in all over d india. All the products in britannia is very good especially britannia little heart taste is yummy and very very very taste. Britannia little heart biscuit one I like is its in shape of heart with sugar sprinkled on it. It simply melts in mouth and has an awesome taste. Product packaging is also very attractive. Its is liked by all age group people especially kids like it more. Its is ideal for tea time snacks.", "yogeshsnehalg": " Britania is a very very trusted brand since years.they are taking care of presentation as well as taste.i love britania since my childhood and now its favorite of my child too.you can trust britania 100% .Its a very old brànd.little heart is one of the favorite biscuits from britania.little heart taking care of everybody's hearts to keeping them happy, smiling.Its also favorites of old aged people", "sandeepborade": " Britania brand buiscuits me sabse aage hai.Is brand ke bahut sare alag alag buiscuits hai.Little hearts buiscuits mere ghar ke sabhi logon ko bahut hi jyada pasand hai.In buiscuits ki taste bahuthi badhiya banayi hai.ki ausa lagta hai ki jitna khao utna kam hi hai.iski crispiness bahut mast hai.Kab 2-4  packets khatam hote hai wo samajh me nahi aata.Iski design to sabko bhati hai.jo beech me shakkar rehti.wow.muh me pani aa jata hai.Ek incidence mere chacha ka ladka Usa me hai to wo india se kabhi bhi kuch bhi courier karane kehta hsi to usme little hearts compulsory rehta hai.Baccjonse lekar badon tak sab iske fans hai.Price me bhi ekdam right hai ye buiscuit.Packing quality bhi acchi hai.Aisehi aur tasty buiscuits banate rahe .Best luck britania", "divyabisht191097": " The britannia company itself is one of the most popular and trust-able. now what to say about their products i.e. little hearts.Since I was too small my parents use to bring this to me.I just love britannia little hearts all the time. it tastes so better , the sugar in the middle of it is so yum.biscuits just got melted in the mouth and hence it tastes more better; it too has the crunchy taste which indicates about how nicely it has been made just for us. buy it and have it", "vedavikas77": " Little hearts is a britanya product.the ingredients areRefined Wheat FlourSugar,Edible Vegetable Oil,Raising agent(E500(ii), E503(ii),Milk solids,Salt,Yeast,Emulsifier.these are in the shape of heart.the biscuits are tasty and crunchy.can be used as substitute for snacks.i am addicted to these biscuits since my childhood.if you didnt try these biscuits, please try once. these are available in packs of rs.5 and rs.10", "namitd": " I have been hittingeting this little heart since childhood. . It was one of the sweetest memories of my life.It just cost rupees 5 only and come with me great taste.You cannot found alternate of such type of biscuit in market.Its shape is of Little Hearts with sugar spread on it .it is a all moment a eatable snakes.It can be found in local Store.As it is made by the Britannia company which is one of the most trusted company of India, you can buy it without hesitation and can give it to your kids for eating.", "AdnanWadekar": " Britannia Little Hearts is a biscuit which is one of the most selling biscuits.Unlike other biscuits which come in normal packing this one is bit different at first you will think it is a packet of chips but its not its biscuit.I have been having this biscuit from my childhood when I used to go to school and I still have this when I fell to have something sweet and crispy.The taste of this biscuits is yummy its sweet and crispy an I just love it.The special part about is that it comes in the shape of heart which is so attractive.The sweet taste of the biscuits because of the sugar and the flavor they put is the best part of this biscuit.The quality of the product is awesome and the packing is also pretty decent and the cover is also attractive.So if you haven't tried this biscuit yet then I highly recommend you to go ahead and have this biscuits and you will just love its flavor and you will not find a biscuits that I can bet you", "tamangvkeyizm": " Who says u need more money for happiness.for me even small packet of britannia little hearts biscuits brings smile on my face. It is very sweet and crispy.i enjoy every mrng with my tea.when ever I travel I carry this little heart biscuits.It is very good for taste as well as for the time pass.its packing looks very hygienic. my brother's 5 yr ayushman loves eating this biscuit. It clearly proves britannia little hearts is for everyone.", "Prashanth852615": " Britannia Little hearts are special biscuits with a crispy sweet taste, for the first time in India biscuits came in a heart shaped and with tasty sweet taste, Britannia really made a very good effort by bringing this product into public, I especially feel these look different from all biscuits which are at present.Alternatively I eat good and hide and seek and what not every biscuits but feels special and thrill to eat Britannia Little heart Biscuits . I find most of the kids and youngsters love this biscuits, I can suggest this Biscuits to every one to have a taste and feel the specialty of these biscuits . Diabetic people please stay far from them."}], {"Aman99deep": " Britannia is a famous brand of food product in India .All its products are good, specially its biscuits and cookies are very delicious. The one I like most is Britannia Little Heart Biscuits. Its in shape of heart with sugar sprinkled on it.It simply melts in mouth and has an awesome taste. Product packaging is also very attractive. Price Rs 10 for 39 gms pouch, so price ok for a quality product. Its ideal for tea time snack. It is liked by people of all age group, specially kids. Its very light and its much better than local made biscuits and cookies which contain lot of oil and ghee.", "Manmath7": " Since childhood, the Britannia Little Hearts Biscuits have been my favourite.Be it any cream or other branded biscuit, for me this one's the best forever.The light heart shaped crunchy biscuits with some tiny sugar chunks sprinkled all over are so delicious that they just blissfully melt down when you have them one by one.These are one of those bakery items which aren't meant to be gulped at once.Have that each piece of biscuit in mouth and enjoy its taste.The ingredients are wheat flour, sugar, edible vegetable oil, milk solids, raising agent, salt, Yeast emulsifiers &amp; improvers.There's nothing to worry about the quality of the product.It's free from any harmful constituents and constitutes just normal bakery elements.There isn't any brand as in direct competition with the \"Little Hearts\".You will find this as a unique product amongst all biscuit brands.These are available in 20 and 40 grams for just Rs5 &amp; Rs10 respectively. I recommend these biscuits for everyone, be it children or elders, because your taste buds will love these.", "mounikasidda": " Little hearts are the awesome sugar coated heart shaped cookies introduced by brittania.it is the best packed lovely thing that refreshes the mood. The cookies melt in the mouth with great taste. It is one of the rare product that is maintaining the same quality and taste over years. It is beautifully packed in a red color wraper which itself is very attractive.Overall a lovely product with great taste and quality. Most of the people would have already tasted the product but for the one's who never tasted, it should be tasted first.", "ajaychintu": " From britannia little heart biscuits are very famous to every one.And it is very tasty and excellent.But the size should be some large means extraordinary and it this biscuit is the symbol of love.it is wellknown to world and from britannia every biscuits of other categories are good and best from other companies.Really it is very tasty and amazing product.In other products like parle, sunfeast and other brands among this britannia is very tasty and for health purpose britannia product launches sugar free and low calories biscuits.great idea and good quality biscuits.", "joyanaranha": " Britannia Little Hearts biscuits is one of the biscuits which I ever ate. I bought this biscuits from the local retail shop and its costing rupees only 10/-  We will get this biscuits in the packet similar to kurkure packet, in which biscuits is in the heart size and which are medium size. The taste of the biscuit is really good and very good to eat. And even its realky helpful while going for theatre or if we want to make time pass.The ppackaging of this biscuit really good and safe and there is no chance to go air from the packet because they did hard packet and even its in red color and looks really attractive. And even the quantity of the biscuit is so much, normall other products theynwill put more air and quantity will be less but in this they will put more biscuits. Overall its a good biscuits.", "amaljose764": " Eventhough I like all the biscuits of britania, I like the little hearts very much because no other cookie company made competition to this product.this biscuits are my favourite biscuits from my childhood.sugar mounted in this biscuits give better crunchy and heart shaped provides a better look", "cloudy_world15": " Britannia little hearts are my childhood one of the favorite snack. I use to love it. These little biscuits are very cute and are in shape of little cute hearts.The biscuits are of 10 rupees, the regular packet. I find this product fairly priced and Britannia is a very well known and popular brand. This brand is completely reliable and I can rely on it.I would recommend these biscuits for your little ones as they have honey and dusted raw sugar on it. The raw sugar give texture to the biscuit and honey topped on it is also very good.These biscuits  are good for health and is good for munching whenever one wants to much on something perfectly sweet.", "mayurjain1008": " Britannia has come with many biscuit flavour. It has lot of verities one of them little hearts. Little hearts is fully made by wheat aatta which is called mendaa and add sugar. It is very famous among newly married and young blood boys and girls. In my school time I eat so many time in just 3 rupees to 5 rupees. Now in market it available in just 10 rupees to 15 rupees.This biscuit has a traditional shape of hearts and it never changed by britannia. in heart shape it looks nice and on the surface of the biscuit spread some sugar piece which gives extra sugar taste. This biscuit is perfect for given gift for our girlfriend priyans and princess.Before using it we need to see its manufacturer date and packaging and it expiry date then we use it. I really really recommended it  and eat self and gives for eat other.", "itzmeesuvm": " Oh this biscuit had been one of my favorite since childhood, this tastes so good. I like this personally.Little hearts is one of the famous snacks item available in almosta ll general stores where you see variety of chips and biscuits.Moreover this one comes in a very affordable price so to enjoy anytimeA good time pass as well for every one of any age group. So give it a try and mark my words you wont regret it because this product worth its price.", "altunaik29": " Little heart is a fabulous snack since a kid I have been a big fan of little hearts I used have it in my recess time and today also I need it along with my tea it tastes like a salty sugar coated biscuit although nowadays there are many potato chips &amp; biscuits brand in the market &amp; even the competition has been increasing drastically none of the brands have not been able to make a product like britania little hearts and even if they have tried they have not been able to deliver which makes this snack one of its kind that separates it from others.This snack still bring a smile to my face.Britania has been able to maintain the consistency in this product always.", "rajansingh811": " I am huge fan of little heart biscuits and I have been eating this biscuits since my childhood. I love the shape of biscuits as its so unique and hearty shape with sugar powder sprinkled on it. and its packaging is also very unique and different from other biscuits brand . just the availibilty of this product is very less.", "galaxyc006": " This is one of my all time favourite biscuits from Britannia Company.It's just perfect for my taste bud. It is pocket friendly.The biscuits are in so cute heart shapes different from other regular biscuit shapes .Whenever I see this product in any grocery shop, this is my first option for biscuits.Although, it is not ideal for diabetic patients due to sugar substance spread over it.If you're not diabetic, then, try it once, its really very tasty.", "gemhewmht": " Well  u all know hearts and love them too but this is the only heart u can break and its still taste great . haha. well I know britannia is a great company but this is the sweetest thing he ever generated actually. u just cant have enough . it doesn't  matter what ur age is  u will still love them too much.The price is too cheap . the ingredient are too good and the shape is all favorite little heart. every one should buy this brand and so must share with all . after all its all about heart", "sourav8088": " Little hearts is one of the famous flavour of Britannia. I used to take this particular flavour of this particular brand everyday. I love this little heart shaped biscuit for its delicious taste. It completes my every morning with a cup of coffee.If you are hungry, looking for some tasty snack, just grab a pack of little heart. This  little hrarts are available in two different size and this pack of hearts can melt your heart.", "sunnyking92": " I have been eating this biscuit since my childhood. I was some of those things that I always wanted whenever I went out with my parents. even today, I am in love with this in the same amount.It's taste has not changed at all. its too delicious. its sweet and have some powdered sugar coating on the top which is awesome. Now the brand \"britania\" is a household name and the most trusted. and this biscuit is only manufactured by this company.This biscuit need no age limit. it can be enjoyed all age groups. Specially with tea or as a past time snack", "shailey123": " Britannia little hearts are cookies are there in market since many years. As such, many cookies are available  in marker but Britannia cookies are my favorite ones since childhood. These tiny heart shaped cookies are consumed by both adults and kids as quick snacks items.These cookies are soft, fresh, and sweet with sugar particles sprinkled over it, which melts in mouth by its own. optimally sweet. Easy to carry while travelling.  Economical price.Recommendation:Yummy cookiesMust try", "angel_upma": " I just remember my childhood days with this when I used to be crazy over little hearts. They are sugar coated biscuits in the shape of a heart tat melts in your mouth literally. Best with evening tea or coffee but can be had anytime anywhere if ur a lover like me.!Comes in small packs too so makes it easy for u to carry around and keep a check of how much of them u had already.! haha.!", "taheemrajat": " Earlier I thought these biscuits had eggs. Slowly I realized it has sugar coating that shines &amp; not the eggs. Its melt in your mouth biscuits - super awesomeI never come back from super market without these. No doubt you cant count on it for filling but it does tastes awesome. Take a romantic dip with these biscuits when you are with your would-be or better-half or may be GF/BF:):):)All time fav. You may have it with tea/coffee/milk or without anythingThis would just add flavor to your life"}], {"darjibabulal": " This is a very good and most trusted product of Britannia. This liked by the majority of the people in the country and easily available in the market. Though there many types of Britannia biscuits brand are available and these are good also but the small size heart shaped little hearts children like it very much.This comes in 75 or 100gm of packing red and gold color pkt. Its cost is Rs 10 per pkt only. It is very soft and tasty, sugar crystals sprinkled over the biscuits so it very crunchy and cripsy and melt easily in the mouth. Normally l used to buy any brand but my son like it very much and so l keep it at home every time. Now I also habitual to take it along with evening tea and it has become my favorite biscuits. Even my son used to keep it in his school bag.So these small crunchy hearts are very tasty and healthy. It is very fresh and energy giving brand and very good children choices. We must use it for good taste which are easily affordable by the common person.", "gayu19": " Britannia Little Hearts Biscuits is my favorite biscuits.  It has a wonderful taste . It is available in 5rupees packet. It is a biscuit with a heart shape. It has sugar over the biscuits. It is very cruchy and tasty.Its packing is really very impressive. The quantity is little less but quality is very high. Our stomach gets filled. You can't stop with 1packet.you will surely buy one more.It is our friends permanent food. In our break we will surely eat it.", "suji1234": " I used to eat this biscuits from past 5 years.  The shape of this biscuit is lik small hearts is cute and very very  attractive. .the light, crunchy, biscuits generously sprinkled with sugar. .it gives awesome taste. .I liked this biscuit more than any other biscuits.the shape if this biscuit us very nicee.I used to carry 1pack of little hearts in ma bag everyday. We get the taste only when we enjoying it slowly and steadily. .: -): -)", "coolnitish654": " Britannia little hearts will make you fall in love with them. They are so crunchy and damm delicious. When I was kid I used to fight with my brother over Britannia little hearts biscuits.These biscuits are in shape of heart with sugar is sprinkled over it and they are caramelized also to give a taste which no one can ever forget. Whenever I see little hearts biscuits today, my childhood memories flashes in front of my eyes.These biscuits comes in for Rs 15, Rs 20 and Rs 30 packages. You can get them at any nearby grocery store.", "manjunathatrb": " I like this crunchy munch little hearts from last five years having it . I like this biscuits more than chocolates or lollipops. My favourite travelling time partner for time pass reading story books and enjoying these crunchy munch little hearts.They are little salty, little sweet in taste very nice biscuits, Love the sweet&amp; salty taste it has and the shape of the small hearts is cute and attractive. Love the sprinkling of sugar over the biscuits.", "babudkamla": " First of all, my kids love this biscuits in there childhood. and yes even the smaller one is now  and still loves it.Its a unique biscuits. which come in a pack, pack in which waffers come.I like its taste. sweet sugary taste. with some crisp of the biscuit.Design is also too good. heart shaped biscuits. attracts everyone.packaging wise. also attracts the customers, especially children. red and yellowish golden color packing.And is affordable by everyone, .one complaint from Brittania. now this biscuits are not easily available in market. why&gt;?I will recommend this biscuits.", "leenabhatia1604": " From my childhood, I have special love for this biscuit. Its heart shape attracts me and invites me to have it. Plus its sweet taste and aroma has made me fall in love with it from my childhood.Why Did I Brought This Particular Brand- I still remember the time when I first purchased it, reason was the attractive packaging which is still the same. Another reason behind my purchase was the trust which my family has on this decades old brand.Which Brand I Considered Alternatively? and Why I Brought This One? Somehow I do compare this one with biscuits of Parle and Cadbury but always I find the taste, nutritive content and prices of Britania better than any other brand.I will surely suggest you all to buy and have this Little Hearts Biscuits. Some reasons which I will suggest you all li'l hearts of britania are:-Attractive in looks-Catchy packaging-Ultra light biscuits-Good option to give to kids &amp; present in front of guests-Reasonable priceWho Should Buy This?Those who want good biscuits for Kids, Guests and To have themselves should buy this one.", "Wadekar100": " Britannia Little Hearts is a tasty biscuit. Its shape in hearts looks very nice. I like to eat little hearts biscuit. I am using this biscuit since when I am 12 years old.I love this biscuit. It start from Rs.5. It is not so expenses. You can easily get in the market. you can eat with tea, Milk &amp; even only biscuit as per your requirement. It is crunchy. Its packing is also nice looking. Children are very happy to eat the Britannia little hearts biscuits.", "pasgft": " Not a great package but very good in taste, especially everyone who is having sweet tooth. You can have it with milk, tea or just munch it like this only.I just do not know health and nutrition aspects of the product but almost everyone of us made immuned by Maggie ( poor comparison) .I served it to all age group guests and always got nice feedback.It does not create mess like many cookies ( mcvitis) as its small in size guests do not hesitate in picking just one, kids pick up handful of it and enjoy.", "knockaround": " As I have told you before in other reviews that I have a sweet tooth. This cute little biscuits come with real sugar coating and they are crispy.So, crisp of biscuit and crisp of sugar creates an unique combination. It is really cool for passing time, in travel or night study or work sessions.It will keep your senses awake.best to have when you are bored. Bad thing about it is its little costly. It usually comes in a Rs.10 pack but the number of biscuits are not enough. So you end up sad when it is finished. The packet finishes like in mins.You dont get that satisfaction factor. It is that no one can eat just one types. Increase the quantity brittania guys. We love it.", "preetigupta5599": " This is one of the best biscuit snack I have eaten till date.its cute and sweet and pefectly baked to melt in your mouth along with sugar sprinkled topped on it.Its fulfilling and is best time pass snack to munch on.i have it as biscuit or dessert also after meals.you can make combinations of it with your favourite flavour of icecream as well.Its shape is so cute and so sweet I gift it to my lover as well as I find it quickly in any shop at just minimal amount of 5 to 10 rs.its perfect sweet gift for beginners in a relationship.quantity is also good and can quench your hunger.i have also tried it with whipped cream which was wow experience.really awesome product by britannia.", "tharunreddyguntur": " Little hearts is the best biscuits. The reason behind this is there is lot of sugar spread on the biscuits. these are the biscuits I always eat and me and my brother will be fighting for the same. they r really tasty and sweety. I can give top rating for these biscuits. there are little bit minus points. these biscuits have more fat when compared to others. but coming to taste they are sooooo good.moreover it is fdi certified as well.", "Bibhu1988": " I like Britannia little heart biscuit very much. My father brought it for me in my childhood. It is a very popular brand and a product of Britannia.Britannia is the best biscuit maker in India and serve quality products for more than a decade. I like the heart shape of this biscuit.I always break the heart from middle then eat it. The sugar coating placed between the heart tastes awesome. Little heart biscuit is moderate sweet and you feel the biscuit flavor with sweetness. This biscuit contain zero trans fat which is good for health. Little heart biscuit starts from RS 5 pack but I purchase RS 10 pack always. It contain 39 gm of little heart biscuit and around 20 biscuit in the pack.", "OnlyTruthSpeaker": " Britannia little hearts by britannia is really good for time pass while travelling. It simply melts by keeping it into the mouth a biscuit of its own flavour and own kind.I am enjoying the biscuit for first five years. Biscuit come with a very reasonable price which you can take either with tea and coffee as well as evening snacks time. My complete family likes it so much as compared to the other biscuits available. Do not forget to cross check the packaging while buying against any kind of air leak.", "mohsinmistry": " Britannia Little Hearts Biscuits is a very sweet taste biscuit with the little heart shape having some sugar in between it. I like the taste of this. Its crispy and sweet.But the quantity of this is little less according to me. There are nearly 8-10 biscuits in it. So I better ask them to increase the quantity of the biscuit. And there is no complain from my side for the quality. This biscuit I am eating since nearly 15 years.And till today they have maintain the quality of the biscuit and the taste of the biscuit same as it was 15 years ago. It just melts in mouth.", "niharharsora93": " Little Hearts are the famous biscuits among the children's and a unique shape and texture creates more demand . From my childhood, I have special love for this biscuit, I always buy this biscuits even today in large quantities so that I can keep 1 packet in my bag.Its heart shape attracts me and invites me to have it . The packing which they do attracts the people as the color and the design as they made is beautiful. If you see the biscuits are attractive and catchy plus this biscuits are so sweet and soft as if it goes in mouth it starts melting and also very light weighted and at very reasonable price, so that everyone can easily afford it.This is the first biscuit which are sold in packet like lays . This biscuits are generally favorite of all since childhood as they have maintained their consistency in this biscuits still, and it is very easily available in the shops . I would like to suggest this awesome Little Heart biscuits of Britannia to everyone to try once,  so I would like to rate 4 out of 5 .", "KATYUSHA": " I really do not like Britannia Little Heart Biscuits due to its absurd taste.Its hard to believe for me that Britannia has made this product! I feel  that this is a complete waste of Rs. 10. I even do not prefer to serve them to our guests or to the children.This is the only product of Britannia, which is not at all good.Although the packaging and rate of the product is good enough but its taste seems pathetic to me.So I do not buy them and give my negative review about it. It could be better for sure!", "abhishek372": " Little hearts biscuits from Britannia, I have been consuming since childhood .the hearts shaped biscuits with sugar coating biscuits  makes it extra special to eat, Every child o younger people just have little hearts just because of its heart shaped and more over for its delicious taste for sugar coating on top it, thatts what makes it different from rest of the biscuits available on market.The price tag on this is as low as  compared to rest biscuits, only 10rs for each packet.moreover the biscuits is very much high in  nutrients and ingredients used is very much checked and is not a all harmful for anybody, the calorie contained in the sugar is also less  .you  can have it anytime in a day with anything, but taste good when consumed solely .just have a bite if Britannia little hearts and give yourself a taste of real sugarfree biscuits.", "SoniyaP": " Little hearts are very tasty and unique biscuits of Britannia. First biscuit which are sold in packet like lays. Little hearts unique shape and taste is loved by all. Britannia makes quality product from years and same is continued.I was used to eat from my childhood and same I am continuing. Sweet biscuits with crushed sugar in between.  Price of Little heart biscuits is just 5rs. Any time one can eat and can carry while travelling. It is favorite for kids especially. Packaging is well designed and colorful.", "phatakamol7": " These are heart shaped cookies which are perfect for light snacks. Cute dark brown, sweet and perfectly backed cookies to melt in your mouth with sugar sprinkled on top of it.I am very much satisfied with the taste of cookies and its quality.They are like by people of all age groups, specially by kids. Little hearts gives you the best company when you are watching movies, travel, reading books with your friends and families or with your Coffee."}], {"sanjaylehra": " Britannia little Hearts is my favourite snack, its so sweet.These hearts shaped cookies iks perfect tea or cofee partner.its perfect light snack that is easy on the system.I just love its smell and taste.Maintaining is quality since so many years.Britannia has not overpriced this product.it is still reasonably priced and is available in packets of Rs.5, Rs.10 and Rs.20.The shape of biscuits is very  attractive.Even the packing is very good.No other company offer these kinds of biscuits.i like to have them with my morning and evening tea.Overall, it's not expensive, comes in small but sufficient quantity.it has great packaging and delicious biscuits.", "d_1481": " These cute biscuits are priced at Rs.10. Small packs of Rs. 5 are also available. I love the fact that Britannia has maintained the quality of their products throughout. So these biscuits are great as snacks with coffee or tea. It's a perfect light snack that is easy on the system and kids too love Little Hearts for the cute shapes and sweet taste. It's best for students as the price is so reasonable. It has a subtle vanilla flavor.Though it is not mentioned on the pack. It can be also as a garnish for ice-creams.", "msaloni124": " As I child, I always used to grab these tiny looking heart shaped biscuits for my snacks. My love for little heart is countless! The look of the cookie itself is so appealing.  I generally dont like sugary stuff.However little hearts are purely exceptional. Infact the sugar coating on the top of the cookie is what making the cookie more mouth watering. Till date, its been my favourite cookie as it is easily available and a good snacking option. It is quite budget friendly.However, as it contains loads of sugar, people suffering from diabetes or who are on weight loss should keep this at bay because of its high sugar content.", "debasreeblr": " These biscuits is melt in your mouth as soon as you put it in mouth.These heart shaped cookies is perfect tea or coffee  partner. Test  wise its not sweet not  salty just perfect for snacks item.The heart shaped cookies with little sugar on top make it more testy, delicious.Children are very much attractive by look, these heart shaped biscuit is always favorite among children . These biscuits are very crunchy not like  other heavy cookies so easily we can have it 6 to 10 pieces.Packing wise it's great small &amp; bigger size also available. Heart is the most sweetest part of our life so you can imagine when biscuits is like this shaped how sweet it is.", "bharatbvishwakarma": " Little Heart biscuits are awesome. It is very tasty. I used to eat Little Heart  biscuits at tea time. There was a very sweet flavour of this biscuit . Price is also normal. But now size of biscuits became smaller and smaller. But test is best. Sometimes, we got one bowl free withLittle Heart  biscuits. It was interesting to get bowl. I like Little Heart biscuits most.Whenever I am hungry I prefer eating it which would quench my hunger and fill my tummy.:) Rather than eatin unhygienic stuffs like vada pav.", "debamishra5": " I like to eat little heart biscuit. I generally eat this biscuit after dinner. I love the heart shape of the biscuit. I always eat single biscuit at a time. The packing of the biscuit is very good. The sugar coating between the heart tastes amazing.It is not highly sweet, gives moderate sweetness. Little heart biscuit has no trans fat which is good for body. I always purchase Rs.10 pack which offers 39 gm of biscuit. Little heart is a product from Britannia industries which is the best biscuit maker in India and serve qualitative products.", "bina2015": " Britannia Little hearts is my favourite evening snack.It is sweet, crunchy and delicious especially for those who have sweet tooth.No one can get bored of this biscuit anytime.Starting from childhood till now we all are lovers of little heart biscuit.One packet is enough for an evening snack as it is quite filling.Maintaining its quality since so many years, Britannia has not overpriced this product.It is still reasonably priced and is available in packets of Rs.5, Rs.10 and Rs.20 The shape of this biscuit is very attractive especially for kids and thy are tempted to much on it .If not tried one must try atleast once.", "rajiv22\n                             \r\n                        ": " Well basically I dont eat Little heart very often.  I just eat them as time pass when I am a tour visit and I share it with my mom and brother.  But my brother liked this a lot and he used to buy these very often.The Pack costs just about Rs.5 and there would about 10 pcs inside and each biscuit will be adhered to Sugars and honey.  So its tastes very sweet and yummy.  the biscuit is designed in heart shaped which is itself very attractive and this biscuit is very famous among young girls and ladies.  I have seen this biscuit packs in the hands of romantic couple.!   Very good manufacturing and marketing strategy by Britannia.But since sugar is harmful to health, I have stopped buying these biscuits any more or even any other product of Britannia biscuits except the Britannia wheat Rusk!Overall, Little Hearts are good to eat and are Taste.  But in reality, these \"hearts are bad for ur heart\"", "BornIntelligent": " I just love this little hearts biscuits since childhood. I still remember, during my school days, when I return home, I used to run to the bakery to get these biscuits which were sold at Rs. 5/- per packet.I will hide it from my brothers and neighbours and save the pack to eat it alone. I just love those biscuits which were totally different from normal biscuits.There is no too much of sugar or salt. Everything is limited and the taste, it's just WOW! Still whenever I go for shopping, I will make sure that I get this packet without forgetting. Thanks to Britannia. Of all the biscuits I have eaten, this one is the best next to Good day biscuits.", "anand_mana": " I love this little heart biscuit from years, as I told only the name of the biscuit is little heart but it makes happy to all big heart by its delicious taste.The little biscuit in heart shaped and the sugar sprinkled on it makes the biscuit taste awesome among all the biscuit .Every age people will love the taste of this biscuit.As Britannia is one the good brand I tried this biscuit and  love to suggest to all age guys to taste it.As there are no other biscuits in the market with this kind of taste in any of the biscuit brand .So if any one really wanna taste a good snacks time or time-pass or taste delicious biscuit then definitely they should taste little hearts at-least once and next time time will definitely buy the biscuit by themselves .Friends taste it atleast once in the life.", "Jeanlhamu": " I would call these little hearts a perfect snack time serve. They are cute little heart designed biscuits, sugared coated, glazed and golden baked.They are crunchy to eat. The flavour is is prefect, a great mixture of salt and sugar. It is neither too sweet nor to salty, just the perfect balance of both.It is due to this little sweet and somewhat salty mixture, that makes it a perfect snack rather than a biscuit. The best part is, you can get these little hearts in good quantity even in Rs. 5/-. These biscuits are tiny in size and easy to pop. A perfect snack time biscuit, loved by all.", "heart_twister": " I still remember we buying little hearts biscuits during our childhood and enjoying it slowly and steadily.This is a snack loved by everyone. No one would say a no if you offer someone little heart. I feel that little heart is very good when it comes to quality.The concept of this biscuit was awesome and its not easy to manufacture a product which has sugar coating and selling like hot cakes.The biscuit has sugar coating and the biscuit is crisp. If the biscuits turns soft there's no fun having it so don't let it get exposed to air.The packaging quality is good and there is enough air so that the biscuits don't get crushed!The biscuit tastes very good and its best enjoyed when its fresh. Don't store the biscuit for too long and that can spoil the taste.A biscuit of the previous decade still going strong!I would recommend everyone to try this biscuit! Highly recommended!", "awonibano": " Britannia's Little Hearts are like the most adorable hearts sealed and packed into a bright red packet. I received my very first packet of Little Hearts when I was in the third grade. This was a part of some promotional even by Britannia.The biscuits are very delightful, in the shape of hearts and sprinkled with Sugar. I was very fixated to these biscuits for a very long time and could have several packets back to back. Even now, I sometimes grab it for some quick hunger+taste resolutions.The design of the biscuits is very unique and it was one of the first ones to be packaged into an air packet, unlike other biscuits that are packed thoroughly. The cost is pretty cheap around 10 bucks. And these are certainly the cutest biscuits ever.", "pritiagarwal2111": " I still remember we buying little hearts biscuits during our childhood and enjoying it slowly and steadily.The shape of the small hearts is cute and attractive.  .The concept of this biscuit was awesome and its not easy to manufacture a product which has sugar coating and selling like hot cakes.The packaging quality is good and there is enough air so that the biscuits don't get crushed! The Pack costs just about Rs.5 and there would about 10 pcs inside the packet.No other company offers these kind of biscuits. I like to have them with my morning and evening tea.’Little hearts’ a product of Brittania is truly a winner of many hearts!Thanks!", "DRANILGUPTA": " A joy to serve.We love these little heart biscuits.Easily available in 39 grams @Rs10/- and smaller at Rs 5/-. The little heart designed biscuits are decorated so neatly, sugared coated, glazed and golden baked-crunchy to perfection.The flavour is divine. You can serve it with pride to your loving  family and friends.I also use them to decorate a cake especially  for my dear ones.If only the packs could weigh more. The biscuits are a little light weight and so  some  packs have a few broken pieces in them, yet a  pleasure to eat. ", "dsat_kut": " Whenever I see Little hearts the child in me jumps up and has to buy at least one packet. I am in love with Britannia Little Hearts since my childhood.I like the shape of these biscuits, they look really very cute and appealing. The sugar that is topped on each piece of the biscuits is what I like the most about these biscuits. These unique heart shaped and sugar topped on these biscuits make me love them more.Britannia is the most trusted brand in my family as they produce great biscuits that are always fun to eat with family. Little hearts as well is my family's favorite.This year on my bofriends birthday, I wanted make an innovative cake for him. So I decided to make a heart shape cake and on the top layer I had put Little hearts and he just loved my surprise.After this I can definitely say that from the whole lot of my favorite snacks, Little Hearts tops my list.", "sachin_wadekar100": " This biscuit is a heart in shape and this is very good to eat. it sprikled with sugar on it.The crunchiest ever and also crispy biscuits. This biscuits were made by britannia company which is leading in snacks.Their all products are really good and tasty. The little heart in one of the best.The quality they minting of this product is good . This biscuit is decorated so neatly, sugar coated, glazed and golden backed crunchy to make perfection.The packet of this biscuits is plastic pack and hardly coated with plastic.The biscuits are a little light weight and so some pack have a few broken pieces in them.The children are very much attractive by look, this heart shape biscuit is always favourite among children.The price is start from Rs.5 in a small pack.  Very good biscuits you can try it.", "skkedia": " I am very fond of Little hearts biscuits and whenever I am a bit hungry, I prefer them. Unlike other biscuits they dont come in packet form but comes in a pouch packing.Each biscuit is a heart shaped biscuit very light.It has a unique taste and has a sugary coating on it.The  top is caramelized and sugar is sprinkled over it which gives a unique taste. Infact the sugar coating on the top of the cookie is what making the cookie more mouth watering. Till date, its been my favourite cookie and a good snacking option.I like the shape of these biscuits, they look really very cute. The smell, the taste and particularly the  shape is also so amazing.", "tanaykochrekar": " Shortest Commodity Reviews: Britannia Little Hearts BiscuitsOften placed with the packed potato chips such as Lays, Kurkure, Balaji etc. with the price being likewise, these cute little hearts are always ill categorized and not placed with biscuits in any general grocery shop.These little hearts' batter is so light that it suits good for heart or diabetes patients, but the garnishing isn't. They are so sweet, plus are topped with sugar crystals which actually makes them look unhealthy.But I've always loved the Birtannia Little Hearts biscuits and always jumped for a share whenever someone opened a pack of it. So, if you are not a serious calorie conscious person, you can hog them without any worry!", "drjyotiphd12389": " I like Britannia little heart biscuits very much. It is awesome biscuits. It is a heart shaped biscuits with sugar sprinkled on it.It is really very crunchy and crispy biscuits. I just love it's smell and taste also. The biscuits has unique sweet and salty taste. The way it is shaped is really attractive.It is my all time favourite biscuits. It has a ideal tea time snacks. It's taste is not like ordinary biscuits, but it's taste is something different from other biscuits. It has a great combination of sugar and salt.Overall, it's not expensive, comes in small but sufficient quantity. It has great packaging and delicious biscuits."}], {"chaitanya_bhatia": " These sugar coated slightly sweet and slightly salty biscuits from Britannia have been my favorite biscuits since my childhood. The sugar coating on top makes it very crunchy which makes me have it time and again and at the same time it doesn't make tooo sweet for my liking . No other company offers these kind of biscuits.  I like to have them with my morning and evening tea.The best part is they are very easily available at every local  grocery shop at just Rs 10.", "sidholy": " 'Little hearts' a product of Britannia is truly a winner of many hearts! The best part about the biscuit is the shape! I love those small hearts they are very very cute and the sugar sprinkled over it imparts just the perfect sweetness to them!The packaging of Little hearts is very simple and cute again. The red and golden wrapper looks good! I always buy the 5 rs pack to gift my nephew! Its a very attractive, affordable and tasty product!", "varnit24": " I love these biscuits since my childhood, Such a yummy taste and quality and quantity is also nice.So many little little hearts, these hearts are very near to my heart. I use to have these biscuits once a week, anyhow.Classic flavor. Great packaging, comes in minimum pack of Rupees five. So, anyone can easily buy.One thing is quite amazing, the shapes of all the hearts and taste of all the hearts are similar.#just love it", "dimpleas": " This biscuits is not like other biscuits. It is different in taste and shape and size. Very tasty and crispy. Kids love its  sweet taste and also like the packet style. As my kids love it I usually carry 1 pack of \"Little Hearts\" in my purse. Kids always become hungry whenever you go out.So its my advise to all mother that just try this once your kid will love it and you don't worry because it is not harmful to your kids health like junk food.", "bellrings": " Britannia little hearts is best crunchy and sweet biscuit. It comes in packet and its available in various range. I have started eating Britannia biscuits from 2 years.  The quality is also nice.They are in the shape of hearts and its very crunchy and sugar is spread all over it. Its very yummy. The way it is shaped is really attractive. It attract people's towards it.I always eat little hearts of 5 rs packet. It is very good product and its one of my favourite biscuit. it is a affordable, tasty and doesn't cause any harm to health. Its is really worth of money.", "angels13": " Little Hearts. Just the name makes the heart dance. Such a lovely thing. Difficult to call it a biscuit. Seriously Guys. Wen I wsa child my dad used to make me buy it almost everyday. However, for sometime the supply reduced and we the lovers were heart broken.The  taste is awsum, neither it is too sweet nor oily. The light taste mskes us feel light and make our heart happy. The price is too perfect as per its quality and the richness. It was my all time favourite, it is my favourite and it shall be so forever. This is loved not only to be liked by children but also elders. I simply loveeee it.:-", "Ghazala786": " Britannia is a reputed brand and all its products are good. I simply love Britannia Little hear Biscuits, its awesome. Its a heart shaped biscuit with sugar sprinkled on it.Its very crunchy and simply melts in mouth, has a great taste. Ideal for tea time snacks, liked by all specially small kids.Price Rs 10 for 48gm pouch, thus not too expensive.", "Mouthopener1962": " Britannia in United KingdomI am purely an  I n d I a n  living in United Kingdom. I am a person very much rooted to Indian culture, I have loved britania not just because it is an Indian product but for its quality and taste. I quiet often talk to my wife and kids about the variety and the quality we have in India, which sadly we cannot find in the United Kingdom. I hope if this could be possible.I would only like to know from the concerned person to answer  to let me know if I can promote the taste of Britannia in United Kingdom for the people here to understand what India was and is all about when it comes to taste.I am a born business man. I had a complete network of dealers in Punjab, Himachal and Harayana dealing with domestic appliances with experience of almost 20 years.", "mira.gopal": " Britannia Little Hearts, name itself reminds of u of 2 lovers sitting in a park bench romancing and munching the biscuits from the packet. True to its name this biscuit is dearer to young and old alike. Take a packet of Little hearts to kids and you can see their wide grins and they lap up the package. When you have a little heart biscuit packet at home u can see everyone battling for getting 1 small heart. This biscuit is exchanged as a token of love in any form of relationship. Be it between friends, mom and child, grand child grand parents. Some how the shape of the biscuit a little heart creates a emotional bond between the giver and taker. Taste wise also it is great and can used easily as a snack. I would like to conclude this review by saying that if u want to gift something for a person for whom you really care take a packet of Little Hearts once in a while. It is lighter on your wallet and the reward is really great compared to the price spent .", "triloki1092": " Oh I love Britannia Little Hearts Biscuits so much. I can eat them everyday. I love their smell, I love their taste, I love their shape and I love their color. I love the way its top is caramelized and sugar is sprinkled over it.It always brings a smile to my face whenever I see its packet anywhere. It is from Britannia so there is no question of inferior quality or taste.Cons: Over the time I think they have decreased the amount of sprinkled sugar.I want the old ones back which were sweet and yummy.Verdict: Don't buy it, leave all the packets for me:)", "sakshigoyal58": " These biscuits I have been eating since my childhood.Biscuit with sugar coating and with pinch of salt make it different from others.Even many biscuits came in market with this combination. But no one beat This little heart.The sugar coating on top makes it very crunchy which makes me have it time and again and at the same time it doesn't make too sweet for my liking . It is my best companion  when I am hungry, and I am like some thing different I want.The best part is they are very easily available at every local  grocery shop at just Rs 10.", "ranjana86": " Have been having Little Hearts since childhood. Love the sweet&amp; salty taste it has. Whenever we used to go for picnics, Little Hearts biscuit packet was a must-take:)The shape of the small hearts is cute and attractive. Love the sprinkling of sugar over the biscuits.Why you should try itFor the cute shapes:)The crispiness of the biscuitFor the unique sweet-salty taste it hasif you have a small kid, he will love it:)very affordablegood packagingWhy you shouldnt try itif you dont like heart-shaped biscuits;)", "Kweldebs": " I am the kind of person who feels hungry throughout the day &amp; need to munch something. And I prefer biscuit for that. Well, there are many in the list but this time I shall pick up my ‘chotu dil’ … Yo, am talking about Britannia Little Hearts. My affair with chotu started since my school days. In-between chotu was missing for sometime. But thank to whoever – I am happy that chotu is back again :)These biscuits are small heart shaped with fine sugar sprinkled on it and is baked to give a special treat to taste bud. Just one bite &amp; it just melts inside the mouth. The sugar on top doesn’t make it too sweet but adds the special effect which makes one to say ‘le gaya dil – chotu dil’. Look wise this one is very different than the other ones. The top is having the brown lines with white in between. Another catch for this product is the packaging – the pouch pack, which was known specially for the wafers. The color combination of red &amp; golden on pouch is rather catchy. With those zigzag at both the end it is easy to open the pouch, reducing the chance of biscuit falling out.I remember seeing some other variants in-between, but never bothered to taste except the classic one. And right now I don’t even see the other variants on shelf.I prefer to grab chotu not with milk / tea/ coffee – but just like that. But I always nag for the very little quantity. The size of the biscuit being small, its fun to gulp the entire biscuit but then shortly I find my fingers moving freely inside the pouch! Darn! It is over :( Good to have while net browsing, watching television or movie at home, easy serving during guest visit or even just like that!Well, I was able to grab some gyaan on chotu too. This is Britannia product &amp; was launched during 1993 [Google result].Remember the advertisement - Kirmani giving his gloves to Parthiv after having Little Hearts and glad Parthiv kissing Kirmani’s forehead with the caption ‘dil actually sabka sweet hai’.*Ingredients:*Wheat flour, Sugar, Edible oils, Raising agents, Milk solids, Salt, Yeast, Emulsifier &amp; ImproversNutrition Information [for 100 g product]:Carbohydrates – 71 gmProtein – 7 gmFat – 18 gmEnergy – 474 kcal [but who cares!]With traces of vitamins &amp; minerals[Ingredient &amp; Nutrition Information courtesy – Little Hearts pouch]Just go grab a packet of chotu dil &amp; prove your dil is sweet too!", "swtneha31": " I am a foodie and I like to try different varieties of food all the time.I still remember when I was a kid from school, I used to get 2 rs from my parents everyday for chocolate or candies or any kind of outside food that I desired to have.That time Britannia little hearts was one of my favorite and its one packet came for 5 rs.I used to save my money and every Friday I used to buy one packet of little hearts.I used to love that biscuit a lot. Its sweet taste of sugar mixed with the crunchiness of this wonderful biscuit increased its taste very much. I never used to share thus biscuit with my friends as it was very very tempting.Today also whenever I go for my household shopping at bigbazar I cannot help myself from not picking up at least 8 to 10 packets.Anyone who has not tried this biscuit yet I strongly recommend you to try once. Its awesome.", "lalita79460": " Britannia Little Heart is truly a winner of heart from 6 months to plus sixty year olds.  Little hearts carved out of pastry dough, baked to perfection and that oooooooooohhh sprinkling of sugar, is a sure gastronomical delight.  The claim made by Britannia holds good \"the biscuit truly melts in your mouth\".Whenever you feel the urge to nibble can just take out a cute red and gold pack of little heart and can munch to your heart's content.  Hmmmmm very very tasty tasty ..... no it is not fifty fifty but our little heart making direct connection dil se.....So from now on jo chahe ho jaye Little Hearts  enjoy....... whenever u feel like a quick snack just open a pouch pack of little heart biscuit, take out the heart shaped biscuits, one by one.  Munch the crunchy little hearts to your hearts content.It is said during one of the surveys one very elderly lady has claimed to be in Love with Little Hearts.Actually anybody can easily fall in love with this product.", "pankajparihar08": " I used to eat this in my school from buying it from my school canteen. Little hearts are little biscuits( well not biscuits, . Small crispy things) with light sweet taste and the crispiness and so small sugar cubes on it. They are not oily.and so tasty. Best biscuit of Britannia till now.I like the shape of it too, the little hearts. Me and my brother had always fight for this. Well I always ate this and didn't gave to brother:PThe packet of little hearts is of just Rs 10. So reasonable. As compared to other similar products in market, and they too are not so good. Product packaging is good. I like the big heart on package, and its written little hearts on it.", "Addy_Ahmed": " More than its taste I like its shape. You must have heard about \"First impression is last impression\" and \"The way you serve food matters a lot\". These things are totally applied for this biscuit. Yes. I agree that its taste is quite good but not more than its shape.The way they have shaped it, attracts a lot. Kids usually more focus on such kind of things than its taste. And Once kids started liking your brand you are going to a lot of money. Its a very nice and easy way to run your Business. Because even parents can't deal with little kids. The awesome creativity. lovely shape &lt;3", "Aniket22": " Britannia Little Hearts Biscuit IS a good enjoyable snack from Britannia. They come in shape of a heart and are sweet to taste They dont taste like ordinary Biscuits but taste something different yet tasty;)The only corn is that due to to rich quality of product you get a very little quantity of Biscuits", "mailmesurabhi": " Britannia Little Hearts biscuits are good in taste and crispy. I was very much satisfied with the taste of biscuits and its quality. Britannia Little Hearts has been unique in two sense one was packing and second was size small heart shaped biscuit coated with sugar.It melts in your mouth and you get its awesome taste.It has two variants called Little Hearts Chocolate and Little Hearts Sesame.", "naavisrock": " I like this crunchy munchy little hearts from my childhood. I like this biscuits more than chocolates or any candy, lollipops or an Chips.My favorite time pass in childhood reading story books and enjoying these crunchy munchy little hearts.They are little salty, little sweet in taste very crunchy. Nice to eat, I enjoy them today also, favorite snack for me any time, while with tea or while in traveling or picnic, I like to eat them.The packaging of these crunchy biscuits are also very bright and nice. Its not expensive comes in small but sufficient quantity. I can go for it anytime."}], {"mohanR": " The first thing you notice when you buy a Little Hearts packet is that it's light.Infact it is so light you might think it contains nothing.You take apart the seal and there it is.So many hearts which are all so delicious.The heart-shaped biscuit fits into the palm of the hand.The upper surface of the biscuit has the relief of a smaller heart carved on it.To the touch,the food item seems to stimulate the taste buds.Infact,it is slippery and buttery to the feel.And though the thing looks great one is tempted to put the biscuit into the mouth.Due to the oily feeling,you feel a little strange at first.But thereafter its paradise.Its sugar-coated and filled with sweetness.The thing melts in the mouth and you don't even have to chew it.And once you have had one,you want more and more till you have done with the whole packet.The biscuit has a luxurious feeling to it like say,tandoori chicken.It is the uncrowned king of the indian biscuit world.", "gh12": " I live in Canada I like to try different products to findout how good and healthy they are for you.I will keep my on Britannia Little Hearts Biscuits here inCanada.Does anyone know if they are cookie or a biscuit you havewith tea or coffee.I like to have either a cookie or biscuit or a doughnutwith my coffee or tea.When it comes to cookies and biscuits i'm like the cookiemonster so you better watch out.The best biscuit I've tried, well to me their is no bestbiscuit,a cookie is a cookie unless it's homemade.And if thats the case, well you better watch out, here Icome.", "sweetguy": " Hey all YOU people out here at MS....Its me back again...well just took a short break from MS...but tell you I really missed MS since it was getting itself upgraded..any way....This time I'm trying to write some thing on the topic which is one of the basic necessity of the life form..yes you hit the bulls eye..its ''FOOD''..and the topic is about ''BRITANNIA LITTLE HEARTS''.Manufactured by Britannia Industries which are the largest manufacturers of Food Products...this little hearts have won millions of hearts everywhere.....This Biscuits come in small heart shape with a tinge of sugar sprinkled over it...the moment you open the packet, your nose catches the lingering sweet smell of fresh biscuits and your hand reaches into the pouch and then you find yourself munching the small tiny hearts with pleasure and definately enjoying the blend of sweetness with a perfection...I dont know the ingredients because the moment I used to buy this pouch ,the next moment I found myself enjoying it..so folks you will have to take the trouble of buying a pouch and going through the nitigrities.....The pouch comes in two packings of Rs 10/- And Rs 5/-.So just try this superb product and enjoy the taste of this Heart with Love..Now you can enjoy these sweet little hearts anywhere like either a movie with your sweetheart, or by the seaside on the beach,or travelling in a bus or train or your own Car,or at home watching the TV,or In the college canteen,or walking along the roadside.......Hope you guys will definately enjoy this product....Cheers.!!!!!!PS:- I wish I could give you the details about this product but never thought about in detail while eating since got too busy just in eating this sweet hearts......", "vkmohan": " Britannia deserves a Hats Off standing ovation for their yet another winner in Little Hearts. As they themselves claim, ''They just melt in your mouth'', very truly they indeed do... Hearts, how I wish all the hearts too could have been so chchcweeeet!!!  The pack containing ample for one though, still seems a lil too less. I bet you have one, you will long for another one or two for sure. Lightly sprayed sugar coating on them makes the taste buds respond in affirmative the moment one puts them in mouth, and the texture and the little hearts are manufactured to such a finesse that they just simply melt in one's mouth, giving a momentary Nirvana!!! I experienced it, and I recommend it to everyone. A bad bad miss for the diabetics, though!!!", "madlalya": " My very first recollections of a production unit was when I used to visit my father in his company, Britannia Industries Ltd., at Reay Road, Mumbai. That was in the latter part of the seventies. Ever since, Britannia has held an important place in my memory. After working there for 23 years, my father joined a biscuit company in Africa and recently retired after 24 years of service there. So, his cumulative experience as an engineer in the biscuit industry is of 47 years. Ask him which he thinks is the most ingenious biscuit he has ever seen, and he says- Little Hearts.I believe him!", "Mortal": " Britannia Little Hearts Biscuits ..i never thought I would write a review about something I love this much...how much...lets say...love doesnt have a scale..it does melt in ur mouth as the ad says...though takes a bit longer time that a first timer would expect..but it does make u feel sweet..atleast ur mouth...something u can definitely munch on...not sure its the right word ....when u r with ur friends and loved ones..and its something which is really different from other biscuits we all eat...same old shapes..and same old flavours...this offers u something different..the shape..yes..but most of all the taste...u dont need to go for cream biscuits with all those artificial flavours ....its something pure...sugar...sweet...and yet '' jara hat ke ''...not a bad idea to pick up a packet or two when u r with ur date...or even when u r with ur friends.... adds to the live moments...and sure...make ur mouth water for more..U will get this at almost any shop which sells biscuits.. and one reason is that it sells like hot cakes... costs on 10rs.. not expensive and yet so delightful to eat..so go for it pals..", "703017997": " This message is for the Management of Britannia... The series of biscuits and types of flavours that the Company launches is fantastic.... The only problem that I face at times.. is non- availibility of Little Hearts.. at various vendors.. I am a big fan of this series of biscuits.. but whenever I inquire about Little Hearts is that the Company has stopped manufacturing the brand.......I find it very difficult to locate the biscuits......Would appreciate if this could be taken a proper feedback and implemented as well. All the series of biscuits... like Marie Gold, Good Day and Little Hearts etc....are too good!!!!! I would also like to say that in Comparison to other brands.. the prices are competitive and quality is excellent... I think the Management should concentrate more on the Supply Chain Services have to be streamlined a lot because a lot of times...Customers are at the receiving end if they do not get the the required brands in Britannia.The Vendors blame the Suppliers and inturn they blame the Wholesalers which is a continous and unresolved query.. specially in New Delhi... parts of West Delhi..Thanks for your time to read through this.....A valuable Customer..."}]