[[[[[{"Subha_89": " Oreo is my favorite cream biscuit of all. Oreo is a product of Cadbury and maximum of Cadbury product is yummy. You can find many type Oreo biscuit packet available in market. Starting from a small pack of rs. 10 to normal packet of rs. 35(150 gm).Oreo is basically sandwich type biscuit where u will get chocolaty wafer outside and middle layer is of cream. The cream has many flavor like vanilla(it was launched first) now  it has many flavor like orange, strawberry etc.  It also have others flavors to but those are not present in our country.To taste the best of Oreo you should try this with milk. Normally it tastes fantastic but with Milk it is fabulous. No other  cream biscuit tastes as good as Cadbury Oreo.", "SumitMishra813": " Oreo is the best among the chocolate cream biscuits. Iam using it since a long time and its just yummy I cant stop while eating them. Pure chocolate cream biscuits they are.Quality wise the product is best.comes in all small and large packagings just one issue is that they are very costly I wish they should decrease the prices of the product so that each and every person can easily buy them otherwise the biscuits are not for middle class people, for 4-5 cookies we have to give 20 bucks which is costly in comparison wid other biscuits otherwise taste wise the biscuits are best.", "ravinderwadhwa": " Today I am going to tell you aboyt harmfull effects of oreo biscuits on your health although these biscuits have an amazing taste but they are extremely harmful to your health the cream in them has preservatives in dem which do not provide you nutrition of milk at all moreover the cream is not fresh and dont know for how much long it had been made chocolate in them will stick to your teeth and cause tooth decay they provide you with lot of harmful calories and sugar dt adversely affect your healthI used 2 lyk dese biscuits a lot but when my family dr told me abt dem I stop eating them from dt day onlythe adds which show creamy provides nutrition of milk is just not real spending 10 rs on a small packet and adversely affecting your health is not goodparents usually buy their children these biscuits I believe if u care abt your child dont give it 2 them instead give him/her a glass of milk and in rare cases mix sm chocolate component in themI hope guyz this review was usefullthank you", "thrishalini": " Oreos are amazing . They have a kind of salty taste to the biscuit but the icing sugar middle makes them really sweet . They are far too moreish and have fast become my favourite cookie . They are nice crumbled and added to top yogourts .I was very happy with this quality . They tasted a lot fresher than other and I am really happy I got these instead of others as they are definitely better . These are very addictive, only problem is, I could finish all of it in one day . The whole family to put it loveably just love it . Highly recommended .", "vivekkumar312": " Oreo Cookies  is the worst and bakwaas biscuits that I have ever tasted. Actually, I am fond on cookies and one day my mom's friend bring this. It was my first time and after first bite it was just like hell. Very bad taste. Even my younger brother didn't like it.At same price you will get better cream biscuits and more tastier than that. I would never recommend Oreo Cookies to anyone! Although, it comes in good look but its taste is really inadmissible. I dislike the product and alternate I would recommend Britannia as best.", "atharkhan": " Oreo cookies are best cookies for everyone I m happy with this product. It is good blck biscuits. Good to eat and special biscuits for everyone. This biscuits are special biscuits for each and every person. This biscuits are black in colors and white in creamI know about this cookies coz I eat it everyday.good to eat and delicious for everyone. Tasteful to eat and delicious for everyone. This is good for everyone to eat. Its favorite of each and every person.I always refer to childrens to eat this type of biscuits. It is delicious and tasteful for everyone once you eat it then you realize how tasteful it is. So eat it guyzz and see the taste", "skmusa143": " Oreos are stunning . They have a sort of salty taste to the bread however the icing sugar center makes them truly sweet . They are unreasonably moreish and have quick turned into my most loved treat . They are pleasant disintegrated and added to beat yogourts .I was exceptionally content with this quality . They tasted a great deal fresher than other and I am truly glad I got these rather than others as they are unquestionably better . These are extremely addictive, just issue is, I could complete every last bit of it in one day . The entire family to put it loveably simply cherish it . Exceptionally suggested .I want to have these treats a considerable measure . I will never miss an opportunity to have these treats . I like its flavor a great deal .this treats accompany a blue spread pressing.", "nayaln801": " Oreo is the worst cream biscuit actually!It tastes horrible and I wonder why it categorized in Biscuits? It must be in bitter things category.It is too bad in taste that once you have it you feel strange bitterness in your mouth.I do not understand why kids love to have it while it has nothing to like.Its not chocolaty and not even as dark chocolate flavor,it is something different and that is Rubbish.Yuk Oreo!", "Rameesplt": " Oreo cookies first came with a cream filling embedded between two chocolate cookies. Now it has a variety of items like Oreo golden cookies, banana split Oreo, triple double Oreo, cool mint cream Oreo etc. Each of them has a different taste but a taste that I will never forget. I'm a Oreo lover because the cookies are too good.We can have it with a tea or simply eat it alone. Every one like this chocolate filled cookies. I like to pull oreos apart before eating them. No doubt why Oreo became the worlds best selling cookie for a long time. I like Oreo vanilla and I often purchase it.", "krishnenduopt": " This is very testy and nice cookies. Its available worldwide. It helps a lot when so much busy. When you not getting time for lunch or breakfast. Also with tea.Atleast have something. Morning time when go to school or tution it helos a lot when I am hungry. In my job while I am busy a lot, some times npt getting time for lunch so its helps me a lot  to kill hunger.Test is very nice.Love it", "Faizan_Firdous": " Well I will say something about these oreo cookies.I have a good experience.These are just awesome.I have tasted each and every flavour of this and its so tasty and delicious.The more I eat.The more I want it.I have it everytime and everyone in my family loves eating this.I have got a stock for almost 15 days beacause I often eat 2 or 3 twice a day .So its better for me to get a stock.So that I dont have to go outside daily.Well one of my cousin lives outside india.When he came here .He is also mad about this.He was not able to eat there daily because most of the flavours were not available there and even it was much more costly than India.So what he did was amazing.He taked a stock with a  guoto of so many cookies of every flavour and take with him when he was back.So just like me he is also fond of this oreo cookies.Its just lovely to eat and that too not costly.So guys have fun and taste this.This is a very tasty and good product.", "tbiswas31": " This is very good product and I love it very much. When I used it first time I was confused for it. But after use it I can say that it is realy good product that you can use it. Personaly I love it. Some negative feedback I get from other but you can ignore it. Just you go for it. If you don't use it just you can try for it. After useing it you will be like this that is my thought. It is my personal exparience on this product.So you just go for it. You will be also love it.", "krupakiran": " Oreo Cookies: soooo good.I purchased four bundles of these Oreo treats to dunk in chocolate and they were a colossal hit. The mint flavor is an extraordinary treat I can just discover around Christmas. It has a decent, thick green mint filling .I didn't purchase twofold stuffed, it's simply the standard size treat sandwiched inside the Oreo treat we all know and love. Together, they are the ideal accomplices. Incredible all alone, however astounding with chocolate. Haven't seen these treats in a while in my city. They truly used to be my top choice. I more often than not abhor the icing amidst the treat. The fudge blocked away the taste. Ideally I can discover some cause they're superb and simply great", "suma12": " I bought one pack of oreo  cookies and I must say I was very disappointed .I was hosting a superbowl I gathering at my house and when I went to pursue here. I have an idea for you. I think you should take the oreo thin cookies part fill it with double stuffed frosting, for those who enjoy the frosting but still. I'm just sending some words of kindness.I have 2 boys with autism and they love tere  oreo cookies, dad is not aloud to buy any other products, they no the.can you make a lemon cookie with golden cookie that would be yummy a lemon cookie", "rutva0212": " My kids have not been eating these Oreo biscuits as they are too dark and they find it kind of bitter, this is when a friend suggested this brilliant idea of making a cake out of this biscuits. At first, I was confused as to what she was saying, however when I tried it, the results seem to have turned awesome! All of us have liked it so much and a pack of about 20-25 biscuits, were gulped easily at one go!Unlike other cake preparations, this does not require much stuff and it is very easy and quick to make it. You won't believe but you should have your cake done in say about 10 mins.Here is what you need: about 20 Oreo biscuits, 1 cup milk, 1 Tsp  baking powder, 5 Tsp powdered sugar and oil for greasing - that's it.How? First, blend the Oreo biscuits with it's cream in a mixer into a smooth powder. Then, combine the Oreo biscuits mixture, milk, sugar and baking powder into a deep bowl and stir/mix well to form a batter. Pour this mixture in a microwave safe baking bowl greased with oil and keep it in microwave for 3-4 minutes.After about 4-5 mins, test if the cake is baked well, by inserting a toothpick, if it comes out clean than the cake is ready otherwise microwave it for another 1-2 minutes. Take it out, let it cool and there.ready to be served.If you want, you can decorate this with various creams etc to make it more presentable.No oven? Never mind, this cake can also be made in a cooker. Take the cooker pour water till 1 inch and immerse a stand which is about 1 inch.Remove the whistle and cook, the batter mix prepared earlier for about 30 minutes.Make it to believe it!", "kettanm": " I saw the new Strawberry cream Oreo yesterday in the store, purchased it immediately and I must say that I have already become a huge huge fan of it! The taste is heavenly!The classic chocolate cookie crunch can never go wrong and the delicious strawberry cream between them takes the joy to a whole new level! I love opening the biscuit and eating just the cream as well! another way to enjoy it is by dunking it in cold milk! This biscuit is totally worth its price! I love them more than any other cream biscuit! they are expensive but super yummy!", "The_Review": " What a horrid burnt taste! Ordinarily I just love Oreos. I usually end up eating it the way shown in the adverts. So, when I came upon this product, I didn't think twice. I bought a pack and swiftly took it home to share it with my kids!But, what a surprise. The biscuit tastes the same, but the cream! Double yuck!I called their customer service and complained about this. After all, I really do enjoy the other flavors. The lady told me to keep the pack safe so that it could be collected by their customer service staff.The pack has been sitting safely for the last few weeks now! No feedback!Shame on Oreo for producing and delivering such a sub-standard product!And, Kudos to the customer service people. You people are earning salary for doing absolutely nothing!", "ArihantSethi": " Oreo cookies are very very chocolaty, though kids are most likely to eat it even adults enjoy it to the core. In my opinion it is slightly over priced but still I like it very much. From within the cookies have white creamy chocolate and the biscuit are chocolate flavoured.The biscuit is very crisp. The packet comes in bluish white color and the cookies are pure veg, great quality. Once if you taste these cookies you wouldn't think of any other cookies. It is multi flavoured as the biscuit is chocolate and within the cream is vanilla flavoured.", "yashdip25": " I don't know when I fell in love with Oreo. My experience with Oreo is just awesome. I eat it as a sweet after my dinner. After my Dinner I literally crave for Oreo. The taste of Oreo is very very good. Chocolate flavour is also good but I like plain flavoured biscuits. I daily eat a small pack of biscuits. It is not overpriced also. I like its taste very much. Quality is very good. My overall experience is very very good with Oreo.", "devmandal100": " Today I am going to share my excellent experience on oreo biscuits, the taste of this biscuits is totally different compare than other brand guys seriously I love this biscuits with Milk when we dip the biscuits pair in milk and wet biscuit put in your mouth you will go crazy with the taste of dual milk and chocolate I love it.I always prefer with milk and after dinner just for taste this biscuits awesome,Thanks"}], {"rajucoolify": " I love oreo. it cost us only 35 rs. it is so mouth watering and delicious. Its kinda sandwich. Two cookies in between dark chocolate.its taste so much better than other cookies because it does not contains maida in it, .which is not good for some people. and this cookies get digested very quickly.I also like Britannia digestive Marie. It contains husk which is good for bowel movements. children less than 3 years should not be given this cookie because it can choke them and for some childs chocolate does not go well. and elderly people also should stay out of it because it contains milk and lots of fat .Due to that it becomes tougher to digest.teenager can eat it without worrying too much . I also give this cookies packets to small children near our home they just love it.", "dasck27": " 'Oreo Cookies' is one of my most favorite cookie. This is the best chocolate cookie in the market. It's taste is much better than other brand cookies available in the market. I have eaten many chocolaty cream cookies from brands like Britannia, Parle, Anmol, and many others but I feel Oreo has something different from this all.Its cream is pure dark chocolate and cookie is crispy too which gives you a great crunchy taste.Best way to taste this cookie is by dipping it with pure milk. It becomes more tastier when taken with milk.I love this cookie.!TRY THIS.! I AM SURE THAT IT WILL BE YOUR FAVORITE TOO!:)", "0000sudhanshusingh": " Now I am going to give review of Oreo cookies.the Oreo cookies is like a chocolate flavour. The taste of Oreo cookies is very good.the cover of the Oreo cookies is the thing that I was brought first time but I was eaten the cookie that is very yummy and testy.The good thing about that cookies is it's creams. The creams of that cookies is vary good .the price is also in range.the most important thing for this cookies is very good quality of cookies made. So many of time I am used this Oreo cookies and I suggest my friends to use this cookies seriously it is very good cookies in very good price", "umardaraz": " Oreo has been and will dependably be my most loved treats. The kind of the vanilla oreos is special and the treat is super new and crunchy.  The crème is delightful also. They come in just a couple flavors in India in any case, amid my excursion to the US, I was welcomed with more than 40 new flavors that I attempted. In this way, vanilla and chocolate are my most loved flavors. I do trust that Cadbury concocts more current variants of Oreo such as they have in different nations.I feel that Oreo treats are astounding. They have a novel taste. Super crunchy on the outside yet liquefy in your mouth too. The crème is delectable and super wonderful. I prescribe getting these for a gathering or in the event that you have children over for play tim", "bikarsingh8": " I like Oreo biscuits so much. These are so tasty. These are my favourite biscuits.I like most strawberry flavour cream. Oreo available in many flavor vanilla strawberry chocolate.The best quality of these biscuits we can eat these biscuits.Alone without tea. Its flavour is amazing and yummy . We cannot stop eating till finish it.", "Gfatima": " Ore cookies are extremely delectable, both the rolls and the creme. I like the first flavor the most the vanilla creme one. The orange enhanced scones doesn't taste great they more likely than not changed the essence of the batter as indicated by the orange creme. The chocolate ones are likewise great yet not that much as the first oreo.Oreo improves on the off chance that you Twist, Lick and Dunk it and have it alongside milk. The surface of the scones is great furthermore it is much milder and the creme is simply immaculate in taste.Oreo is justified regardless of each penny spent.", "asdfgh786": " I choose Oreos not only because they are india's favorite cookie, and highly palatable to rats, but also because products containing high amounts of fat and sugar are heavily marketed in communities with lower socioeconomic statuses.but previously moms magic attracted very much after oreos comes into market that was slowly reduced because of good taste.mostly all children prefer to eat oreos as a part of thier snacks and elders took this also as apart of snack.", "karanparmarkp5595": " Oreo cookie. The creme in these cookies is so dark that the cookie looks like it’s made with three chocolate wafers.These cookies are so dark that I’m afraid to eat these outside at night because if I drop one, I don’t think I can find it before the five second rule goes into effect. The cookies are so dark that I’m surprised they’re not a Sith Lord named Darth Atter.", "AmandeepKaur125": " Oreo cookies first time made in America, now it is available in every country. It is the first choice in cookies of every age person.Oreo cookies are too much tasty. There are available in many flavours. It is two cookies with the cream between them.Oreo cookies have available in vanilla cream, choco cream and strawberry cream flavours etc. All flavours are delicious.Oreo cookies are not much costly.its prices are very genuine according to its quality. It is excellent in quality.Its packing is very good in a colourful way. It is very attractive in looks. It is favorite of everyone. Whuch peoples are not try it go for it. You will definitely like it. Excellent and trustworthy product.", "annmaryittiachan95": " I love oreo cookies, omg! These are too tasty. I used to try variety of food forms using this like oreo shakes, oreo cakes, oreo pudding etc. I love it, my family love it.Definitely you will love it. It is filled with chocolate, cream. Creams like almond toasted, vanila, straw berry etc are available. It's a quality product because I used to keep it for days and still it's fresh. Also it's beautifully packed and preserved. Please try these biscuits, it's really tasty!", "imranshekh": " Oreo cookies are very delicious, both the biscuits and the creme. I like the original flavor the most the vanilla creme one.The orange flavored biscuits doesn’t taste good they must have changed the taste of the dough according to the orange creme.The chocolate ones are also good but not that much as the original oreo. Oreo does feels better if you Twist, Lick and Dunk it and have it along with milk. The texture of the biscuits is very good and also it is much softer and the creme is just perfect in taste. Oreo is worth every penny spent", "DikShantVerma": " I don't like to eat biscuits but when I tasted oreo cookies I became a fan of it.it is so delicious in taste with vanilla flavoured cream in it. It is very chocolaty and soft to eat.Packaging of this cookie has been very nice biscuits are covered with another plastic shell which gives us all full piece biscuits. Oreo cookies has many varieties but I like chocolate vanilla most. These cookies are very crunchy and biscuits are well designed. Everyone should try oreo cookies once. Its flavour will make you eat more and more.", "arunmvt": " Oreo is a sandwich cookie consisting of two chocolate wafers with a sweet creme filling in between.The world's favorite cookie.Delicious and full of Wonder for over 100 year. In addition to their traditional design of two chocolate wafers separated by a cream filling, Oreo cookies have been produced in many different varieties since they were first introduced.some of them are Chocolate Oreo, Oreo Thins, Mini Oreo, Birthday Cake Oreo cookies, Gingerbread Oreo cookies, Lemon Twist Oreo cookies, Neapolitan Oreo cookies, Key Lime Pie limited, Root Beer Float limited, Red Velvet Oreo limited edition etc", "kalariamanisha": " Oreo cookies are very popular &amp; first choice of any child.Oreo a cadbury product is most sold chocolate biscuit in year 2015.Oreo is good combination of chocolaty biscuit with vanilla cream sandwiched between 2 biscuits.Also the price is very normal as compared to oreo quality &amp; quantity cadbury company provides.Nowadays oreo cookies are famous at milkshake centres.I also make oreo milkshake daily for my son.Oreo has maintained its quality till now since it was launched in market.Very nice &amp; preferable biscuit at anytime with simply cold milk.Now it has been manufacturing various new flavours like strawberry, orange &amp; roasted almond etc.", "sup3rg4mer": " Ore cookies are very delicious, both the biscuits and the creme. I like the original flavor the most the vanilla creme one.The orange flavored biscuits doesn't taste good they must have changed the taste of the dough according to the orange creme.The chocolate ones are also good but not that much as the original oreo.Oreo does feels better if you Twist,  Lick and Dunk it and have it along with milk.The texture of the biscuits is very good and also it is much softer and the creme is just perfect in taste.Oreo is worth every penny spent", "viswanath22": " I love to have these cookies a lot . I will never miss a chance to have these cookies . I like its flavour a lot . This cookies come with a blue cover packing around the cookies it is a plastic coverThese are available for different costs like 10 , 15 , 30 etc rupeesAnd there are many flavours in it I like the vanila flavour the mostI suggest these cookies to every one .", "vipullatka": " These are the best cookies ever I have east. Since 2013 I am eating regularly. Not a single day is missed. Even my family members love to eat Oreo.These are so chocolaty, yummy delicious. Just put one piece of oreo in mouth and it just disappears .I l like it's sweet taste very much. I recommend everyone to eat Oreo.it's flavour is very good."}], {"jinalthakkar49": " Vanilla and chocolate has been a wonderful combination ever.This combination is mixed in these biscuits. Outer layer is a wonderful crunchy dark chocolate biscuit.Inside is the surprise of the vanilla cream. Overall the product has a great taste. Nutrient value is not so good but as always, taste wins over the nutrient value.Now-a-days, it has come into different flavours as well but this classic combination always works for me.", "abidsiddiqui": " It is a milk type biscuit most biscuit are cream biscuit but oreo cookie is a one of good taste biscuit I think Oreo cookies is to much yummy one time I packed oreo biscuit and I gift my small sister when she see the biscuit she will to much happy .I think when we buy oreo cookie small boys and girls very happy its to good area is a best company of biscuit.", "Zeeshan123": " Oreo biscuits are best tasting biscuits till date .When I first had oreo for the first time with milk it tasted so delicious .I like the cream too.They are a little bit costly though .But they are  worth money.I would suggest you guys to try them with milk, they taste so dope .", "Aman99deep": " I was hanging out with friends.We all want some snacks and biscuits to eat in the odd times of the day. I also need to eat something to satisfy my tummy. I got impressed from the advertisements and it compelled me to try oreo . The advertisement is so cute, by a little girl, pehle twist karo, phr lick karo . I love it. Okay, coming back to the oreo biscuit I would say it's taste is really nice.It comes in different flavours but I tried the variance of chocolate and vanilla because chocolate is always favorite . It gives some chocolately flavour with cream inside. The taste feels good once it enters in mouth. The packaging is also very nice and appealing. Twisted from the bases, the creme might be little disappointing but when eaten together with the exceptionally crunchy Cocos biscuit, the filling transform to a very tasty one . No more feeling of disappointment and incredible taste of cream along with the biscuit. The biscuit is so dark and chocolaty . The price are also very reasonable and affordable. its best in taste. Just try it once u will like it too.", "gilluchats": " I want to share some thing regarding yummy oreo, we love to have oreo, my kid take it with milk, he take it school along with his lunch box his friends also liked it.Me and my husband use to take it with tea it is nice in taste. on ocation of diwali we gave as gift to my relatives they also liked flavour of oreo most of them says choclate flavour is very nice.It is so yummmy, some of my friends told me they are so crispe, my husband take it to office he liked it and he says give me my sweet dish OREO. it so yummieee I m unable to control my self after eating one oreo cookies. it is yummmmieee.OREO we love you.my whole family is fan of you.", "nikm18711": " From childhood I have being having many choclate cookies but now the cookies have came for which I was waiting from childhood.Oreo cookies the best cookies I have ever had in my life the crispy choclate cookies and the vanilla cream inside into between the two choclate cookies which makes it much better cookies.Now oreo has making and adding more flavours to it which will make the product much more better and good.", "stylishvishal2": " Oreo is one of the tastiest cream biscuit ever made. everyone in my family loves oreo biscuit no matter what age are the all love the oreo biscuit. now the oreo also available in the chocolate flavour apart from the vanilla and also the combination of chocolate and vanilla.I love the vanilla flavour of the biscuit with the perfect quality of the cream and the biscuit. the cost is quite expensive but the cost does not defines when it comes to the taste of the oreo and also now announcing the different fruit flavours such as strawberry, orange, apple and pineapple which is likely to release in the coming january 2016 eagerly waiting to taste new flavours of the biscuits.", "shailey123": " Oreo biscuits are yummy biscuits which are available in market since long time.Features:Vanilla cream is sandwiched b/w rich Chocolaty biscuits.Tastes really yummyCost effective. 50g packet costs for 10INR.Packing is attractive with white and sky blue with ribbons of milk. Moisture proof packing.I have tried two Oreo recipes.like Oreo milk shake and Oreo brownie.These biscuits taste good with milk and coffee.Suits for all the age groups except for diabeticsBe sure that after consumption of these biscuits, kids rinse their mouth because it sticks to the teeth.", "rachna20001231": " Actually good. I had one and two and so on.Dark chocolate and soft middle. yumm. Tasty combination of crispy and soft sandwich kind of snacks. Then I was exposed to the fact that why kids love these cookies.Value for money and good availability reach till end customer .and I can remember the advertisement of ranbeer kapoor and little sister. which tells to be a friendly snack to elders and juniors both. Seriously like and priceless to enjoy", "samiaarshan": " Oreo has been and will always be my favorite cookies. The flavor of the vanilla oreos is unique and the cookie is super fresh and crunchy.The crème is delicious as well. They come in only a few flavors in India however, during my trip to the US, I was greeted with over 40 new flavors that I tried. So far, vanilla and chocolate are my favorite flavors. I do hope that Cadbury comes up with newer versions of Oreo like they have in other countries.Overall rating:I think that Oreo cookies are amazing. They have a unique taste. Super crunchy on the outside but melt in your mouth as well. The crème is delicious and super tasty. I recommend getting these for a party or if you have kids over for play time.", "Kundu1693": " We all want some snacks and biscuits to eat in the odd times of the day. I also need to eat something to satisfy my tummy. I got impressed from the advertisements and it compelled me to try oreo. The advertisement is so cute, by a liltle girl , pehle twist karo, phir lick karo. I love it. Okay , coming back to the oreo biscuit I would say it's taste is really nice.It comes in different flavours but I tried the variance of chocolate and vanilla because chocolate is always loved. It gives you some chocolately flavour with cream inside. The taste feels good once it enters your mouth.The packaging is also very nice and appealing. Twisted from the bases, the creme might be little disappointing but when eaten together with the exceptionally crunchy cocoa biscuit, the filling transform to a very tasty one then. No more feeling of disappointment and incredible taste of creme along with the biscuit. The biscuit is so dark and chocolatey. The price are also very reasonable and affordable. I would recommend it to everyone to try it once.", "LillKing": " I purchased the pack of 24 treats, however it beyond any doubt looks like more than that to me, in light of the fact that they speak the truth 1/2 inch/1.5 cm in thickness. Healthful data states 2 treats is one serving. We should not discuss the calories, hack, but rather two treats has around 25g starches(18 sugar), 9g fat(3 soaked), 40mg potassium, 90mg sodium, 6% Iron, and 0 cholesterol. From the sweetness, two truly does the occupation as a nibble however must concede, it is anything but difficult to eat 4+ in a sitting.:- PThe bundle even has a LIFT Pull Tab on the top(that truly light blue thing you find in the photograph to one side of the word OREO).I concur with a couple of different surveys that the measure of \"stuff\" appears to be more like the Double Stuff from times long gone, however I am more than fulfilled by the amount!As a matter of fact, the treat part does not suggest a flavor like chocolate to me by any stretch of the imagination. Not at all. I am simply dunking them in my espresso and it is ALL GOOD! Also, I must concede, I don't review the treat part's taste as it was constantly dunked in milk or espresso previously.Generally, I am more than fulfilled by the treat.", "k11kapoor11": " We all love biscuits as nashta with tea. Or we consume it any time when we are hungry. I have eaten a lot of biscuits of different different brands.But oreo cookies are the best and tastiest among them. They are sweet combination of chocolate and cream. They are more tastier when consumed with milk. Even we can make oreo milk shake with that. It's just simply awesome. It's packing is also good. People should at least once have these biscuits.", "kripa_db": " Oreo is my daughters favorite biscuits. She makes me put one everyday in her tiffin. It also comes in different flavors such as chocolate, vanilla, strawberry and orange.The chocolate cookie and the vanilla cream make a yummy combination. In the ad they show that if you dunk it in milk it tastes good but have never tried that. I like to eat it just like that. Whenever I am hungry it is the first thing I look for.", "sararishi": " As chocolate is my favourite flavor I used to eat flavoured chocolate cookies and ice creams. Oreo is too good. As it has cream inside and chocolate outside .Sandwich like structure looks beautiful and tasy too. Thats why it is a popular brand all over india. Even oreo crush found to be in ice creams and milkshakes . People liked them . I too crazy about that too. Flavour and packaging is too good . Nice quality cookies.", "preeyanka08": " Oreo is well known biscuit brand. Trust me it really good. The oreo biscuit can be used in a lot of ways. For instance I use Oreo in four different ways. I make oreo cake, then oreo milkshake with cream and milk, Oreo ice-cream with cream and last but not least Double Dutch oreo. Love all that you could do with biscuit. Its got a good chocolate and vanilla flavour.The best part is when you dip the oreo in warm milk. Nice quality provided. So its a must buy and eat if you haven't tried it yet.", "GGCS_9425": " I just love Oreo Cookies. You will exeperience heaven while eating it. My little daughters just love it. Whenever they get sad or get angry I present them with Oreo Cookies and they forget everything.The quality and quantity of the cream biscuit is really convincing. The price is also within range. You can buy loads of it. So take my suggestion and go for it. If you don;t like this give them to your children. They will love you for that.", "kush155": " These Limited Edition Brownie Batter Oreo Cookies are dark.The creme in these cookies is so dark that the cookie looks like it’s made with three chocolate wafers. These cookies are so dark that I’m afraid to eat these outside at night because if I drop one, I don’t think I can find it before the five second rule goes into effect. The cookies are so dark that I’m surprised they’re not a Sith Lord named Darth Atter.Unlike many of the new limited edition flavors this year, Nabisco didn’t do anything special with the crunchy wafers. There’s no food coloring(red velvet). There’s no special flavor(s’mores and key lime pie). It’s the standard chocolate Oreo we all know and we all love, except for the folks who made Hydrox, and in between the wafers is a brownie batter-flavored creme.Before trying these, I wondered how different they would taste compared with Chocolate Oreo Cookies and their Jedi robe brown-colored creme. So I did something I rarely do. I bought a package of regular Chocolate Oreo.(Seriously, including the package I bought for this review, I believe I’ve only purchase Chocolate Oreo twice in my life.) And after trying the two, I have to say Brownie Batter Oreo is much better.The extremely busy labcoat-wearing folks in the Nabisco test kitchens did a wonderful job with these cookies. The aroma that comes out of the package after opening it smells like brownie batter, and it also reminds me of the hot fudge on a McDonald’s sundae. The creme itself tastes like I’m risking the chance of getting salmonella by licking clean a wooden spoon covered with prepared brownie mix. It has a richer and fudgier flavor than the Chocolate Oreo creme. It’s delightful and I’d recommend licking it, if you’re into that.But the chocolate wafers do get in the way of the brownie batter creme. When eaten whole, I taste more of the wafers than the creme. But it does get a bit more noticeable in the aftertaste. Of course, if you were to eat these in an unconventional way, with one of the wafers removed, the brownie batter flavor definitely stands out.If you love licking brownie batter off a spoon or, if you’re civilized, run your finger along the spoon’s head to get some of that brownie batter goodness, I think you’ll love the flavor of these Limited Edition Brownie Batter Oreo Cookies.(Nutrition Facts – 2 cookies – 140 calories, 60 calories from fat, 6 grams of fat, 2 grams of saturated fat, 0 grams of trans fat, 0 milligrams of cholesterol, 100 milligrams of sodium, 70 milligrams of potassium, 20 grams of carbohydrates, less than 1 gram of fiber, 13 grams of sugar, 1 gram of protein.)Item: Limited Edition Brownie Batter Oreo CookiesPurchased Price: N/ASize: 10.7 oz.Purchased at: N/ARating: 8 out of 10Pros: That brownie batter creme is wonderful. Brownie batter flavor without the brownie batter hazards. Better than Chocolate Oreo. Better than Cookie Dough Oreo. Cream licking."}], {"nottyrajat": " When we heard the name CADBURY itself our mouth waters at it's best!A best Cookies has been introduced by non other than CADBURY Company! We all have ate Dairy milk chocolate from CADBURY company but this is also awesome like dairy milk chocolate! As two chocolate wafers Biscuits sandwiched a too gentle white cream which gives heavenly taste as well as a gorgeous look!Before Oreo  I Prefer to used Bourbon biscuit in mornings during breakfast but after eating this I don't have other taste to prefer when it comes to cookies!I assure you that you will get the good taste to the best taste while taking this cookies with Milk . Combination at it's best!(y)Every Age group Must prefer this from children to Old.Must try and spread sweetness:)", "tamangvkeyizm": " Baked by Nabisco, (National Biscuit Company) since its founding in 1898, and currently selling at the rate of 11 billion biscuits a year, the Oreo proudly proclaims itself the world's number 1 biscuit.The Oreo is basically an imperial juggernaut of a biscuit, whose stable mate brands use nicotine, alcohol, caffeine, fat and sugar to appeal to consumers. If you are looking for that lovingly home baked taste you really have come to the wrong place.So what can I say about the Oreo as a biscuit other than its capitalist credentials? Well its main ingredient is sugar and it consists of two rather sickly dark cocoa biscuits, bearing the company logo, back to back with some white sugary creme stuff in between. Variants are available where the creme is flavored with coffee, mint etc. There are also ones that have been covered in fudge of various types. Can you feel your arteries hardening as you read this?The pack absurdly comes with eating instructions, of which there are six stages. I won't detail them all but basically you are encouraged to wrench the thing into its component parts. What is the point of assembling it in the first place if you have to take it all to bits to eat it? Well I'm assuming this is what Altria refers to as \"Marketing Excellence: Expertise and imagination applied by our consumer packaged goods companies in the development of outstanding consumer brands.\" This statement is number two on the list of what Atria stands for.I'm also gratified to see that the pack describes the contents as biscuits not cookies.Thanks.", "gojosh889": " This Cookies are like the most tastiest and simplest cookies in the world.They are so good that they are used in Cafe coffee day as crushed oreos on their coffee.That is when I became a fan of this product and started using it on my home-made coffees to get that same taste.Oreo basically comes in two flavors .first is the vanilla flavor and the other one is the chocolate flavor .Both are equally good.These cookies have more cream than that of products like dark fantasy.Using Milk to dip is also a good choice to consume the product. The product is quite cheap for the taste it provides .It only about 15 Rs for a pack.I have a best way of eating this cookie. I usually buy both the flavors together and eat it mixing both the creams together(don't work its not disgusting .I just remove the biscuit containing he cream and join it with the other flavor .Its has a good taste .trust me. Every body reading this must give it a try .and let me know how you feel.", "naveensri": " Oreo cookies now-a-days have become talk of the town due to their beautiful advertise of ranbir kapoor and also they make one of the best cookies with cream in it and with miltiple flavours choclate, milk and strawberry.I biscuit is costly around 15 to 20 Rs pack I dont remember the exact value as I prefer to get it from Dmart in our money kitchen shopping.but mummy doesn't allow to have it and she keep it for guest to have a good impression.But I have it the cookies .ake me greedy and I break the rules for it.Oreo is a mixed biscuit with two layers and cream in the between they have started two flavours and I have tasted both of it.The cookies are made from the pure choclate dry and the between cream is of milk or in strawberry flavour the cream is made from strawberry amd milk.both the flavours are ultimate am really a huge huge fan of Oreo cookies.", "satyahanieez": " I am a huge fan of cream biscuits. In that I love Cadbury biscuits more.  Oreo is a product of Cadbury Company. It is introduced in 1912.Oreo consists of chocolate rapers wafers and cream.the cream is sandwiched in the  two chocolate wafers.Each bite of it will take us to heaven. Oreo is well done biscuit. It is a great cookie in dark colour. There are many cookies introduced by Cadbury but the best cookie I like most is oreo. I love to eat the cream of that biscuit  and I always eat the wafer of it after eating the sandwiched cream. It tastes best. So friends, oreo is so yummyyy. That satisfies your tummyyy.", "knockaround": " =I think this products existed in western countries for long time. For us it is comparatively new.but in short span it is becoming favorite of lot of people.Thanks to their good advertisements. Anyways, about taste they taste awesome.milk cream and chocolate flavored wrapped biscuits makes a perfect combination.As they show in ad I also think you would not like to share it with others. I have never tried it with milk but with tea it is not that good. Instead try it plain. Fills your hunger. So you can carry it to treks or outings. Keep it stored in home as kids also love it. I love it.This one is a quality product.", "nooralam": " I like eating oreo cookies because I like it's taste, it tastes like cadbury, and it is very delicious! I like to eat oreo because it is very healthy besides taste, I like to have this cookie  with milk, it tastes great with milk.I like oreo very much and I had treated many loved ones with it and they are melted with the taste of oreo, the price of the product is quiet high, as a student sometimes it is not affordable to taste it everyday!", "Jeanlhamu": " This has been my all time favorite and for all the right reasons. It caught my attention due to its black colour with white cream, which was off beat back then as biscuits did not come in such colour. The taste was as good as it looked.The biscuit is soft, the cream melts in my mouth and the sweetness too is perfect, unlike other cream biscuits that are either too hard or too sweet. Now that Oreo has come with two more flavors, vanilla &amp; chocolate, its a bonus. The new flavors too are amazing and tastes great. Oreo is the perfect cream biscuit, infact the best cream biscuit in Indian market.", "shivani98765": " Oreo biscuit is a branded biscuit and  it is available all round the world. Oreo is has dark chocolate biscuit Its cover is so damn tasty and its filling is of white creamy niece is a lover of oreo biscuit .chocoloate is buscuit is very crunchy.My neice as she is just 1.5 years old cant have the chocolate cover so  she loves licking the cream inside.It is a number one biscuit.Though the price of the biscuit is liitle high but its worth eating .It is very delicious and it looks as if I am having White cream gets the taste of milk.IT is full od mineral, vitamin and nutritient.IT is a high class and superior quality of biscuit.I am a sweet biscuit lover and  every week I finish almost 3 packets.'Oreo' in the range of deserts like donuts, ice-creams and all.I simply love the biscuit and I love the flavour of the biscuit.", "amitmasand226": " Well i'm sorry I just could not think of a better subject for this topic.But, what can I do, i'm helpless, it's basically because that's my first expression when ever I see, or eat Oreo .The first time I heard about this brand was back in 2001 when I was watching an episode of a SITCOM by the name of friends when I saw a guy munching onto these cookies with a glass of milk.I have always had a liking for cream filled cookies but nothing as compared to oreo's.*Back in 2010 when I saw a packet of Oreo at Spencer's I could not resist myself, even though I did not know how it would taste I still went ahead and bought the packet.It costed me Rs.35 and there were barely 10-12 pieces in it.But when I took the first bit out of it I simply feel in love with it, within days I became addictive and yes I did put on some extra pounds as well.*strong textOn a serious note, the product is available almost at every single grocery shop, there's a packet of Rs.10, Rs.20 and Rs.35 and provided if you're lucky enough you might find a bigger family pack at Spencer's for Rs.150.It comes in 3 basic flavors, vanilla, chocolate and strawberry but the cookie or the biscuit will always be chocolate in flavor.Not only is the biscuit crunchy but the cream is extremely soft and mouth watering.Unlike other cream filled biscuits this one is crunchy like literally crunchy.And you can enjoy it at any time of the day but I enjoy it the most with a nice warm glass of milk.One can also do some wonders with this product but experimenting a bitstrong text1.Oreo shake - Take a glass of chilled milk, 5 pieces of Oreo, a spoon of coco powder or a spoon of melted chocolate, mix it in the grinder and within seconds you have a wonderful, delicious glass of Oreo shake2.Oreo sandwich - Take two slices of white bread, toast it up without butter, take 4 pieces of Oreo and then flip the creamy side and stick it with the bread.There you go, you're Oreo sandwich3.Oreo ice cream platter - take 2/3 scoops of vanilla ice cream, crush 4-5 Oreo and mix it with the ice cream, mash it up with the ice cream and then mix a scoop of chocolate ice cream on top of it.", "drjyotiphd12389": " When I saw the commercial of this product I wanted to try this cookies. Taste wise it is great. The cream is tasty as well as the chocolate cookie is very crunchy.It comes in various flavours vanilla, chocolate and strawberry etc. I tried chocolate flavour which was awesome with it's  flavour. I also like strawberry flavour it is too good as the chocolate one. Oreo cookie is the best in it's flavours. The cream is sandwiched  between two chocolatey biscuits. It is awesome in taste.These cookies have more cream than other  cream biscuits.  I usually dip the cookie into the milk it is also good choice to consume the product.It is a great cookies in dark colour. There are many cookies introduced by Cadbury but the best cookie I like the most is Oreo. It is yummy and tasty cookies.The product is quite cheap for the taste provides. It's only just 15 rs For a pack. The cookie are best in quality. Product packaging is also good.  I recommend this product.", "Midhunmidhun": " The best seller cookie world wide.it has got its own uniqueness.Oreo consist of the milk cream sandwiched between two chocolate wafers.It has got its own unique style of cookie and that makes the difference. Its delicious too.Oreo now launches 'play with oreo' makes even old people to play like a kid. There are different flavours for oreo which has its own characteristic tastes.The advertisements given by the  Oreo team seems to be entirely different from other cookies. It talks about the love towards relationships. Oreo ice creams are also available in market. Oreo is the world's favorite cookie ever known.", "irshad_ansari214": " Well I prefer lots of biscuit out which Oreo is one of the best cookies I had been ate. Well usually prefer this cookie with milk in the morning and believe me guys its tastes amazing just love it. Well this biscuit is baked by Nabisco organisation which names come in the top hundred worldwide baking organisation.I generally eating this biscuit from the past four years and when I taste it first time and just amazed by this biscuit and from that moment I am eating this cookie. Well you can eat this biscuit with many things and anytime.And its watermelon flavors is best among all of them. And usually its a best way to spend time if you have nothing to do.", "hashimta123": " Everybody knows Cadbury the company which is known for its chocolate products. ##Oreo## is the another product of Cadbury but its not chocolate its a chocolate flavored biscuit.Packing and looks: The packing of the biscuit is good and the plastic cover of the package is of good quality. The chocolate flavored biscuit which is of dark chocolate cover is sandwiched by a layer of cream. The cream is of different flavors like vanilla, strawberry, etc. The biscuit is round and there is some sort design on the outer surface of the biscuit. I have tasted the strawberry and vanilla flavors.How it taste: For those who like chocolate flavor this is the thing even eating it freely with out any dips will be tasty. But the real taste is when you dip it in milk or I use lightly hot black tea which are best to go with Oreo. when you dip it and eat you will surely love it. Do as they say in advertisement \"Twist Lick and Dunk\"Price: For a price tag of 35 Rs/- you get a 150gm packet. Which is not so high when compared to the company's name.This biscuit can replace a one time meal; when you have a packet of it you will feel your stomach full. And it may also makes way to gain weight because it contains little amount of fat.", "sachin_wadekar100": " Oreo is biscuits which I want daily, I am buying daily . This products taste is really nice and good.It is like a sandwhich in shape chocolate cookie and it is crunchy . It comes in three  types that are vanilla, chocolate and strawberry.I tried flavour that was vanilla and I like it. I don't like other flavour thats taste is not like vanilla.The cream is sandwhiched between two chocolaty biscuits.This is one of the different and really exceptional. It is one of the addicting product that if you eat first time after that you want more n more. And you can't stop to eat it.This product eat with milk but without milk also it is good in taste.The packing of this product is also nice and comes in blue plastic pack. The quality is also nice that everyone want to eat it.The price of this cookie is also affordable to all class people's.", "rgeeta1170": " My experience with the best chocolate biscuits Oreo has been very good and its become my favorite brand in biscuits. Earlier my favorite biscuits were the Britannia Jim jam biscuits with the jelly and cream in the centre but the sticky jam was annoying.So one day I tried oreo biscuits and bought a bundle of them like all the flavors from big bazaar. I got chocolate, strawberry and vanilla flavor. I tried them all on multiple occasions. I enjoy munching biscuits and chips occasionally. I loved the chocolate and strawberry flavor but the vanilla flavor is horrible.The biscuits are very good in quality and taste. It comes for 30rs for 10 biscuits in a packet.I would recommend oreo biscuits as they are good in taste but not the vanilla flavor.", "sourabhsj": " I love eating biscuits but quite choosy with the taste. I have such a delicate taste. so I don’t just eat any kind of biscuit if it does not fit my standard. However, there is one great favorite of mine which perfectly fits my palate and this is no other than the very popular, Oreo. While Oreo may be more expensive comparatively, I think the price is worth the satisfaction.This one is different. The taste is really exceptional. It is slightly bitter and creamy sweet combination made into one fresh slightly crunchy bite. I think this one is addicting.I could not explain the fact that once I started one, I’d not stop until I finish off the whole package. I always prefer the variant Filled with Vanilla Cream. I just love it. The sweetwhite vanilla cream filling is an excellent match to the slightly bitter taste of the cocoa flavored biscuit. But for the meantime, I would enjoy my Oreo the way I believe it should be eaten. I just love Oreo and will always do.", "tanaykochrekar": " Shortest Commodity Reviews: Oreo CookiesOreo are the only cookies to introduce their own flavor, 'Oreo' in the range of deserts like donuts, ice-creams and all. With a super cute advertisement of father and son, Cadbury launched this vanilla cream filled dark cookies with a bang and succeeded well.The cookie, is extremely bitter tasted as the perfect antithesis for evergreen vanilla flavor of the cream. I don't like this product much, but I do like that Oreo doughnut when I visit mad Over Donuts or'Cookies n' cream' Amul Ice Cream in the variety of many flavors.So, it earns good marks in my books, but they are just too pricey and expensive so I'd either gift them or receive them as gifts, but would never eat them at my own expense.Be India. Buy Indian.", "Asif25": " I use this cookie when I am hungry. It beats the hunger away and its taste is very good. It is very tasty I eat this cookie with milk and in this we get 2 tastes 1 is vanilla and 2 is chocolate.This is the best biscuit I ever found. Yes, it is quite expensive but I would say it is worth it.", "shashigaikwad490": " Yummy and creamy are the 2 words which describe Oreo Cookies. It is very tasty and chocolaty. I had this 1st with my niece at her place when she was having it. I usually do not prefer cream biscuits but this one I really liked. It is dark chocolate wafers with a sweet cream filling in between.The taste of Oreo is like bonvita flavor biscuits on top and vanilla ice cream in the middle. I had it with milk as I love to have milk a lot, and it tasted very delicious. My niece had it with a different pattern she 1st licked the cream in the middle and then dipped the biscuits on milk and had it. She is too fond of Oreo and I believe every kid would be, as its taste is very kids kind.Try it  and you will love it."}], {"ishdutta": " I seriously do not understand what is about Oreo that people like? I do not like the taste at all. I think they ask you in the advertisement to dunk it in milk or whatever and then eat because people just cannot bear the taste solo. I really applaud the marketing and advertisement team for making people believe that it is a great cookie and thus improving sales. In my personal opinion, I would prefer Priyagold cream biscuits over Oreo any day.There is one thing though I love about Oreo: The racist jokes doing the round on Whatsapp these days. Lol.", "awonibano": " The first ever Oreo cookies that I had was when they were not even launched in India. They are awesome, sweet, and crunchy. My little nephew loves it with his breakfast. Now they are easily available at most of the stores in India and two flavors of the cream that is sandwiched between two chocolaty biscuits. One is vanilla and the other is strawberry.They are available in Rs. 10 and Rs. 30 packs. Oreo is loved not just by, but so many people. This is evident because of the number of desserts it's included in, wherever I go. At the cake shops, you will find a cake with Oreo decoration or fillings. At the ice cream parlour, again there ice creams and shakes that have the option of including Oreo crushings. At Mc Donald's the fantastic Mc Flurry is also accompanied with Oreo crushings.Food industries should manufacture more biscuits like these.", "prayaga1989": " Oreo my all time favorite biscuits and my lovely time pass. everyday this is my start up breakfast with milk. they taste so yummy that even the last biscuit tastes so better. Vanila flavor is much better than choco flavor.Try eating it everyday morning you feel very fresh. they have different retail packaging starting from 10 rs of vanila flavor and 15rs for choco flavor. and jumbo packets are also available in both the flavors. Happy Happy is another from parle which is similar to oreo. overall recommended product with 5/5 rating.", "kumtharahul": " Today I'll be sharing my experience and review on the possibly best cream biscuit in the market Oreo.Earlier before the oreos were available my favourite was the bourbon biscuits with chocolate biscuit and chocolate cream in the center along with sugar sprinkled on the top. Another favourite of my mine was the Britannia jimjam which had biscuit and cream, jam and sugar in the middle.When oreo was launched ivsaw the ads and wanted to try it out. So at first I tried the chocolate oreo and it was great. Its so much better than other chocolate cream biscuits. Another flavour I tried was the vanilla and its just as bad as the chocolate one is great. Later after sometime strawberry flavour was released and its too as good as the chocolate one.The quality and the taste in oreo biscuits is so much better than the other biscuits. You can genuinely taste the chocolate and strawberry and its so much balanced and perfect. The biscuits are pricier than the other ones like 30 rs for 10 pieces in a packet.So I would recommend this oreo biscuits for everyone to try and decide for yourself. Only the chocolate and strawberry flavours are great but definitely avoid the vanilla flavour. I like them and would rate it 5 in terms of flavour, quality and quantity.", "Manizem": " Oreo cookies are from heaven, certainly no doubt about that. One bite of the highly calorific delight and you are ready to plunge greedily into the entire pack .However, one of the newly launched flavors 'peanut butter..' is not what I would exactly call 'from heaven..''.To put it as subtly as possible, it tastes weird and for the lovers of the original, parent Oreo cookie, the one with the rich white cream which tantalizingly melts in your mouth, this particular flavor will come as a grim disappointment. Believe me, it did not taste like peanut butter, the layer of cream was disappointingly thin and the whole experience just left me feeling a bit glum. The fact that one has to shell out five bucks extra will no doubt make you cringe after your first bite!!!!!Infact I don’t remember an Oreo pack that lasts five minutes after opening it. In this case I was compelled to share it. Surprisingly I did so… gladly...Stick to the original. It’s yummy!!!!", "payalk832": " Who does not like Oreo biscuit? I am a die-hard lover of Oreo biscuits because they taste heavenly. Vanilla flavor is my favorite as I am not a strawberry fan. Vanilla cream in between chocolate wrapped cookies, what else would you want? The small packet cost 10 rs and you have 5 biscuits inside, which is perfect for a snack. It tastes all the more good if you have it with milk, plain milk because the sugar quotient is already high in the biscuit. You can have it for breakfast or evening snack and one packet is enough to suffice one person.The strawberry flavor is also a good attempt but failed to impress me because the combination of strawberry with chocolate itself does not go well. Nevertheless, the taste is not that bad.", "ridhima445": " These biscuits are worth giving a shot. There are number of dishes you can prepare using the oreo. I personally love the Oreo Milksake, so smooth so creme. The creme really does feel and taste like cream cheese frosting. Similar to some cupcakes, the frosting/creme has a tendency to overwhelm the cake portion, or in this case, the Oreo wafers. I love the Vanilla Oreo biscuits personally. I niece and nephews are all mad behind Oreo.Oreo thanks fro being there.", "triloki1092": " Let me be honest, I don't really like Oreo Cookies. It is one of the most well know cookie brand and has a fan following of its own. People are crazy about it and swoon over it. I am not sure what is all the fuss about it!I have tried all variants available in India, but did not like any of them. I tried them multiple times hoping that I will realize that they are as good as every one says. But no, still did not like them.In-fact they do not even taste good on their own. Their biscuits are very dry and hard to bite and their cream isn't anything special either. Yes dunking them in milk does helps and greatly increase the flavor but what I am supposed to do when I am not home and I do not have milk?I think its all marketing and plain over-hyping a product. Now they even use Ranbir Kapoor in their advertising, good for them! Verdict: You will not die if you eat it, but there is nothing special about them as well!There are much yummier cookies available out there.", "murgandev": " Just now when I was having my tea I just felt having something light with my tea and my daughter passed me her OREO cookies. I usually don't like to eat sweet in the morning. But OREO is great. Dark cocoa biscuits on both sides filled with vanilla cream in the center.it's very balanced.It tastes yummy.Children love it even I like it.Its very economic only Rs.10/- for a mini pack.", "snehat": " Cookies-The very name makes you hungry na!!!Well,Oreo's are probably the MOST DELICIOUS cookies ever made!!INTRODUCTION:Oreo Cookies,a creation of Nabisco has been called America's Favourite Cookie.These yummy goodies combine the best of both worlds with their sandwich like design combining a dark cookie with delicious white cream.More recently,with 11 varieties,one can enjoy the taste of Oreo cookies with mint or even fudge!As Robert Redford said,''Health food maybe good for the conscience but Oreos taste a hell of a lot better.''DETAILS:Oreo Cookies are probably the most commonly known and consumed.The first Double Stuff Oreo was released in 1975.Over 362 billion Oreo cookies have been sold since it was first introduced in 1912,making it the Best Selling Cookie of the Twentieth Century.Many varieties of Oreo Cookies have been introduced.Some of them are:Fudge Covered OreosHalloween OreosChristmas OreosChocolate Cream OreosFEATURES:Oreo Cookies are of good nutritional value too.They contain:152 calories,1.7 grams Protein,9.7 grams Fat,43 grams Carbhohydrates and 210 mg Sodium.The various ingredients are Sugar,Wheat Flour,Vegetable Shortening,Food Acid,Emulsifier,Cocoa Powder,Maize Starch,Raising Agents,Salt and Flavour.It even contains Traces of Peanut,Sesame,Egg and Milk.PRICE:The price of 32 grams is Rs.30.The box contains three cookies.The price of 100 grams is Rs.80.The box contains around 18 cookies.CONCLUSION:Thus,no wonder this is my favourite cookie!The very feeling of opening the doubble cookie,having its yummy white cream and the black cookies is just heavenly!!!Hope you all liked the review!Do leave your comments and ratings!!", "ranjana86": " Oreo was a revamped version of the already available cream biscuits.thats what I thought ot was, till I tasted it:)Its nothing close to the cream biscuits we have in the indian markets. Infact its way yummier and tastier. The cream center is creamier and the biscuit crunchier:) Usually, the cream centre feels jus like \"dried\" cream! But not with Oreo.I love their Vanilla and Chocolate filled variant. Both are equally tasty.Why you should taste it-Yummy cream center-Crunchy biscuit-very good packaging-Comes in smaller variants too-availability is not an issueCons-Price!(Damn.!)Final Verdict:Petfect accompaniment to tea:)", "swtneha31": " Hi all,me and my family really appreciate oreo cookies a lot specially its chocolate cream flavour. vanilla orange and strawberry are also nice but chocolate is the best.the cream is tasty as well as the outside cookie is very chocolate and crunchy. it gives the feeling of having a pure dark chocolate.I always stock my home with at least 10 packets any time.we have it during snacks with tea plus serve our guests as every1 love it.kids love it too. its very delicious.and since its reasonable it doesnot digs a hole in ur pocket", "Heena0504": " Oreo cookies are simply Heaven. Oreo biscuits are easily available in market and in different flavours like chocolate, strawberry and vanilla. In just INR35 you can make heavenly yummy desserts. You can crush, fix, cook your milk cookies to make n number of recepies like Chocolate pudding, Oreo truffle, Oreo icecream cake and my favourite Oreo delight brownie.Can I share my favourite recepie? This one is for who all are chocolate lovers with no butter, no egg, no flour .so Enjoy!Eggless Walnut Chocolate Brownie:Duration: 10 minsIngredients:1 regular pack of oreo chocolate cookies1 cup of milk2-3 tbsp of sugar3-4 walnuts1 sachet of plain EnoMethod:crush the oreo cookies in a mixie jar. Take a pan and pour one cup of milk and put it on flame for 3mins with 2-3 tbsp of sugar as per your taste. Now add the crushed mixture in the milk and make a smooth batter. Add walnuts into it.Take your Microwave safe bowl and grease it with oil. Put the prepared batter in that bowl and then bake it in Microwave for 5mins.Your brownie is Done.If you want to surprise your loved ones with a chocolate cake, Go prepare and decorate it with colourful gems, icing sugar or different sugar candies available in market.Prepare it share your comments!", "sanjaynpunjabi": " Seriously, whats sooo good about it?Going by the positive reviews read about this, I could swoon. So much hype about it, its kind of corny.Ok two circular artificial color loaded dark black, chocolate flavored biscuits sandwiching some equally color loaded chocolate flavored cream.Not bad, but whats the novelty factor here that people are going ga ga over it? Mass psychology at work or is it something more sinister?The taste is average, the price pricey and the packaging, as someone suggested, could have been better to avoid crumbling inside.The TV ads are super duper though - the playing of the little girl with her papa kind of touches the chord."}]